[{"title":"Google Fit: Activity Tracking","descriptionHTML":"Get to a healthier and more active life with the new Google Fit!<br><br>It&#39;s hard to know how much or what kind of activity you need to stay healthy. That&#39;s why Google Fit collaborated with the World Health Organization (WHO) and the American Heart Association (AHA) to bring you Heart Points, an activity goal that can help improve your health.<br><br>Activities that get your heart pumping harder have tremendous health benefits for your heart and mind. You&#39;ll earn one Heart Point for each minute of moderate activity like picking up the pace when walking your dog, and double points for more intense activities like running. It takes just 30-minutes of brisk walking five days a week to reach the AHA and WHO&#39;s recommended amount of physical activity shown to reduce the risk of heart disease, improve sleep, and increase overall mental wellbeing.<br><br>Google Fit will also help you:<br><br>TRACK YOUR WORKOUTS FROM YOUR PHONE OR WATCH<br>Get instant insights when you exercise and see real-time stats for your runs, walks, and bike rides. Fit will use your Android phone&#39;s sensors or Wear OS by Google smartwatch&#39;s heart rate sensors to record your speed, pace, route, and more.<br><br>MONITOR YOUR GOALS<br>See your daily progress on your Heart Points and Steps goal. Meeting your goals all the time? Easily adjust your goals to keep challenging yourself to achieve a healthy heart and mind.<br><br>MAKE ALL YOUR MOVEMENT COUNT<br>If you walk, run, or bike throughout the day, your Android phone or Wear OS by Google smartwatch will automatically detect and add your activities to your Google Fit journal to ensure you get credit for every move. Want extra credit? Turn up the tempo on your walks by starting a paced walking workout and stepping to the beat. Enjoy a different type of workout? Select it from a list of activities like pilates, rowing, or spinning, and Google Fit will track all the Heart Points you earn.<br><br>CONNECT WITH YOUR FAVORITE APPS AND DEVICES<br>Fit can show you info from many of your favorite apps and devices to give you a holistic view of your health, so you&#39;ll never lose track of your progress. These include Lifesum, Wear OS by Google, Nike+, Runkeeper, Strava, MyFitnessPal, Basis, Sleep as Android, Withings, Xiaomi Mi bands, and more.<br><br>CHECK IN AT ANYTIME, FROM ANYWHERE<br>See a snapshot of your activity history across Fit and your integrated apps in the redesigned journal. Or, get the full picture in browse, where you can find all of your health and wellness data.<br><br>KEEP A FINGER ON THE PULSE OF YOUR HEALTH<br>Breathing is one of the simplest ways to reduce tension and relieve stress. With Fit, checking in with your breath is easy—all you need is your phone camera. As well as your respiratory rate, you can measure your heart rate to get a better understanding of your body’s wellbeing.<br><br>VIEW YOUR DAY&#39;S STATS AT A GLANCE<br>Add a widget to the home screen of your Android phone or set up a tile and complication on your Wear OS by Google smartwatch.<br><br>Learn more about Google Fit and see a list of supported apps at: www.google.com\/fit","summary":"Want to take charge of your health? Let Google Fit help you reach your goals.","installs":100000000,"minInstalls":100000000,"realInstalls":296117598,"score":3.625644,"ratings":654801,"reviews":28657,"price":0,"free":true,"currency":"USD","offersIAP":false,"inAppProductPrice":null,"developer":"Google LLC","developerEmail":"apps-help@google.com","developerWebsite":"http:\/\/www.android.com\/","privacyPolicy":"http:\/\/www.google.com\/policies\/privacy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/jArSD-kxOa2llPXvqrjRcEJdL4XhjP8-WqEfg9UAlYF8v0qzXAZ0EI5k96l0pf3tDNg","headerImage":"https:\/\/play-lh.googleusercontent.com\/PZ0lg4Ip7xtATY6HzziurtOpH53w37Bz8kMzOOV9wyH-mSsw1gc4spVFZCgE0Y5qgA","screenshots":"['https:\/\/play-lh.googleusercontent.com\/fAvgVK17vHg9u2vunheRDa-oARLz338U2-vgdBtrpESk9KHwuIzfI18C8J90SaZsI_c', 'https:\/\/play-lh.googleusercontent.com\/XbLMBC4ZgXRa5qB2FyKxAufNtQ0p00dqW5zw8LsA4DoiF6ikMLmnOgs099BpCcrRXM4', 'https:\/\/play-lh.googleusercontent.com\/krIjCL2Ew2ldj9zkVCTN4d-IMpo5_kSf7_PfPPWJgydESNrmgfLW5UAqhcK1YW9PxA', 'https:\/\/play-lh.googleusercontent.com\/bKZ7OcnxwEKtgMsb2qQGg4DpTD0_wY9UmLNG14l-1TyxkmxlajOhUdgyBc6aiQqOCA', 'https:\/\/play-lh.googleusercontent.com\/POtMBU5sJXgNRDcSPS3AE5_7rUSesOw-vlYKrEf4Bq-oQRukpvr4luKGxdhjuooxb0Y', 'https:\/\/play-lh.googleusercontent.com\/s_kuEZroENw_JfVVAK_InQyoc6bUi2boPRcmO83MyC6Gpvz_mZUrMDwOXl1jHweBkC4', 'https:\/\/play-lh.googleusercontent.com\/QUu5nxk9UAq8qcySoY0qbp2fQKHjJl7SmvHymjzqrWygublIl08p6eAC5JH6RXEE64Ji', 'https:\/\/play-lh.googleusercontent.com\/T7EH8ieyvRJdKcmxIH5UMm6dbaWGBfJ7hWEFeYGW_q1FNs9yEhTg3vbVImSoH2g7zA', 'https:\/\/play-lh.googleusercontent.com\/lWCOqVE5h_WCPN8sA2kOVhajmy-VbyjXbWgGdhyU95lruKpwpMx-sG8HgCFlOKXZ0F_P']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"Oct 28, 2014","lastUpdatedOn":"Mar 21, 2025","updated":1742558663,"comments":"[]","appId":"com.google.android.apps.fitness","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.google.android.apps.fitness&hl=en&gl=us"},{"title":"Samsung Health","descriptionHTML":"Start healthy habits for yourself with Samsung Health.<br><br>Samsung Health has various features to help you manage your health. As the app allows you to automatically record many activities, creating a healthy lifestyle is easier and simpler than ever.<br><br>Check various health records on the home screen. Easily add and edit the items that you want to manage such as daily steps and activity time.<br><br>Record and manage your fitness activities, such as running, cycling, swimming, etc. Also, Galaxy Watch wearables user can now exercise more effectively through Life Fitness, Technogym and Corehealth.<br><br>Create healthy eating habits by recording your daily meals and snacks with Samsung Health.<br><br>Work hard and always maintain your best condition with Samsung Health. Set goals that work for your own level, and keep track of your daily condition including your activity amount, workout intensity, heart rate, stress, oxygen level in the blood, etc.<br><br>Monitor your sleep patterns in more detail with Galaxy Watch. Make your mornings more refreshing by improving the quality of your sleep through sleep levels and sleep scores.<br><br>Challenge yourself against your friends and family to become healthier in a more fun and interactive way with Samsung Health Together.<br><br>Samsung Health has prepared videos of expert coaches who will teach you new fitness programs including stretching, weight loss, and more.<br><br>Discover meditation tools on Mindfulness that will help you relieve stress throughout your day. (Some contents are only available through an optional paid subscription. Content is available in English, German, Spanish, French, Portuguese and Korean.)<br><br>Cycle tracking offers helpful support in menstrual cycle tracking, related symptom management and personalized insights and contents through your partner, Natural Cycles.<br><br>Samsung Health protects your private health data securely. All Samsung Galaxy models released after August 2016, Knox enabled Samsung Health service will be available. Please note that Knox enabled Samsung Health service will not be available from rooted mobile.<br><br>Tablets and some mobile devices are not supported, and detailed features may vary depending on the user’s country of residence, region, network carrier, model of the device, etc.<br><br>Requires Android 10.0 or later. Supports over 70 languages, including English, French, and Chinese. An English language version is available for the rest of the world.<br><br>Please note that Samsung Health is intended for fitness and wellness purposes only and is not intended for use in the diagnosis of disease or other conditions, or in the cure, mitigation, treatment, or prevention of disease.<br><br>The following permissions are required for the app service. For optional permissions, the default functionality of the service is turned on, but not allowed.<br><br>Optional permissions<br>- Location : Used to collect your location data using the trackers(exercises &amp; steps), Used to display a route map for exercise, and to display the weather during exercise<br>- Body Sensors : Used to measure heart rate, oxygen saturation, and stress (HR&amp;Stress : Galaxy S5~Galaxy S10 \/ SpO2 : Galaxy Note4~Galaxy S10)<br>- Photos and videos(storage) : You can import\/export your exercise data, save exercise photos, save\/load food photos<br>- Contacts : Used to check if you are logged into your Samsung account, and to create a friend list for Together<br>- Camera : Used to scan QR codes when you add friends using the Together, and to take photos of foods, and to recognize numbers on a blood glucose meter&amp;blood pressure monitor(Available in some countries only)<br>- Physical activity : Used to count your steps and to detect workouts<br>- Microphone : Used to record audio for snore detection<br>- Nearby devices : Used to scan for and connect to nearby devices, including Galaxy Watches and other accessories<br>- Notifications : Used to provide you with timely information<br>- Phone : Used to confirm your phone number for Together.","summary":"Lifestyle companion to track your fitness, weight, diet, food & sleep.","installs":1000000000,"minInstalls":1000000000,"realInstalls":2042364950,"score":3.6190722,"ratings":1527915,"reviews":74556,"price":0,"free":true,"currency":"USD","offersIAP":false,"inAppProductPrice":null,"developer":"Samsung Electronics Co.,  Ltd.","developerEmail":"noreply.sec@samsung.com","developerWebsite":"https:\/\/www.samsung.com\/global\/galaxy\/apps\/samsung-health\/","privacyPolicy":"https:\/\/www.samsunghealth.com\/privacy\/","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/le2tv6aaAbpIqEnAnP-KGJbsrcEuePSLZGG4KikbC4mjzpl8itxOJg1oQo6dMgRLxw","headerImage":"https:\/\/play-lh.googleusercontent.com\/aZ1FwD3w1jNbHebz_UIOvUODiFeBw6BIP6uUhv4kGi1kKqUEs57xTYSIdurWx6ZPUZg","screenshots":"['https:\/\/play-lh.googleusercontent.com\/AJGHnpJkcHEEnlM2jcWEFFqrCJ8PFk7glMSbwZYzHE7bh8oXLkcM6p_Cj9SDLR33bZE', 'https:\/\/play-lh.googleusercontent.com\/BbmYAEYDq61SufpCitUC7lIRL2H6b76xyEN3J277VcxOA_RItX3rResw6iMiCAQtyE4', 'https:\/\/play-lh.googleusercontent.com\/SUnZFa8N2dc4pVD6sT9wgUiAUXgb2Bm-epsLrdaKOFQjfEe2ZlwP1GNGWUd-sE9KxUQ', 'https:\/\/play-lh.googleusercontent.com\/gvln_w-mnmFgXUu88Gv7XamOMerjTCOG7rugLU6B-1VZDGBkGQoVCmPcE_uzmc1jp6A', 'https:\/\/play-lh.googleusercontent.com\/VoeroTKJhxHjcu3W3w8Oe4ftQRNo9C3vaI6yxTXOgY5psyIxlo_iCbfY5q-Fjwydmw', 'https:\/\/play-lh.googleusercontent.com\/F1jtLUZ-jmzaC1KnlhcTTR_yZPqL459jCVskjtt-W7PVkdDKFpmvkrLSPE_MDHhgcfQ']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"Apr 7, 2015","lastUpdatedOn":"Mar 27, 2025","updated":1743139435,"comments":"[]","appId":"com.sec.android.app.shealth","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.sec.android.app.shealth&hl=en&gl=us"},{"title":"Fitbit","descriptionHTML":"See the big picture on your health and fitness journey with the Fitbit app. Find easy ways to get active, sleep better, stress less and eat healthier.<br><br>Track the stats you care about across health, fitness and sleep, and change your goals as your routines evolve. Stay motivated with energizing workout content for your body and mind. See how far you’ve come with a glance at your personal goal progress and how you stack up to friends and family. Unlock even more possibilities when you sync up with a wearable device like Fitbit tracker or smartwatch and see how your activity, sleep, nutrition and stress all fit together.<br><br>GET MORE ACTIVE: See how small moves add up by using your smartphone to track steps and distance—or pair with a Fitbit tracker or Wear OS by Google smartwatch to record your heart rate, Active Zone Minutes, calories burned and more. Leverage tiles and complications to easily access your stats.It’s a fitness planner in your pocket: Use the app as a diary to set goals and track your progress. Plus, that motivation you’ve been looking for is right in the app. Bring the gym home with a curated list of audio and video workouts that you can do at your own pace, right from your living room.* You’ll find sessions for HIIT, cardio, strength, running, biking, yoga and more.<br><br>TRACK YOUR HEART HEALTH: Understand your overall health by using your watch or tracker to keep tabs on your heart rate 24\/7. Monitor your heart rhythm and see your resting heart rate trends, plus time spent in heart rate zones during workouts.<br><br>SLEEP BETTER: Find sleep tools to help you learn about your sleep quality and improve it—from  measuring your sleep duration and sleep stages to understanding your restless time. Set reminders for bedtime and wake-up time to keep your sleeping schedule managed.<br><br>STRESS LESS: Listen to audio sessions to lessen stress and improve your mood. Use mindfulness to start your day a better way, find moments of calm and set intentions with meditation or get help falling asleep with breathing exercises and relaxing sounds.*<br><br>EAT SMARTER: Keep your diet in check with easy-to-use tools for setting goals. Tracking meals and logging food &amp; water intake lets you see if you’re getting enough protein, fat, fiber and carbs on your way to managing your weight and overall health.<br><br>EVEN MORE WITH FITBIT PREMIUM: Upgrade to Fitbit Premium and get all the guidance, insights and inspiration you need to take your workout routine to the next level. [link: https:\/\/www.fitbit.com\/global\/us\/products\/services\/premium]<br><br>• Your Daily Readiness Score helps you understand when it’s time to go all out and when it’s time for rest &amp; recovery—plus, you’ll get recommended workouts based on your body’s needs.<br>• Get the support you need across a whole library of workouts to keep your mind and body fit—from strength training, HIIT and cycling to dance cardio, yoga, meditation and more—led by Fitbit’s expert trainers who are ready to coach.<br>• Perfect your mindfulness practice with a full library of sessions that calm anxiety, prep for sleep and even help you meditate while walking.<br>• Find new ways to rest &amp; recover with your Sleep Score. Plus, check out your sleep patterns and monthly trends in your Sleep Profile.<br>• Feed your appetite with access to easy, healthy recipes to help you reach your nutrition goals and bring your wellness full circle.<br><br><br>*A Fitbit Premium subscription is required to access the full content library.<br><br>Some Fitbit devices let you handle calls and texts right from your wrist so permissions might be required during setup.","summary":"Fitbit is dedicated to helping people lead healthier, more active lives.","installs":100000000,"minInstalls":100000000,"realInstalls":137447244,"score":4.0493813,"ratings":1172433,"reviews":238534,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$7.99 - $79.99 per item","developer":"Google LLC","developerEmail":"android@fitbit.com","developerWebsite":"https:\/\/support.google.com\/fitbit","privacyPolicy":"http:\/\/www.fitbit.com\/privacy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/QhMCymTyxJbzRiwMBA-GYooS-nVKm3fHg2CSRyKHvhmC-e5vOibfST73y1MmScvtPw","headerImage":"https:\/\/play-lh.googleusercontent.com\/GsmD_AIhqiXBgIUGlEDeMZVXgVUAH0mH1RDG0J3AjcR8eap3ZvZ6T6hLw_4I8e411fY","screenshots":"['https:\/\/play-lh.googleusercontent.com\/6rjEtIwRo5k2iOZYbXUIEewnFGo8AJboujtna-9iVKhmRRO-fmsdv0skPTG4KFtt9A', 'https:\/\/play-lh.googleusercontent.com\/gXGdt35AKnlDG-lhqhPJzXcvR0G7lZSl4SFSb7t5_xTES2X_bLBXXt0t0nh-l-OludI', 'https:\/\/play-lh.googleusercontent.com\/iNjYSIQm432qolpWsN6LUqcDtoVXFPGIHNEauf77-smSpydtX7tUx0jypCloxGGd2zA', 'https:\/\/play-lh.googleusercontent.com\/Ks-huL95lIIQHyNDS6DzRd2HukFxGnAMIrgDMZtkXNvaDa_LkeexEMqm0FECMdnHcs8', 'https:\/\/play-lh.googleusercontent.com\/egwVmp7nQNPXeIsYFMfK1bGBp30x-H2j3M_CBsijJWQy8396_h3PfCDKnO7zYNwr57d0', 'https:\/\/play-lh.googleusercontent.com\/nfJrRoQiWrwoHD0_lhFGKZ1Pk_Sj7n3X7xwMPX0LY3Lrvw6EuEao5PwhIEiSvVcTGg', 'https:\/\/play-lh.googleusercontent.com\/EA8eZPUPhfHRWZODItuXsLw1XOy-V-pLD2oum1luiTJg8yvxhMYdPn0q13KfOFjtrTrX', 'https:\/\/play-lh.googleusercontent.com\/5MXaSgonwPR81mZOIUcPNQiW7T949gPEKnQra0k4pI3XChAtRpB1fn1N489JXZg5lGGJ', 'https:\/\/play-lh.googleusercontent.com\/A-pgjnuZ_6J7P2yeL7Vf0TIJt9wRVCJ8kH5nwsePtw4lWvwRERih0hQfIXYIs_66zEFC', 'https:\/\/play-lh.googleusercontent.com\/Kx1wgpu7728iFe5YlZozbbKt1MK38wLghzvHyC-Q3nPURRjLDDnrodStNH8VGpCSxdA', 'https:\/\/play-lh.googleusercontent.com\/VjGUpqklLxf0MUgc7ZPryr3FYAbYrAaWSPgNfz-gHK9h2jXkcwvexo6KhhOyr74gGQ']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"Mar 16, 2012","lastUpdatedOn":"Apr 28, 2025","updated":1745856748,"comments":"[]","appId":"com.fitbit.FitbitMobile","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.fitbit.FitbitMobile&hl=en&gl=us"},{"title":"MyFitnessPal: Calorie Counter","descriptionHTML":"Track progress toward your health, nutrition, fitness, and weight loss goals with MyFitnessPal. This all-in-one food tracker, calorie counter, macro tracker, and fitness tracker is like having <b>a nutrition coach, meal planner, fitness tracker &amp; food diary<\/b> with you every day.<br><br>MyFitnessPal is a health and nutrition app that helps you learn about your food habits, monitor your diet and conquer your health goals.<br><br><b>Download our health and nutrition app and start your free 30-day Premium trial<\/b> to gain access to exclusive food &amp; intermittent fasting tracker and fitness logging tools, expert guidance, and the calorie counter. You’ll soon discover why MyFitnessPal is the #1 nutrition, weight loss and food tracker in the U.S and has been featured in the New York Times, Wall Street Journal, the Today Show, and U.S. News &amp; World Report.<br><br><br><b>MORE THAN A CALORIE <br>COUNTER &amp; DIET JOURNAL<\/b><br><br>MyFitnessPal, the leading health and nutrition app, is like having a fitness tracker, macros counter, diet planner, and nutrition coach at your fingertips.<br><br>■ <b>Log Food<\/b> – Easy-to-use planner tools that makes food tracking quick and simple<br>■ <b>Track Activity<\/b> – Add workouts and steps with the fitness tracker and planner<br>■ <b>Customize Your Health &amp; Fitness Goals<\/b> – Weight loss, weight gain, weight maintenance, nutrition &amp; fitness<br>■ <b>See Your Fitness Progress<\/b> – Track at a glance, or analyze your diet &amp; macros in detail<br>■ <b>Learn From a Registered Dietitian<\/b> – Meal Plans customized for your target calories and macros, whether you’re into weight loss or weight gain —with access to our Meal Planner, macro tracker, and Calorie Counter tools<br>■ <b>Stay Inspired<\/b> – 500+ healthy recipes for a healthy diet and 50 workouts keep fitness routines fresh and fun <br>■ <b>Connect with the MyFitnessPal Community<\/b> – Find friends and motivation in our active MyFitnessPal forums<br><br><b>A CLOSER LOOK AT FEATURES &amp; BENEFITS<\/b><br><br><b>Gain Valuable Health Insights Through Food Logging<\/b><br>It’s not just a calorie counter for weight loss, diet trends, or a fast route to fat loss—it’s a health &amp; nutrition app and planner that helps you hold yourself accountable.<br><br>■ One of the Largest Food Databases – Calorie Counter for over 14 million foods (including restaurant dishes)<br>■ Fast &amp; Easy Food Tracker &amp; Planner Tools – Type to search, add foods from your history, or scan a barcode or entire meal with your phone’s camera<br>■ Calorie Counter – Follow your food intake with the calorie counter and see your daily progress<br>■ Macro Tracker – See carbs, fat &amp; protein breakdown by gram or percentage—no need for a separate carb tracker!<br>■ Nutrition Tracker and Insights – Analyze nutrition intake and set specific goals for macros, cholesterol, sodium, fiber &amp; more<br>■ Water Tracker –  Make sure you’re staying hydrated<br><br><b>Customize Your App Experience<\/b><br>Choose your settings and achieve your goals with MyFitnessPal<br><br>■ Custom Goals – Follow your energy intake by meal or day with the calorie counter, set goals with the macro tracker &amp; more<br>■ Personalized Dashboards – Pick health,  fitness, and diet stats you want to see at a glance<br>■ Net Carbs Mode\/Carb Tracker – To simplify a low-carb or keto diet, view net (not total) carbs<br>■ Protein and Calorie Counter – Set your protein goals and track how much you eat during the day<br>■ Add Your Own Meals\/Food Tracker – Save recipes and meals for quick logging and keep tabs on your diet <br>■ Count Calories From Exercise – Decide how your activities, workouts, fitness and diet affect daily calorie goals<br>■ Connect 50+ Apps &amp; Devices – From smartwatch, fitness trackers and other health and fitness apps<br>■ Track With Wear OS – A calorie counter, water tracker, and macro tracker on your watch. Add complications to the home screen for faster logging, and the tile for tracking different nutrients at-a-glance.<br><br>View our terms &amp; conditions and privacy policy: https:\/\/www.myfitnesspal.com\/privacy-and-terms","summary":"Log food, nutrition, and macros, find high-protein recipes, and lose weight","installs":100000000,"minInstalls":100000000,"realInstalls":125773527,"score":4.3585854,"ratings":2818625,"reviews":452031,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$0.99 - $99.99 per item","developer":"MyFitnessPal, Inc.","developerEmail":"androidfeedback@myfitnesspal.com","developerWebsite":"http:\/\/www.myfitnesspal.com","privacyPolicy":"https:\/\/www.myfitnesspal.com\/privacy-policy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/DtR_W1lA1tKsbrr2DUo3TLNzqi9qRyxPqDuCyJeGLU6OMJKqg7CEqs45btRqvDFNDI3Y","headerImage":"https:\/\/play-lh.googleusercontent.com\/BDH6GfNI27IxAjhfwuqo0Y17faVTfiBowi5sUKIwLFFA0W2CDNQ2px_Ial9DNklvLp8","screenshots":"['https:\/\/play-lh.googleusercontent.com\/dn4abxdmN7_6ONwNP6AgVa2IT5NYQ1sOxafhlg4UbhDjOQusQXte9CN_ais1NWL-f4Fv', 'https:\/\/play-lh.googleusercontent.com\/VVE0geMHujqJDLEUkOPlJrGuzYuSwu5OGTuDklVvRrmwkjOCO80jMn0ueRdzRFMIIQ', 'https:\/\/play-lh.googleusercontent.com\/cMEitM-wP6-j8n7jcYNuwtFdqWTsa-XeWp8B7N5_H_fH5HQR6n4Sbr974ASDhnmDBg', 'https:\/\/play-lh.googleusercontent.com\/v6Ek2W4Bw9VaxbuJURLA395UauLwzvbnAXuasQibcg2ngMDsCtw3HnoCyMsuwXAm7C4', 'https:\/\/play-lh.googleusercontent.com\/Iot1cHUdpwHPF1TH5UzVbLLFxyydYVJvvQXNlwfqzANFXjGIAQl7n3CGc3ZsNqMxD1Q', 'https:\/\/play-lh.googleusercontent.com\/Txol3YgM5DmzwITusXodPjB9hvAr3W8Y5cGrrDQP3u4_PhsebsJPs3iEH0RawTVagw', 'https:\/\/play-lh.googleusercontent.com\/aGbFe3SgDjfWxzipNGnVP8vBfXfm_5T_wNV3EsTmajy4d-rd0dGqQc9CP077yOPeTg', 'https:\/\/play-lh.googleusercontent.com\/XQ13vCqt_fS33pV7hOFovuQQVDwNZrEHD6hhTpZQCEpGtFmetq6Zclw3THTBjHrjnjU', 'https:\/\/play-lh.googleusercontent.com\/i_2hVjesVqbRn5rc19dOX7A126U1ODwkSN3ghwxlPtM4mMJIed-9N5YlYLWo85sNqQ', 'https:\/\/play-lh.googleusercontent.com\/RaN4h185nK00gxZKlukAZFm2LvMHnJanIrQOWXTrn9egRARv-Gg2UMAxLE7kfWeFzbA', 'https:\/\/play-lh.googleusercontent.com\/i44ilkcaiBAWXsRcpAJcwWx7Few4CPvJOqsaeTdXw_D7_egcMJS0lLOIisKxEbtG_v0']","contentRating":"Everyone","adSupported":true,"containsAds":true,"released":"Apr 26, 2010","lastUpdatedOn":"Apr 22, 2025","updated":1745327016,"comments":"[]","appId":"com.myfitnesspal.android","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.myfitnesspal.android&hl=en&gl=us"},{"title":"Strava: Run, Bike, Hike","descriptionHTML":"<b>Join over 125 million active people on Strava – the free app where building community meets fitness tracking.<\/b> <br><br>Whether you&#39;re a world-class athlete or just starting out, Strava has your back the entire journey. Here&#39;s how: <br><br><b>Track your growth<\/b> <br><br>• <b>Record It All:<\/b> Running, cycling, walking, hiking, yoga. You can record all those activities – plus over 40 other sport types. If it&#39;s not on Strava, it didn’t happen. <br>• <b>Connect Your Favorite Apps and Devices:<\/b> Sync with thousands of devices like Apple Watch, Garmin, Fitbit and Peloton – you name it. The Strava Wear OS app includes a tile and a complication you can use to quickly launch activities.<br> <br>• <b>Understand Your Progress:<\/b> Get data insights to see how you&#39;re improving over time. <br>• <b>Compete on Segments:<\/b> Show off your competitive streak. Race against others on segments to the top of the leaderboards and become the King or Queen of the Mountain. <br><br><b>Find and connect with your crew<\/b> <br><br>• <b>Build a Support Network:<\/b> Take the Strava community offline and meet in real life. Use the Clubs feature to join local groups or create your own. <br>• <b>Join and Create Challenges:<\/b> Participate in monthly challenges to chase new goals, collect digital badges and stay motivated while encouraging others. <br>• <b>Stay Connected:<\/b> Your Strava feed is filled with real efforts from real people. Follow friends or your favorite athletes and send kudos to celebrate every win (big and small). <br><br><b>Move with confidence<\/b> <br><br>• <b>Move Safer with Beacon:<\/b> Share your real-time location with loved ones for an extra layer of safety during your activities. <br>• <b>Control your privacy:<\/b> Adjust who can see your activities and personal data. <br>• <b>Edit Map Visibility:<\/b> Hide the beginning or end points of your activities. <br><br><b>Get even more with a Strava subscription<\/b><br>•  <b>Discover Routes Anywhere:<\/b> Get intelligent route recommendations with popular routes based on your preferences and location, or create your own bike routes and footpaths using our Routes tool. <br>• <b>Live Segments:<\/b> Receive real-time updates on your performance during popular segments. <br>• <b>Training Log &amp; Best Efforts:<\/b> Dive deeper into your data to understand your progress and set new personal records. <br>• <b>Group Challenges:<\/b> Create challenges with friends to stay motivated together. <br>• <b>Athlete Intelligence (AI):<\/b> Access AI-driven insights that makes your workout data easy to understand. No confusion. No guesswork. <br>• <b>Access Recover Athletics:<\/b> Prevent injury with custom exercises tailored to your activities.<br>•  <b>Goals:<\/b> Set custom goals for distance, time or segments, and stay motivated as you work towards them. <br>• <b>Deals:<\/b> Enjoy special offers and discounts from our partner brands.<br>• <b>Training Log:<\/b> Dive deeper into your data with detailed training logs and track your progress over time. <br><br>Whether you’re aiming for a personal best or just getting started, you belong here. Just record and go. <br><br>Strava includes both a free version and a subscription version with premium features. <br><br>Terms of Service: https:\/\/www.strava.com\/legal\/terms Privacy Policy: https:\/\/www.strava.com\/legal\/privacy NOTE ON GPS SUPPORT: Strava depends on GPS for recording activities. In some devices, the GPS does not work properly and Strava will not record effectively. If your Strava recordings show poor location estimation behavior, please try to update the operating system to the most recent version. There are some devices which have consistently poor performance with no known remedies. On these devices, we restrict installation of Strava, for example the Samsung Galaxy Ace 3 and the Galaxy Express 2. See our support site for more information: https:\/\/support.strava.com\/hc\/en-us\/articles\/216919047-Supported-Android-devices-and-Android-operating-systems","summary":"Track your active life in one place and share the journey with friends.","installs":50000000,"minInstalls":50000000,"realInstalls":89102800,"score":4.3840685,"ratings":937138,"reviews":32288,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$2.99 - $79.99 per item","developer":"Strava Inc.","developerEmail":"support@strava.zendesk.com","developerWebsite":"https:\/\/www.strava.com\/","privacyPolicy":"https:\/\/www.strava.com\/privacy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/j-ZV144PlVuTVsLuBzIKyEw9CbFnmWw9ku2NJ1ef0gZJh-iiIN1nrNPmAtvgAteyDqU","headerImage":"https:\/\/play-lh.googleusercontent.com\/z0gWi0qvk2lOvIwKZmE37Ei3A7nZinohGMictJY9ydHIluAJ49px0eI9ieNNZfyWPQ","screenshots":"['https:\/\/play-lh.googleusercontent.com\/ARuNrK5k9U80tOuFTw8hTGuSoELOUO_xrwcKwPoi22EjaTfcyjJssYue8Sq2hT2tPQ', 'https:\/\/play-lh.googleusercontent.com\/nRp98Zl71GW_zLL-wtmruKJcacw65EcOTaupOCEyOBjzhwUFoYM1ypXDQmEePDgNRQ', 'https:\/\/play-lh.googleusercontent.com\/8rs3ibSXPYYWV70fdXqcamZ017dYIvKADy-0yPACdBiTUYZh60zr2ZDSmO0iM17jEaQ', 'https:\/\/play-lh.googleusercontent.com\/VJT9cYF6de8EwWvupuoO0uRWKp-ifyyz31QmZNHOl1JagRtNgRmnfqNjqYthP2rtfOs', 'https:\/\/play-lh.googleusercontent.com\/7pYw7ddtKBE2v-4Wi85wbDkyNHrZFHYTfQvBf1BwxKK90qy8H6bq1iLCHbCbT7FSng', 'https:\/\/play-lh.googleusercontent.com\/wb-4QOfDxfn-JR9Qv38nkkJ8ieJJkgNdJT38bPNHDwvb8nLNNByVAB9zBc5uf06C4Lo', 'https:\/\/play-lh.googleusercontent.com\/nk37OR6m7Jd25dUUHXzhJu8P0OhYQlq3Vq4cYD1KDRKS9QglbbIV9BgPyRab6olE-A', 'https:\/\/play-lh.googleusercontent.com\/RlicXLprUbJpa8p7rB9XbmBwrSfG8trPq_Oc8mkOJHZMQzSIJTCn9KbdE0sHrkOhyw', 'https:\/\/play-lh.googleusercontent.com\/P2GV8G1EyOH5uIb12UzuZ7pWz4GIcfwoaVrTwA6GIodGdVXom6h3nJndZxieDHnYQr0', 'https:\/\/play-lh.googleusercontent.com\/6V5XLAfWECnSUqf3lXsFP75QL4fYCmzsars-ESkWGZws0dCDE_bzfsb253LF1gs1UzU', 'https:\/\/play-lh.googleusercontent.com\/0g9mqto277HW2rJ4oCjYwZhspA4HsAy4QxAdPHmaHWmGbDUsYBhvvP8BjGf8OgdBzsk']","contentRating":"Teen","adSupported":false,"containsAds":false,"released":"Jun 9, 2011","lastUpdatedOn":"Apr 28, 2025","updated":1745879517,"comments":"[]","appId":"com.strava","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.strava&hl=en&gl=us"},{"title":"Home Workout - No Equipment","descriptionHTML":"Home Workouts provides daily workout routines for all your main muscle groups. In just a few minutes a day, you can <b>build muscles and keep fitness at home<\/b> without having to go to the gym. <b>No equipment<\/b> or coach needed, all exercises can be performed with just your body weight.<br><br>The app has workouts for your <b>abs, chest, legs, arms<\/b> and <b>butt<\/b> as well as full body workouts. All the workouts are designed by experts. None of them need equipment, so there&#39;s no need to go to the gym. Even though it just takes <b>a few minutes a day<\/b>, it can effectively tone your muscles and help you get six pack abs at home.<br><br>The warm-up and stretching routines are designed to make sure you exercise in a scientific way. With <b>animations and video guidance<\/b> for each exercise, you can make sure you use the right form during each exercise. <br><br>Stick with our home workouts, and you will notice a change in your body in just a few short weeks. 💪 💪 💪<br><br>⭐ <b>Features<\/b> ⭐<br>√ Warm-up and stretching routines<br>√ Records training progress automatically <br>√ The chart tracks your weight trends <br>√ Customize your workout reminders <br>√ Detailed video and animation guides <br>√ Lose weight with a personal trainer <br>√ Share with your friends on social media <br><br>Bodybuilding App<br>Looking for a bodybuilding app? No satisfied bodybuilding app? Try our build muscle app! This build muscle app has effective muscle building workout, and all muscle building workout is designed by expert.<br><br>Strength Training App<br>It&#39;s not only just a build muscle app, but also a strength training app. If you are still looking for muscle building workout, muscle building apps or strength training app, this muscle building apps is the best one you can find among the muscle building apps.<br><br>Fat Burning Workouts &amp; HIIT Workouts<br>The best fat burning workouts &amp; hiit workouts for better body shape. Burn calories with fat burning workouts, and combine with hiit workouts to get the best results.<br><br>Home Workouts for Men<br>Want effective home workouts for men? We provide different home workouts for men to workout at home. The home workout for men is proven to help you get six pack abs in a short time. You&#39;ll find the home workout for men that most suitable for you. Try our home workout for men now!<br><br>Multiple Exercises<br>Push ups, squats, sit ups, plank, crunch, wall sit, jumping jacks, punch, triceps dips, lunges...<br><br>Fitness Coach<br>The best fitness apps and workout apps. All sport and gym workout in this workout apps and fitness apps are designed by professional fitness coach. Sport and gym workout guide through the exercise, gym workout and sport, just like having a personal fitness coach in your pocket!","summary":"Home workouts for fitness & fast bodybuilding at home - no equipment needed.","installs":100000000,"minInstalls":100000000,"realInstalls":260539959,"score":4.8767257,"ratings":3619853,"reviews":63111,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$2.99 - $69.99 per item","developer":"Leap Fitness Group","developerEmail":"support@leap.app","developerWebsite":"https:\/\/z.leap.app","privacyPolicy":"https:\/\/leap.app\/privacypolicy.html?pkg=homeworkout.homeworkouts.noequipment","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/yYnlRgvLIfMhAy_AoDKHpTPw7qxyMxmblNqbkeoRhj5D41g4dnujZSHkHslmNkbNQtA","headerImage":"https:\/\/play-lh.googleusercontent.com\/zjRzJcL7kOV3AY2CT-PHiV8eOjIp83jw13MH2hpI2f8BLzSh08-fAQlLOTgF74V2Djs","screenshots":"['https:\/\/play-lh.googleusercontent.com\/SJTUyaKbEanddw9OFBf4ws7p7OebLpNrMC_bsS4SMPcw5tCbFjUcj09vW-e9-GrZ9w', 'https:\/\/play-lh.googleusercontent.com\/SOMaz1sg4C5pna8KVZjcbRNzCIKfZZXBd7813uebvnZkwvmcV1G2HGhiQVOgEjGv6A', 'https:\/\/play-lh.googleusercontent.com\/XYcJVZ80qGwHEsH84pzq6u9Pu-b_DjlM61wvkJP5xT17SgVMLUjzZioZRkTs8RO_MG8', 'https:\/\/play-lh.googleusercontent.com\/GpTO9XHYn8uaHl3NZ53gOv8wfRaJ72sRcRkMl-f5X4eb_w-AAgRms3RROx7a9nElnGct', 'https:\/\/play-lh.googleusercontent.com\/lU5ORIfZkhEJ7erKHT-VaMEpseEAQkLHPUhUtgLE57ogWFPv7o-cyHpd3jljV7eAHzE', 'https:\/\/play-lh.googleusercontent.com\/PrDzSM0UNu2PoPRGH9SvN0PbTkPxw9AIi5dwTDh_kPmPdniNQUU1bUWiRNiCdrJasjE', 'https:\/\/play-lh.googleusercontent.com\/xlmCvSrn3L3vYfdH2LG_JbN5VNvDnwpP-Drb3jeIN7BD_fdU1bzhCdI3JK649IDvNZk', 'https:\/\/play-lh.googleusercontent.com\/RQtUYgWMAj1goSjDjo329zZ_w0o2bWyOIOmzN-DljYmV9uz6DOVlz406pxXTyobDPF_H']","contentRating":"Everyone","adSupported":true,"containsAds":true,"released":"Nov 8, 2017","lastUpdatedOn":"Apr 26, 2025","updated":1745735462,"comments":"[]","appId":"homeworkout.homeworkouts.noequipment","url":"https:\/\/play.google.com\/store\/apps\/details?id=homeworkout.homeworkouts.noequipment&hl=en&gl=us"},{"title":"Weight Loss Walking: WalkFit","descriptionHTML":"A walking app for weight loss, WalkFit, is a simple step counter, pedometer, and personal walk fitness app.<br><br>Try daily walking plans or indoor walking workouts to burn calories and achieve weight loss! Build a new walking habit and get fit with the walking app WalkFit.<br><br>WalkFit is your go-to for walking for weight loss. Daily walking programs are designed to help you achieve the desired weight and improve your health. Walking for weight loss is easy!<br><br>Get your personal walking plan calculated based on your BMI and activity level. Enjoy your daily walks and lose weight effortlessly!<br><br>Walking Tracker: keep track of your walking progress with a user-friendly walk tracker. Monitor your steps, calories burned, and distance traveled to stay motivated on your weight loss journey with a walking tracker.<br><br>Walking App for Weight Loss: use our walking tracker as a weight loss walking app to set and achieve your weight goals. Monitor your walking progress and see how it contributes to your weight loss progress.<br><br>Step Counter &amp; Step Tracker: count your steps, walking distance, and burned calories with a pedometer easily. The step counter &amp; pedometer serve as a constant reminder to keep moving and motivate you to reach step goals.<br><br>Walking Challenges: challenge yourself and get more weight loss motivation with a walking challenge app. Get achievements by completing daily and weekly step goals! Conquer new step milestones with a step counter and walk to lose weight with Walkfit!<br><br>Indoor Walking Workouts: get a personal workout plan, follow video guides, and lose weight at home. Try various indoor walking workouts and choose your favorite! Dare to take on the &quot;28 day indoor walking challenge&quot; to burn fat and lose weight in a short time by combining exercises with walking.<br><br>Treadmill Workout App: just switch to treadmill mode and follow the walking app recommendations. Alter walking at an easy, steady pace with intense bursts of walking and a fast pace for weight loss. The step tracker feature will count your steps while you&#39;re using the treadmill. This makes treadmill workouts a great option if you prefer to walk at home and still aim to lose weight.<br><br>Sync with Fitbit, Google Fit, and Wear OS devices <br><br>WalkFit is compatible with Wear OS watches, which allows the tracking of activity data in passive and active modes. In a passive mode, the watch’s sensors are utilized to track your overall activity throughout the day. During active modes, such as workouts or free walks, your activity can be monitored in real-time in a walking app.<br><br>By syncing both devices, you can track progress toward your walking goals and monitor key metrics like step count, calorie burn, and walk distance. That&#39;s why it&#39;s so easy to use WalkFit as a pedometer and weight loss app!<br><br>SUBSCRIPTION INFO:<br>You can download the walking app for free. Further use requires a subscription. At our discretion, we may decide to offer you a free trial per the terms displayed in the app.<br><br>In addition to the purchased subscription, we may offer you add-on items (e.g. fitness guides, VIP customer support service) for an additional fee, either one-off or recurrent. This purchase is optional: your subscription is not conditional on such a purchase. All such offers will be displayed in the app.<br><br>Don&#39;t hesitate to send your feedback or suggestions to https:\/\/contact-us.welltech.com\/walkfit.html<br>Privacy Policy: https:\/\/legal.walkfit.pro\/page\/privacy-policy<br>Terms of Use: https:\/\/legal.walkfit.pro\/page\/terms-of-use<br><br>WalkFit is a step counter, pedometer &amp; walking app for weight loss. Get a walking plan adapted to your needs and personalize your daily goals for steps and distance!","summary":"Walking app for weight loss: walk & step counter, pedometer, indoor walking app","installs":10000000,"minInstalls":10000000,"realInstalls":13408635,"score":4.64947,"ratings":76346,"reviews":5303,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$1.99 - $129.99 per item","developer":"WELLTECH APPS LIMITED","developerEmail":"kate.support@walk-fit.io","developerWebsite":"https:\/\/walkfit.welltech.com\/","privacyPolicy":"http:\/\/walkfit.pro\/android\/privacy-policy-app.html","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/p1YUQpzmUYfg3UyxBJNniPcrjeK9TLxtO016qnQR92vG3PK1IHrwQ738n04M-jNC1g","headerImage":"https:\/\/play-lh.googleusercontent.com\/ibYJh-bnNm9gT3Gxz6hcmcLE3iZ9IjJthkDk1cK2_UN40B_AHwsK4Lb9fOuX0KJV_MM","screenshots":"['https:\/\/play-lh.googleusercontent.com\/Zd_ULh9mUqEMlUNPz9FVXxuzo1sNPURQ_IgCR744iqud4iiEDFr4UADGwb4D98f_rA', 'https:\/\/play-lh.googleusercontent.com\/cVHewOWYG8ZLNZGxVJfKaO5k6A1xg-9zArQXq3RlNVGmJve3MS6lNXxQ7AY1IRTGXvY', 'https:\/\/play-lh.googleusercontent.com\/Dp2NtZxTkx1FJ5kmJbAFH8I29qSYT6QbBN20UvXvUeDfRX4WhTISTs_7tFbMJ7pwoQw', 'https:\/\/play-lh.googleusercontent.com\/sycgw7XPDaQLVQ5LKXZR1R_gBHFAyVHgaiJESCj7d5KuU-RJQXWZW8ym0HCj4Y61v0Vs', 'https:\/\/play-lh.googleusercontent.com\/6kmH8IU2JeWQERP2JsIE-qVdn6o_yMtsqsVWcZ1SbkPwVAz0CaxShA_AZZInR_mqD7g', 'https:\/\/play-lh.googleusercontent.com\/S9Aj9v0S0ppxlLRYEzRvQWxnE4IwxU3Ue2gojncAg-6cPHdDuBagvRXrUqHG23O1lBg', 'https:\/\/play-lh.googleusercontent.com\/sCaPJ13D08XiNHiTxJ10XNdCngiqjsSyLbaOHPfrOBRjndzK4j3cgkL1nBMGio3Jv7c', 'https:\/\/play-lh.googleusercontent.com\/n-ccp8wCYwuedr8Z-1ghm-RdC4TW9WjWJZTsDqlTXsxUzugbazkaSfGmCoG8ywCuvCU', 'https:\/\/play-lh.googleusercontent.com\/0UuRGL9OXiF0aNBT30Fiumj4i6XmmdcM9FoipOXEtK2LVcdpx5L5Tz6Nl-qC1sC-d0U', 'https:\/\/play-lh.googleusercontent.com\/JplhObTYX49jugMP3TNRrK1m_1BCOjMgtHMVyTDhBIxTdkbOPZS1cxzcY2f_PZQgZig', 'https:\/\/play-lh.googleusercontent.com\/Wzg-88giYKU71N1P0AjCvCGF_BuviTWAYg0ngxXtjwAkmVs8ayDicLTuEeogbM0GCxs', 'https:\/\/play-lh.googleusercontent.com\/q9sFoZcCJkrc6z5nTAngwKN36-I90z5pOFTeFn2_aVxwQhNmbtLdsGzXEaxxQuNbs_8']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"Mar 2, 2020","lastUpdatedOn":"Apr 25, 2025","updated":1745591322,"comments":"[]","appId":"com.walkfit.weightloss.steptracker.pedometer","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.walkfit.weightloss.steptracker.pedometer&hl=en&gl=us"},{"title":"FitOn Workouts & Fitness Plans","descriptionHTML":"Lose weight, sweat, and get fit anytime, anywhere with free home exercise workout videos, personalized fitness plans and guided meditations. Get fit with workouts you can do at home, outside, or in the gym.<br><br>Reduce stress with a calming yoga practice, increase your fitness with a fun cardio workout, and feel good with hundreds of other free fitness videos. <br><br>Find fitness plans and home workouts that you can also enjoy outside or even in the gym. Get your sweat on with celebrity trainers like Jeanette Jenkins or Cassey Ho (of Blogilates) and read advice articles on how to take care of yourself both mentally and physically.<br><br>Achieve personalized health and fitness goals with unlimited access to the best home workouts and exercise videos. From cardio to strength training to HIIT, yoga, Pilates, Barre, and much more - you’re guaranteed to get your sweat on and find a class you love. Plus, you’ll get to work out with top celebrity trainers like Cassey Ho (of Blogilates), Jeanette Jenkins, Katie Dunlop, Christine Bullock, Kenta Seki, Danielle Pascente, and many more.<br><br>Plus, access EXCLUSIVE workout videos led by Gabrielle Union, Julianne Hough, and Jonathan Van Ness.<br><br>Also, reduce stress, get better sleep, improve breathing, relax your body and rejuvenate your mind with short and effective meditations.<br><br>CARDIO HIIT, YOGA, PILATES, BARRE &amp; MORE! HOME WORKOUTS JUST FOR YOU<br>• Quick &amp; effective fitness videos from celebrity trainers like Jeanette Jenkins, Cassey Ho (of Blogilates), and many more! <br>• Exclusive workouts with Gabrielle Union, Julianne Hough, &amp; JVN<br>• No gym? No problem. Turn your home into a fitness studio with your phone, laptop or TV<br><br>PERSONALIZED FITNESS PLANS &amp; EXERCISE VIDEOS <br>• Reach your goals with personalized workout plans<br>• Lose weight, build muscle, increase your cardio endurance, get fit or reduce stress with plans that work for you<br><br>FITNESS VIDEOS FOR EVERYONE<br>• Enjoy cardio, HIIT, yoga, Pilates, Barre, strength, dance, and more<br>• Browse by workout category, body part, length and intensity<br>• Short on time? We’ve got quick HIIT 10-minute workouts so you can get your workout in fast! <br>• Workout anytime on-demand, join a live class, and get ready to sweat! <br><br>GUIDED MEDITATIONS<br>• Calming meditations to help reduce stress and anxiety<br>• Guidance toward improved breathing<br>• Increased relaxation for better sleep<br><br>STAY MOTIVATED &amp; STAY FIT WITH EXERCISE VIDEOS<br>• Join the live leaderboard for friendly competition<br>• Track your progress and share with friends<br>• Real-time text messaging with friends or workout partners<br><br>FitOn is compatible with WearOS<br>• Monitor real-time heart rate on Wear OS devices<br><br>Plus, you can access workouts online from your TV or computer: https:\/\/app.fitonapp.com<br><br>Find fitness plans that work for you. Short, fun and effective, the best workouts, from the best personal trainers. Always on.<br><br>Barre, pilates, and so many more exciting fitness videos, plus guided meditations! Download FitOn and start your new fitness routine today!","summary":"Sweat and get fit with HIIT, barre, cardio, yoga & more","installs":5000000,"minInstalls":5000000,"realInstalls":8938226,"score":4.4909654,"ratings":96278,"reviews":10713,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$14.99 - $119.99 per item","developer":"FitOn","developerEmail":"android-support@fitonapp.com","developerWebsite":"https:\/\/fitonapp.com\/?ref=google-play","privacyPolicy":"https:\/\/fitonapp.com\/privacy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/3F1LsBjZ2p-UjP2hwJa--jk_5gzHHezaQ8n381RI4u11DSb647zt07UVUNO4ZHVtdQ","headerImage":"https:\/\/play-lh.googleusercontent.com\/9toHgd6nwWHcXAKT3JZkYww1NyxMJM3s6eRvgar4eqT1qcDf6vgW3wIX_B8U_8oVWCY","screenshots":"['https:\/\/play-lh.googleusercontent.com\/9EjWNeXioPrpPZ2IAB-kB7XsdQRHf6rI72rQkNV0TrepBxkpN1UyoO748rcQvP2vbLY', 'https:\/\/play-lh.googleusercontent.com\/D_iXf8ObrS-Q8PYExz63ihYVHFlp9YJ_1mfyM8D82Ug0jWn8cQ1_D4o9IX5Q-WZVsU0', 'https:\/\/play-lh.googleusercontent.com\/ogE_djq7rr9tM9uYBny4FhKX06NHWckG4Wlv2SukMo0KA3joIk9JK9g31juYz2TChdE', 'https:\/\/play-lh.googleusercontent.com\/8ig5C2GHSIR0wvIeIQsZSOKRZpOHP46i3ppHEA8iypFlfZ-_f6GUNqrRwbVT6I4eTrY', 'https:\/\/play-lh.googleusercontent.com\/EtfpIUUOLIoc9ihJMC8XdR8SPr2vzIwGrS1IypiBE1TIZKRzm6zaFEyhB2JWdpjh9dM', 'https:\/\/play-lh.googleusercontent.com\/L-CREZUTPPVz2GtHqqznXwMFGL27kb9Kcya0Ip6S1t7AsZT2QX-M0UE_jTR_Pm84IMVW', 'https:\/\/play-lh.googleusercontent.com\/hfyZ2jeJdoMM9wNlwnnbSWGjmJWCgQiJuvjcWd0y2fnJ7NRttBvsYz_515cL9RIqjUk', 'https:\/\/play-lh.googleusercontent.com\/OabNVYRcXnil6YgqTR_SrZ8z9XaJy7X9V6eLjhV_qKojmghmcsnKI5qP_sfIaV25nSw', 'https:\/\/play-lh.googleusercontent.com\/B9oU-iF-2qFDZ6L-vbvrtPQuJRCMzOxctWezBqt1puv-_sYeogntFTGGUgs4MGfYqRA', 'https:\/\/play-lh.googleusercontent.com\/ehas_lRWNFSWYeLxJIeOW5zpQlERdPCq8QCBxT0nPnDgOzSm0u_yOTQUwrruEiiFCCs', 'https:\/\/play-lh.googleusercontent.com\/WMtRn_QStFq2VWq9O5Yy2oMCjMRgAbgYoxFMjF20RL9fqcFhQ5mG6McQ9y1us_r-tvE', 'https:\/\/play-lh.googleusercontent.com\/2et2myRhmelKS5XR50L5j9D2ceNFqBZKBax1N6cQtFaMCfwVHsadhw7-c0WcegAPrX4', 'https:\/\/play-lh.googleusercontent.com\/CddYSedndIKdEMLGGpAma4txNgdtvIVk_lbmewhxEXRCm4dG45ukou4SaJyX0-B2cbc', 'https:\/\/play-lh.googleusercontent.com\/A9yEbvq6jcnRjlfDyTB61iWxUFcjvq4G1vRULqP71So-Kc1KMWpo81DXcvw7HSVbmQ', 'https:\/\/play-lh.googleusercontent.com\/yLV5VQAK7-4ooIqcSMmUOyPyNcouThtpOYh2TTBnxHMlhvCw9C8WM5eXXGKT78brzA']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"Dec 17, 2018","lastUpdatedOn":"Apr 2, 2025","updated":1743640643,"comments":"[]","appId":"com.fiton.android","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.fiton.android&hl=en&gl=us"},{"title":"Fitbod: Workout & Gym Planner","descriptionHTML":"Build muscle, gain strength and lose weight with optimized weight lifting routines. You won’t just get stronger—you’ll do it on your terms, with a little help from AI. Fitbod is a personalized workout planner that uses AI to help you make progress. Each training session is custom-built for your fitness level, goals and home or gym workout equipment. Make lasting progress with your own AI trainer guiding you to be stronger and healthier<br><br>Whether you&#39;re focused on a gym workout or prefer the convenience of a home workout, Fitbod’s AI adapts to your fitness journey. The app learns from your preferences and past performance to build personalized workout plans. Plus, the built-in fitness and health tracker monitors your progress, making sure you hit your goals with the right exercises for your body. You can tailor each workout to match your available equipment and even adjust routines to target specific muscle groups, ensuring you always stay on track.<br><br>Fitness Planning, Just for You - A Personalized Workout Plan Designed to Push Your Limits<br><br>◆ Gym and home workout planner, all with the help of AI<br>◆ Optimized resistance training and workouts<br>◆ Ability to select available gym workout equipment<br>◆ Fitness tracker for all your workouts and routines<br>◆ Health tracker to help you track recovery, weight loss and more<br>◆ Automatic strength training and workout optimization<br>◆ Workout recommendations powered by machine learning<br>◆ Personalized workouts, based on training style<br><br>AI-Generated Workouts<br><br>◆ Effective gym and home workouts, customized to your fitness goals<br>◆ Maximizes fitness tracker data by varying and balancing exercises with AI<br>◆ Adaptive AI learns from your edits to its workout recommendations<br>◆ Non-linear periodization to optimize your workouts for sustained progress<br>◆ Advanced, intermediate, and beginner fitness levels<br>◆ Variety of workout modifiers for each session<br>◆ Save, build or use your favorite strength training workouts<br>◆ Pro fitness trainers available via email for all strength training questions<br><br>Workout at the Gym or at Home - Over 1000+ Exercises<br><br>◆ Hi-res, multi-angle videos of each fitness exercise<br>◆ Easy-to-understand, detailed exercise instructions<br>◆ Search exercises by muscle group, equipment type or keyword<br>◆ Cardio, mobility, pregnancy-safe exercises and more<br>◆ Consistent updates made to optimize the exercise library<br><br>Integrations<br><br>◆ Integrated with Wear OS, with quick access to your workout with the Tile<br><br>Privacy Policy: https:\/\/www.fitbod.me\/privacy-policy<br>Terms of Use: https:\/\/www.fitbod.me\/terms-conditions<br>California Privacy Rights: https:\/\/www.fitbod.me\/ccpa-privacy-policy<br>Support: http:\/\/fitbod.me\/support<br><br>Join the Fitbod Community:<br>Instagram: instagram.com\/fitbodapp\/<br>Twitter: twitter.com\/fitbodApp<br>Facebook: facebook.com\/fitbodapp","summary":"Gym & home workout plans with strength training, exercise tracking, HIIT & more.","installs":1000000,"minInstalls":1000000,"realInstalls":3271752,"score":4.6519823,"ratings":22960,"reviews":3230,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$9.99 - $129.99 per item","developer":"Fitbod","developerEmail":"android-beta@fitbod.me","developerWebsite":"http:\/\/www.fitbod.me","privacyPolicy":"https:\/\/www.fitbod.me\/privacy-policy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/guPBWiFOsOm7jUUMKrErSvZuSTNqo3hOgLom_FEQoprZmdpPrFa1I0S5v1IReOP3gQ","headerImage":"https:\/\/play-lh.googleusercontent.com\/dY87Kqc9WYZcndfxzQxqkd_hYJwnK_x1s1Gj87xjyFecrYsQOH3VrIn7FxrS-QeVazs","screenshots":"['https:\/\/play-lh.googleusercontent.com\/JQiwY1_x7wH2SHfBys_r4Cl3a55mDK8aHhcxj2CcCZn6knI6IIp9aLbxfQBSTDL9HBo', 'https:\/\/play-lh.googleusercontent.com\/bCJnwc-2HqPZepFQXC6aoT_8Dc_qfD8NdJNsQ6Vhj7nTLcpV31jb2zc8_JjxsEK6mA', 'https:\/\/play-lh.googleusercontent.com\/JI9OhsbaigKjXGyIP2lLge_9R0qMuCSENjNt5v8y1bB4rhBJtDlqqq9OyRjVlvltyg', 'https:\/\/play-lh.googleusercontent.com\/gTLmIVw9lWDR2GzUe_gohMYG2XKFLyJ2K8kvo8wD-3aospSu07tjJeJ9iNo4FJMYr5g', 'https:\/\/play-lh.googleusercontent.com\/u54DwbE26iV9GIwmLi4XFlW6I-ndKO_nd0icMk_Pzjg1HiviV5HIcfEYbLqamy_5j4M', 'https:\/\/play-lh.googleusercontent.com\/ovbOkVTxDkfWbeGUZIpHn-Cd0cwxwaQAXGYndYPST_5_fqsWymT7tyq9RXbhMKU82_M', 'https:\/\/play-lh.googleusercontent.com\/BbwG4A5Rx7lXqufrQDGW1UVzW4eqYx0NI4tQO3sj3N8bCTtjXkPjawpb8kUWJVK2sY4', 'https:\/\/play-lh.googleusercontent.com\/gYt4_lskxPy_BiOhGB9vkVwOgfZZhQ87nvRDF-3NIFplKDqRB3t-I1k6c7Kh9e34xSk', 'https:\/\/play-lh.googleusercontent.com\/Ql4Ey3jBl-ADzvW5LQhUgrVEUxr8sj2JkFrUP0oaKK1hRBoJA7Wro9B4HAuEDggLk2s', 'https:\/\/play-lh.googleusercontent.com\/lLTxDS8GHV6nvD2Rkd4U_FfprUL6y2QlJf_zKsSKB8UozpXwdEykD-XiFtlx-5Tfoww', 'https:\/\/play-lh.googleusercontent.com\/bfNbbGlaeHkvddEn_7kYbFZTlaQds0WB2VWxLG2aTRgzI7dYhaAnNuGQg18TZuuPsibk', 'https:\/\/play-lh.googleusercontent.com\/ABP9x0YbMXsnVz-ZWtSyDUHIweqTN4a5Mx6tfnWlyuJHgXDqOdzPGGWDWfu7YXxWa-8', 'https:\/\/play-lh.googleusercontent.com\/KfFqZzOdwh_Pzob1VS7sdO9jLAC1Q2AW3uQ7KfvLQnBsNa_5F-KPf5MDXnIFek8AJEg', 'https:\/\/play-lh.googleusercontent.com\/KPMo5RAG65VxARgUvI4O_3bEimjDAFI9uB9DycjoU3bAhujytBAeqXTLUjl45MXnKm4']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"May 22, 2020","lastUpdatedOn":"Apr 18, 2025","updated":1745042801,"comments":"[]","appId":"com.fitbod.fitbod","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.fitbod.fitbod&hl=en&gl=us"},{"title":"Hevy - Gym Log Workout Tracker","descriptionHTML":"<b>Get strong by logging your workouts and tracking your progress with Hevy - for free!<\/b><br><br>Hevy has been designed to be the simplest, most intuitive workout tracker in the world. No ads and free. Log your gym workout, get extensive statistics to track your progress over time, and join a growing community of athletes. <br>Hevy is the perfect weightlifting tracker and planner that will allow you to reach your fitness goals.<br><br><h1><b>Workout Log &amp; Gym Tracker Planner App<\/b><\/h1><br>•  Track your lifts with an intuitive, simple to use interface.<br>•  Plan and log your routines with the advanced routine planner<br>•  Use the calendar to stay on top of your training schedule<br>•  Hundreds of exercises with free high-quality videos for you to focus on your form<br>•  Follow your friend&#39;s progress by following their lifts and copying their routines<br>•  Create your own custom exercises for your workouts<br>•  Mark sets as Warmup, Normal, Drop sets, Failure and Supersets<br>•  Customize automatic rest timers<br>•  Analyze your gym sessions in detail with muscle group graphs <br>•  Calculation of One Rep Max<br>•  Create an unlimited amount of routines<br>•  Analyze the progression of your lifts with beautiful full-screen graphs of volume, best weight &amp; total reps<br>•  Copy your friends&#39; workouts<br><br><h1><b>Wear OS Watch<\/b><\/h1><br>• Easily track your workouts on your Wear OS Watch<br>• Use your Hevy routines on your Wear OS Watch<br>• Live sync your Wear OS Watch workout with your phone<br>• Use Hevy Wear OS Tile to easily access Hevy<br>• Keep track of your heart rate during your workout<br>• Helpful timers for duration exercises<br>• Mark sets as Warmup, Normal, Drop sets, or Failure<br>• Watch workouts automatically save when reconnecting to your phone<br><br><h1><b>What Users Are Saying<\/b><\/h1><br>•  &quot;Seriously the best gym fitness tracker I&#39;ve ever used. Simple. Free. Tons of graphs. Amazing quality videos&quot; - Sam Ilelaboye<br>•  &quot;Seeing what my friends and other athletes are working out at the gym has totally changed my experience. Now I can log my friend&#39;s workouts and compare myself. It&#39;s super motivating&quot; - James<br>•  &quot;Tracking my workouts with Hevy has taken my fitness to the next level, I&#39;m getting stronger every week. Being able to use the workout planner really helps me being efficient at the gym.&quot; - Carlos D.<br><br><h1><b>Using a Tracker for Training<\/b><\/h1><br>•  The gym log can be used for a variety of different training types such as heavy  weight lifting, powerlifting, olympic exercises, 5x5, strength training, stronglifts, crossfit, and bodybuilding.<br>•  Track your routines like 3 day workout split, full body split, bodybuilding routines, 5x5, upper lower, and push pull legs.<br>•  Also perfect for bodyweight workouts such as calisthenics, cardio tracking and HIIT. <br>•  Use it as a gym tracker &amp; workout journal planner to keep track of your gym sessions over time.<br>•  Create gym routines or home workouts and use the routine planner to prepare your sessions ahead of time<br>•  Whether your goal is to increase your strength in weightlifting exercises, lose weight, or improve your level of fitness, Hevy helps you to stay on track with a gym planner.<br>•  Easily see your previous lift values, this helps you with progressive overload training.<br>•  Carefully follow proper form with +200 exercise videos such as Bench Press, Squat and Deadlift<br>•  Filter exercises by muscle groups and equipment type<br><br>Whether you’re doing strength training at the gym or home workouts, trying to improve your fitness or to get strong, join Hevy workout log and be a part of the community!<br><br>CONTACT US<br>•  https:\/\/www.hevyapp.com<br>•  https:\/\/www.instagram.com\/hevyapp<br>•  https:\/\/www.facebook.com\/hevyapp<br>•  https:\/\/www.twitter.com\/hevyapp<br>•  hello@hevyapp.com<br><br><b>Download Hevy and take your training to the next level!<\/b><br><br>Disclaimer: The Hevy app is not affiliated with any other workout tracker, workout planner, gym log or fitness apps like; Strong, Jefit, 5x5, Fitbud, my fitness pal, Fitbit, or Heavyset.","summary":"Gym Log & Workout Tracker | Fitness Journal, Training & Weight Lifting Planner","installs":1000000,"minInstalls":1000000,"realInstalls":4043461,"score":4.8781233,"ratings":121924,"reviews":4065,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$2.99 - $74.99 per item","developer":"Hevy Gym Workout Tracker","developerEmail":"hello@hevyapp.com","developerWebsite":"https:\/\/www.hevyapp.com","privacyPolicy":"https:\/\/www.iubenda.com\/privacy-policy\/75379905","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/Px0PmhX4WsQxBgR8Zgc59fkeyWErHTgjMPh5JvdGIt2mFWX1EGcqtHjXZKHoQxeT8A","headerImage":"https:\/\/play-lh.googleusercontent.com\/i3j4wWw8K76fwOF7v7JTU4vyvMn5QM9S3ilurP_unZb1M2DTppIdhEl9E7Aj-VCd2w","screenshots":"['https:\/\/play-lh.googleusercontent.com\/dnXSpGrG4rXIJmepkSSj_1eHg9wozQfIokE-xjZYd7i0NKWlV5HP9m0qqy4d0eZb1MM', 'https:\/\/play-lh.googleusercontent.com\/FIsjxzVwmBg6vssBv1Foje4P2QC4mYUBpfvWzdiDrXvmvjVDeqR8wAr_qi9aw9RFcKA', 'https:\/\/play-lh.googleusercontent.com\/pkvj7OWfqp8W0JJgE8zUNV-Q5XrHB-IX75z1gnoXQnVzOb5qUsmUy0YlyRk71u9nIw', 'https:\/\/play-lh.googleusercontent.com\/3tb3ePZpUAO53YCa5a0XR_6yfV6RL3Y6ZQUQ_weO6DhiTAKdnSsxWQSItyC9sAWP-A', 'https:\/\/play-lh.googleusercontent.com\/lO0AuWs5MUa0T-dIYI7qoxGDQI0bBDLL5jw8ig0ayfNxhR90ixHFo6AfqWIHIDVV-XzR', 'https:\/\/play-lh.googleusercontent.com\/gC9Nu6_GTa58CrjcCU_zSGWo0mJcTpJPH1HD8Sj6r6Wbm4ajPmo_0IIbODkHV3Nr4WE', 'https:\/\/play-lh.googleusercontent.com\/uQLddCYWhmFee6LUdGuQ5TROOphx3b0hsUwnsjkkaS7phCiL4BPlYbjkn8eE1veRdOs', 'https:\/\/play-lh.googleusercontent.com\/HCbd69ywhtHxGOl4K8SWN-kORIH9A7S7Zngvw1K_bucCtroTZn0gJfJHZ_12SrP0nL8', 'https:\/\/play-lh.googleusercontent.com\/R7uw4m77wHU5xAmgoRR0nvLvSp2l-raqcWbmW9y_Ib4h6uF9i8lj7LksKaCOuuvLlMs', 'https:\/\/play-lh.googleusercontent.com\/QaOnC9DoOdqerk6ZnUKwcslCGWtB4TRHULixd4mXJSN8oZTwfm2yChPnhYnQn9yB_xo', 'https:\/\/play-lh.googleusercontent.com\/zywdQ3-AzvwTUcel3kv4IrMg514eKmP7S85NoIHdp40HjUledH8pLp7rfACY65b-Wfk', 'https:\/\/play-lh.googleusercontent.com\/H-mL_7Jjh0qSVxqEY71wj2E4hJC22cNJJJz6qoCJ0ufR_5r0vB8MpcyduKh-mNesecQ', 'https:\/\/play-lh.googleusercontent.com\/MWgVwKV6j9-uihqou9GLFt165g7yBn1swmk-Ttgt9K1m7H-E4llnOOXa6WJMTHEPC9_O', 'https:\/\/play-lh.googleusercontent.com\/19YGBTNYhf_UA7pqFjMAH8BkuxkO_O3fAmeJwDHrgNCgMZSqO0dDrtCSJXxukXwWlO9P']","contentRating":"Teen","adSupported":false,"containsAds":false,"released":"Jun 29, 2019","lastUpdatedOn":"Apr 22, 2025","updated":1745324483,"comments":"[]","appId":"com.hevy","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.hevy&hl=en&gl=us"},{"title":"Fittr Health & Fitness Coach","descriptionHTML":"Your weight is a combination of Fat, Water, Muscles, Bones, Minerals etc. You don’t want to lose weight, you just want to lose fat:)<br><br>With over 300,000+ success stories and over 5 million community members globally, Fittr is one of the most trusted, science driven fitness platform in the world. We believe in educating and empowering our clients so they can take care of their own health. <br><br>Here’s what you get when you download the app: <br><br>—&gt; Community that answers all your queries and keeps you motivated <br><br>—&gt; 600+ certified coaches and experts for personalised fitness and nutrition plans, online personal training, injury rehab, post pregnancy fat loss, diabetes management, kids training<br><br>—&gt; Free tools like Calorie counter, Step tracker, workout tracker, water reminder, meal reminder, BMR calculator, TDEE calculator, Body fat calculator and many more <br><br>—&gt; Free e-book that will help you understand the basics of living a healthy life with core concepts explained in laymen language<br><br>—&gt; Nutrition database of 1.1 million food items<br><br>—&gt; 500+ free exercise videos including Yoga, HIIT, stretching, Mobility, warm-up and weight training<br><br>—&gt; 7000+ free healthy recipes with cooking instructions and macronutrient details <br><br>—&gt; Fitcoins for completing challenges which can be redeemed to purchase goodies <br><br>—&gt; Transformation challenges with annual prize money of over 1 Crore INR\/50k USD","summary":"Health & Fitness coaching. Science backed sustainable Nutrition & Training plans","installs":1000000,"minInstalls":1000000,"realInstalls":3192780,"score":4.39,"ratings":20593,"reviews":243,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$0.99 - $59.99 per item","developer":"FITTR - Fitness & Personal Training","developerEmail":"support@fittr.com","developerWebsite":"https:\/\/www.fittr.com","privacyPolicy":"https:\/\/www.fittr.com\/privacy-policy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/d0anYIanMGoeNCJNHC2idGGeskwRRIckwSmhcky93DMSfPgFwgIZgcNkcySGXGTcsn0","headerImage":"https:\/\/play-lh.googleusercontent.com\/zP9884HJteJaOBqr_J-5kPMqDBZZw_a76pyKn1xeChEy7-Rq4bISGCgQUc99KrlJOdI","screenshots":"['https:\/\/play-lh.googleusercontent.com\/D8Zi4_qDK5I1MXO_CwaP2b_ixZ06l-k9foWVD-kiWlKVUm_U6a_scMDpaSPx1mHkP-c', 'https:\/\/play-lh.googleusercontent.com\/8jkLkhifHqMtpoJ4yWJ5ejflwKx_jpX4OQi0F9-IW4vFstqrXAgOdsNLLsP3sXUE_w', 'https:\/\/play-lh.googleusercontent.com\/VYmtZcb4gWNMQzwmOpm62CLB9v300o35XL3FcIvkJxjfXvMn138-YcF4Rb3Bm9poctcw', 'https:\/\/play-lh.googleusercontent.com\/U1TrXx6ST8h5qCaMZDBncF2UdhKpAviDgdBzuFi6u_jF3oo-m_Genww59kutg6RQRg', 'https:\/\/play-lh.googleusercontent.com\/QrB8PwVgJBgPohjYsE0OltlsUKbi0ZiDLYWdFbPaai18fNgAdHWHfGsFjCrb4sCrJSM', 'https:\/\/play-lh.googleusercontent.com\/yYaJsczYulh0OgJ2nYn9_H-vT8zcOqzuvIiPonCHmxsmwaPvl60vEDpaQW2f1GenoQ', 'https:\/\/play-lh.googleusercontent.com\/R-GhOooeEmMFEq28I02Tyq5_0mA2R-emcdH7nEQampclCFlZshzrocyeeZmudjWhHla_', 'https:\/\/play-lh.googleusercontent.com\/5pwKPERhNxhWoIuNOUcmNQ_KzOhGDoyCoSNzj1FH8R5vDLe1KAS8MxVVpMpfJnFWLg']","contentRating":"Teen","adSupported":false,"containsAds":false,"released":"Sep 15, 2018","lastUpdatedOn":"Apr 18, 2025","updated":1744960989,"comments":"[]","appId":"com.squats.fittr","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.squats.fittr&hl=en&gl=us"},{"title":"Health Connect","descriptionHTML":"Health Connect by Android gives you a simple way to share data between your health, fitness, and wellbeing apps without compromising on privacy.<br><br>Once you&#39;ve downloaded Health Connect, you can access it through your settings by going to Settings &gt; Apps &gt; Health Connect, or from your Quick Settings menu.<br><br><b>Get more from your favorite apps.<\/b> Whether you&#39;re focused on activity or sleep, nutrition or vitals, sharing data between your apps can help you better understand your health. Health Connect gives you simple controls, so you only share the data you want to.<br><br><b>Keep your health and fitness data in one place.<\/b> Health Connect stores the health and fitness data from your apps in one place, offline and on your device, so you can easily manage the data from your different apps.<br><br><b>Update privacy settings in a few taps.<\/b> Before a new app can access your data, you can review and choose what you want to share. If you change your mind, or want to see which apps recently accessed your data, find it all in Health Connect.","summary":"A simple way to share data between health, fitness, and wellbeing apps","installs":500000000,"minInstalls":500000000,"realInstalls":594532238,"score":2.923256,"ratings":50278,"reviews":1997,"price":0,"free":true,"currency":"USD","offersIAP":false,"inAppProductPrice":null,"developer":"Google LLC","developerEmail":"health-connect-support@google.com","developerWebsite":"http:\/\/www.android.com\/","privacyPolicy":"https:\/\/policies.google.com\/privacy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/EbzDx68RZddtIMvs8H8MLcO-KOiBqEYJbi_kRjEdXved0p3KXr0nwUnLUgitZ5kQVWVZ","headerImage":"https:\/\/play-lh.googleusercontent.com\/h_okM6tahrGGnLB9vYUStzVRf_ExD2YRMzGoB6ODpmpT6KkYt4d_88sUYx8wrezt5if5","screenshots":"['https:\/\/play-lh.googleusercontent.com\/xAINeygp0NHm3O9Mu9Qu5HqB42TeISpZn-RA21tovevbSbMeaXsN6YtLpn5TIDbYaqk', 'https:\/\/play-lh.googleusercontent.com\/Ts1-hxUpJxBm4AIqZDupa6Yf32db8Wbo7xb9vg8L1vVDialSbemIv0WE9guttZcGiw', 'https:\/\/play-lh.googleusercontent.com\/Pte-WAWraBXvRQ4nOloleSVSo2xsCTvzvrWtVbCux-q1y3pi8FHdBKt7HMrr816gMW3y', 'https:\/\/play-lh.googleusercontent.com\/dDixaJynu2yCvgxBO-OV6gw5UZclrR6Lu4oGSbz_5Mqxc1ukT5KDnEFHph_mKJ0Uh9w']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"Nov 10, 2022","lastUpdatedOn":"Apr 29, 2025","updated":1745938259,"comments":"[]","appId":"com.google.android.apps.healthdata","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.google.android.apps.healthdata&hl=en&gl=us"},{"title":"Planet Fitness","descriptionHTML":"Welcome to the Planet Fitness App: The Gym in Your Pocket!<br>Did you know the PF App has tons of free features everyone? It’s not just Planet Fitness members that can enjoy what the PF App has to offer! We believe fitness should be accessible for all, which is why non-members have access to a huge library of on-demand digital workouts, helpful exercise tutorials for extra guidance, and activity tracking to celebrate wins. You can even sign up for your membership in the PF App without visiting your local club.<br><br>Plus, we have exclusive features for all of our amazing Planet Fitness members like discounts on top brands you love, up to 3 free months through the PF Refer-a-Friend Program**, a Crowd Meter to pick the best time to visit, easy digital check-ins and more! <br> <br>DIGITAL WORKOUTS: FREE FITNESS ON-DEMAND<br>– Motivation: Start &amp; stick with fitness no matter where you are on your unique journey with free workouts led by motivating trainers<br>– Guidance: Enjoy the benefits of Judgement Free fitness &amp; education for all, with or without a membership<br>– Convenience: Get moving anytime, anywhere! On-demand workouts are designed to be completed at home or in the gym.<br>– Variety: Browse workouts by type, time, target, and more to find what’s best for you, whether you’re looking for a workout for beginners or want to try something new!<br> <br>EQUIPMENT &amp; EXERCISE TUTORIALS: GUIDANCE WHEN YOU NEED IT<br>– Easy-to-follow equipment tutorials &amp; exercise movements to perfect your form and not be intimidated by equipment at home or in the gym<br> <br>FITNESS TRACKING: CELEBRATE YOUR WINS<br>– Record how much you’re moving with the free Activity Tracker with a variety of in &amp; out of gym activities, available for members AND non-members<br>– Fill out the “About Me” section to customize your fitness profile and receive personalized workout video recommendations, no membership required<br>– Members can track check-ins in the “My Journey” tab. We’ll celebrate small wins together–just keep showing up!<br>DISCOUNTS FOR MEMBERS: SAVE ON TOP BRANDS YOU LOVE<br>– Make your fitness journey more rewarding when you save big with deals &amp; discounts on your favorite brands across apparel, food &amp; drink, travel, and more!***<br><br>MEMBER SAVINGS: FITNESS WITH FRIENDS<br>– Planet Fitness members earn free months through our Refer-a-Friend program<br>– Every friend that joins earns you 1 free month of membership** and your friends can join for only $1 down. Now that’s a win-win!<br><br>CROWD METER: A WORKOUT THAT WORKS FOR YOU<br>– Planning to squeeze in a workout? Pick the best time of day to visit the gym with our Crowd Meter! <br><br>CLUB CHECK-INS: SEAMLESS, TOUCHLESS ENTRY <br>– Check-in quickly &amp; easily at your Planet Fitness home club with your digital Club Pass<br><br>PF BLACK CARD® MEMBERSHIP: ALL. THE. PERKS.<br>– Upgrade to our most popular membership right in the PF App for even more member benefits<br>– Enjoy PF Black Card® perks including use of any Planet Fitness worldwide, bringing a guest every time you work out, access to premium PF+ workouts &amp; discounts, use of the Black Card Spa® where you can relax in massage chairs &amp; HydroMassage™—and much more!****<br>  <br>Download the FREE Planet Fitness App today – You got this!<br> <br>**Up to a maximum of three (3) total months of membership per calendar year. Visit https:\/\/www.planetfitness.com\/referrals-terms-conditions for more information.<br>***Restrictions and exclusions may apply. Valid at participating locations only. Offers valid on select products only, see specific offer for details. <br>****Services and perks subject to availability and restrictions. State and local restrictions on tanning frequency with PF Black Card® memberships apply. Participating locations only. See club for details.","summary":"Workouts for everyone","installs":10000000,"minInstalls":10000000,"realInstalls":15811680,"score":4.6357636,"ratings":68275,"reviews":14597,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$1.99 - $5.99 per item","developer":"Planet Fitness","developerEmail":"PFMobileAppSupport@abcfinancial.com","developerWebsite":"http:\/\/www.planetfitness.com","privacyPolicy":"https:\/\/www.planetfitness.com\/privacy-policy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/OICnkECAhWjgkWSy2oBo4DJVE1myjJ5TC1YfdQJi6MMPQgEHvyg2YbuSnM4ENJy1t1ok","headerImage":"https:\/\/play-lh.googleusercontent.com\/lHJ2r61cLY3a14llt3AS-E6TxgEoXJ7u96BvloCqQp0pmLbEC6DwNQtsOdK8UuTong","screenshots":"['https:\/\/play-lh.googleusercontent.com\/_bWbFLde9ZoDIw_iShIwaHljpjisCumxJxIaasWdYuvVZ6xkcof3HQgEE6mmaK6rQoQ', 'https:\/\/play-lh.googleusercontent.com\/fGSsKt-XuQXxss1ECNvyQyATmkTGN1l3bvIMEKO1m2uz1beZa95tkdUV1I8TWBDaO3U', 'https:\/\/play-lh.googleusercontent.com\/HhYs4japh-qBeWULxcu3hhwjnX0vIcoo4aqm2PXPvW-rnsSVnKgdxwFsm3LFnnddOKAs', 'https:\/\/play-lh.googleusercontent.com\/nP-6EN4xwoiM__7PerdidLWxP_BSaHM9J5AhNQ1wPVKIqXKotWhW-OGwhQkEuyzupmQ', 'https:\/\/play-lh.googleusercontent.com\/VEbK_wH4fYigqT3ydTYX4wKhe6t6UE3MgGP5ks6b3QrD35puP_tFR6J1cmq8OQ9k1rQ', 'https:\/\/play-lh.googleusercontent.com\/Ta88_uo747vyf6tC1jxN_sr-yZLQAcJfmUsTCWEzFdn8iHv5uiuTOzHFmRHj9Pyyig', 'https:\/\/play-lh.googleusercontent.com\/UwZzx2Cy4QRiLc0idp2S31aoFZvJM7NXBpSppajcprW3khbi6pXBkAOvs_8JBG4iegE', 'https:\/\/play-lh.googleusercontent.com\/6c89ViE7CaRJauBy9pkV2fC8S4HRPq0XYrkWqbwgwR9IvY9cqmGZQFs2AtRruGMsDK82']","contentRating":"Everyone","adSupported":true,"containsAds":true,"released":"Feb 5, 2015","lastUpdatedOn":"Apr 22, 2025","updated":1745346826,"comments":"[]","appId":"com.planetfitness","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.planetfitness&hl=en&gl=us"},{"title":"Healthify: AI Diet & Fitness","descriptionHTML":"Transform Your Health Journey with Healthify: The Ultimate AI-Powered Wellness Companion<br><br>Join over 40 million users who have embarked on their path to a healthier self with Healthify, the leading health and nutrition app designed to revolutionize your wellness journey. With Healthify, your journey towards a healthier lifestyle is powered by advanced AI technology, offering personalized health insights and seamless meal tracking at your fingertips. Experience the future of fitness with Ria, our AI nutritionist, and Snap, our innovative calorie-tracking tool, and take the first step towards a healthier you today.<br><br>Why Choose Healthify?<br>Healthify is more than just a fitness app; it&#39;s a comprehensive wellness platform integrating sophisticated AI technology to provide personalized health and wellness guidance. Whether you aim to improve your diet, enhance your physical activity, or simply maintain a healthy lifestyle, Healthify is here to support you every step of the way.<br><br>Innovative Features Designed for Your Health:<br><br>Meet Ria – Your Personal AI Nutritionist: With Ria, get tailored nutrition advice and insights whenever needed. Leveraging the latest in AI technology, Ria offers 24\/7 support, answering your health and fitness questions with personalized recommendations to guide you on your wellness journey.<br><br>Snap – Effortless Meal Tracking: Say goodbye to tedious manual logging. With Snap, just take a photo of your meal, and our AI will analyze the calories and nutrients for you. Meal tracking has never been easier, allowing you to stay on top of your diet with the snap of a picture.<br><br>Comprehensive Health Tracking: Easily monitor your daily activities, including steps, hydration, sleep, and workouts, with Healthify. Our app seamlessly integrates with popular health platforms like Samsung Health, Google Fit, HealthConnect, Garmin, and Fitbit, providing a holistic view of your fitness progress.<br><br>Extensive Food Database: Navigate through our vast database of over 100,000 foods, offering comprehensive calorie and nutrition tracking for a wide range of cuisines. Meal planning is now more accessible and enjoyable, helping you make informed dietary choices.<br><br>Daily Challenges to Keep You Motivated: Engage in daily challenges designed to boost your commitment to health, wellness, and active living. With Healthify, find new ways to stay motivated and achieve your fitness goals.<br><br>Smart Scale Integration for In-depth Insights: Connect with smart scales to track your progress accurately, receiving detailed health data and insights that help you understand your journey better.<br><br>Join a Supportive Community: Be part of a vibrant community of individuals on similar health and wellness journeys. Share your experiences, seek advice, and stay motivated with the support of the Healthify community.<br><br>Download Healthify Today and Start Your Personalized Wellness Journey<br><br>With Healthify, achieving your health and fitness goals has never been easier. Powered by cutting-edge technology and AI, Healthify offers a unique, personalized approach to wellness that adapts to your lifestyle. Download Healthify now and take the first step towards a healthier, happier you.","summary":"Meal Planning, Workout Suggestions, AI based Photo Tracking, Calorie Tracking","installs":10000000,"minInstalls":10000000,"realInstalls":38422912,"score":4.5013475,"ratings":566893,"reviews":647,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$0.99 - $89.99 per item","developer":"HealthifyMe (Calorie Counter, Weight Loss Coach)","developerEmail":"android@healthifyme.com","developerWebsite":"https:\/\/www.healthifyme.com","privacyPolicy":"https:\/\/www.healthifyme.com\/terms-of-use\/#privacySection","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/NPfbXxAAV3GQ_43zctYR7ZjM5_pz7vpYlG2qhCCA9bFP1MPrHYYACxIEALZdp0koE-k","headerImage":"https:\/\/play-lh.googleusercontent.com\/vpxkRzGloKtNLOYlEuM93nN1SLMQDE9b8JZZaQpQ4m8bxs11JuIMt3w4771BqYT41kM","screenshots":"['https:\/\/play-lh.googleusercontent.com\/utzAcAWEFxewYtx7QbEsecB0IVc1-Rm82cRPy5bjYCLs59sOwJf99iQMbgev-P9QyaTM', 'https:\/\/play-lh.googleusercontent.com\/e2TTHxvx7WYuKz_OI1Jr-IUNzm5ZawLaqPkkN3YB4J178FmTFsGl2M3LTH-qwNUdiw', 'https:\/\/play-lh.googleusercontent.com\/8NO36zVDzg2VLENUKkRm7VdX1fwdUl7luXDPiCeP-QUQVx_BSnDRemLa7U3Mp3U3fuFE', 'https:\/\/play-lh.googleusercontent.com\/4W-V5SFBseuUP4qYZS3dQfEmJJBz5mu0jTvLeaah1eNrORZWkjFdqcT_7xYi1WspcO0', 'https:\/\/play-lh.googleusercontent.com\/n5_Kvnf5y8XG6PP03uaiCTAO9X19UgM1Fx5hcLQK1ak6tKzYr4WHoOI7_EEtyXEeSh4', 'https:\/\/play-lh.googleusercontent.com\/_NDp8aesX9ItOc5PNcrhRgCkcitythPVXY9a_gWPxH80wPqKedFziD2EjCz3vmPQaG0', 'https:\/\/play-lh.googleusercontent.com\/6P6ZRm2pz1jadVPdub5hHJYxknsb0_tefONLcxsrGLK0wK-htqFkLcu19Jjo0rDK2Ts', 'https:\/\/play-lh.googleusercontent.com\/Qvq8YIHaTLcm8D28BXuiEra5VrVQoxN1x-Rtndig8qq3venBWSTIGNyQwWw02uXH4Q', 'https:\/\/play-lh.googleusercontent.com\/hE5Ej7fEeGvGXzq8Q4_wvsY3p2sThfqi7gw6sJIlRGeeURbFv8_5JgRjoaIdYsQTzHw', 'https:\/\/play-lh.googleusercontent.com\/QEII6BDjX2RjUgDyiExc4XJynouRkUoOFkbE6DikWh4csZD-gcFPUWTsv4bPSnAHFuo', 'https:\/\/play-lh.googleusercontent.com\/T_2-IW6PUj-bTVT-RSBEWCYo03hVSJGzppLrfyXL4aEhV-73-JUUzGPfiWRlhwvjPqc', 'https:\/\/play-lh.googleusercontent.com\/37GkXDwL-3vQIA6axgBYd4zbPtGWpNPNkp0UspgqpgknPuEwB9nbpsPuXauBlQN3fC4-', 'https:\/\/play-lh.googleusercontent.com\/0ZDnwijM-wMOtcnQDGpfdJYs51TOGCwpY6OQdCXLHgmZ0MOO9gWvDyiekTmpstE3JYQ', 'https:\/\/play-lh.googleusercontent.com\/QUmzuwsx2aEJ9bdXv2VqL6P1aXJcjryWLOcMch9s0I-sgrc5LN2GXK7J6dE0NQPGcAEA']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"May 11, 2013","lastUpdatedOn":"Apr 30, 2025","updated":1746001362,"comments":"[]","appId":"com.healthifyme.basic","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.healthifyme.basic&hl=en&gl=us"},{"title":"Peloton - Fitness & Workouts","descriptionHTML":"Kickstart your fitness journey with the Peloton App. Enjoy strength training, meditation, yoga, Pilates, walking, and easy-start ab workouts. Experience energetic classes on any bike, treadmill, rowing machine or during a walk outdoors. No equipment? No worries.<br><br>WHAT&#39;S IN IT FOR YOU?<br>• Find a variety of workouts that fulfill your fitness and cardio goals, such as strength training to build muscle, indoor and outdoor running, cycling, yoga, HIIT, meditation, stretching, Pilates, Barre, and more. Whether aiming for a healthier body or a peaceful mind, our cardio, training, and gym workouts are available on your Android phone, tablet, or TV.<br>• Peloton is designed to keep you going, boosting health and muscle strength with artist series, goal-based offerings, and challenges that make working out on the Peloton App a fun experience. Whether doing yoga at home, running outside, or hitting the gym for strength training, Peloton has you covered. Exercise with Peloton and push yourself to the next level of fitness. Our class offerings provide full guidance, helping you achieve your goals, no matter your fitness level or experience.<br>• With every workout, from walking to Pilates to ab workouts, designed for your body and health, exercise has never been this fun. Break a sweat and reach your fitness goals anytime, anywhere, whether you&#39;re walking, stretching, or running.<br><br>DISCOVER, LOVE, REPEAT<br>• Thousands of workouts that you can take anytime, anywhere, with or without any equipment. From cardio to stretching to Pilates, we&#39;ve got you covered. Guided workouts can help you achieve your fitness goals anywhere you go.<br>• Let our world-class instructors, including Pilates and ab experts, motivate you during every workout. Track your progress and stay motivated with the Peloton Watch App on Wear OS watches.<br>• Join live classes or explore our library of instructor-led ab workouts and running sessions for a studio fitness experience to get moving whenever you&#39;re ready to sweat- on the go, at the gym, or at home.<br>• Schedule, stack, and bookmark classes. Whether running at the gym or doing yoga at home, Peloton will enhance your workout experience. Use the Peloton App to exercise and stay organized in your fitness journey.<br><br>TRANSFORM YOUR FITNESS JOURNEY<br>Filter workouts for muscle strength, length, time, and music type to help you hit your health and fitness goals.<br>Energize your fitness routine and muscle health. With expert trainers and great music, our classes provide guidance to enhance your fitness journey.<br>Track your classes and activities like outdoor walks, runs, gym workouts, and yoga. Connect a heart rate monitor or download the Peloton Watch App for your Wear OS watch. The app provides real-time metrics designed to support your health goals and keep you moving forward. With Tiles, your Peloton streak seamlessly integrates with your weekly activity report on your Wear OS device. Stay motivated, and never miss a step when you track your workouts, walks, or runs.<br><br>Watch Complication: Workouts are now just one tap away. Add the Peloton complication to your Wear OS watch face to start and track workouts directly from your watch.<br><br>From version 3.36.0, the app requires Android 7.1 or higher. Version 3.35.0 supports devices with older Android versions.<br>By completing your purchase, you certify that you are at least 18 years old and that you understand and agree to the Terms of Service (https:\/\/www.onepeloton.com\/terms-of-service) and acknowledge the Privacy Policy (https:\/\/www.onepeloton.com\/privacy-policy). By subscribing to our App Membership at the applicable price (exclusive of taxes), you will be automatically charged monthly or annually, as applicable, until you cancel. Auto-renewal may be turned off in your Account Setting in Play store after purchase. No cancellation of the current subscription is allowed during an active subscription period. A user that cancels during a subscription month will not be charged for the following month.","summary":"Achieve your fitness goals: Strength, cardio & ab workouts at the gym or at home","installs":1000000,"minInstalls":1000000,"realInstalls":3345882,"score":4.1786942,"ratings":14528,"reviews":5502,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$12.99 - $240.00 per item","developer":"Peloton Interactive, Inc","developerEmail":"support@onepeloton.com","developerWebsite":"https:\/\/www.onepeloton.com","privacyPolicy":"https:\/\/www.onepeloton.com\/privacy-policy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/Q4K531LEkV8kz-xCIXNEZ3E7d4H6uxKubkd6oN3i8BCi2NbWksT5xhmvrYeukb0Uutg","headerImage":"https:\/\/play-lh.googleusercontent.com\/1idABM0M2SM1T6QWxvQvEloVyPHyHw6_bDr_l8WExlXaCGrRUppoMH9EtHb4U0aDvQ","screenshots":"['https:\/\/play-lh.googleusercontent.com\/X7wzxjivlgxoFGgx0jNM6c3nAQ0m5tdyGiDVFv_ZrdRUPlJYCGDCzvPmqVHST-q8JjxB', 'https:\/\/play-lh.googleusercontent.com\/BIq37mx73d-2GRjzruHfz-fi9dAQMt23RpOMXrpSTdLemFu8Uqq2OuaV3LTH4fNDaQ', 'https:\/\/play-lh.googleusercontent.com\/KMQMLyhigSuJnn4-EW-fdz0YKMyeFdplGPdJDYvyAqvC7mnKYdXU_7g2mQ0oEsRJYk0', 'https:\/\/play-lh.googleusercontent.com\/gGV08UCqY_CtMgkL8xNDX9kEmptn-Vr5wJb5WWJavgkZjxtcRDbFoONAPpjLi3rrmk4', 'https:\/\/play-lh.googleusercontent.com\/W44uOxcLWRMi3fKBDvNJoX3vr2i6aTAFgsepeEe5Piq2lHy0s8zgmFv-QXjTbKw-6hyI', 'https:\/\/play-lh.googleusercontent.com\/OnZF2rnBLjC00jSaBHLy6rWk-CoGgLA3b61Bh3fbA1jxgPlnnFe2ruROw8b9ZerMLPL4', 'https:\/\/play-lh.googleusercontent.com\/SRrcJ390xTAgMSAnqbqGfxl9pV9AK6mz7-_-wKApZ7wJwCS9SQgViIVeZWh9Pw3kSts', 'https:\/\/play-lh.googleusercontent.com\/17EModaI83M1L8jP2H5_DiUzvEm8EcPpytxJ9C0uOj2JdOnXDzPJY9-4P9PbMSvrqik', 'https:\/\/play-lh.googleusercontent.com\/eHzXWrQx2qDOs9EH0lQ0ufpnHoE8LywLe-bNg1Etypzl0v-8RhLviMUBB2PFUwnW71M', 'https:\/\/play-lh.googleusercontent.com\/TX0igQhTbm5Xf-Rj6D9en1ZZdguABj6PlqXZMA0aYcvWj7lVG8Wg9tb4XJEU6eoOD0QO', 'https:\/\/play-lh.googleusercontent.com\/B8S6xS9j9WzbNLl3x4XqJzpTcXu2RRRCBeZd53siqeWZuSdmMx-DWbdeOjV3HmOmhik', 'https:\/\/play-lh.googleusercontent.com\/ubi0z-HrUofVzgTtH1uYJKwIVsYJXAKSPrpzhc2g2_GMeUMKvZebmb6kl8piZ1XqvQ', 'https:\/\/play-lh.googleusercontent.com\/XvQSj6Y4bn2i8-3joxu-2PwivYUBb8i3n8Pd1QeAUn8CQV_KErOt8TQbNyYUzmQctQs', 'https:\/\/play-lh.googleusercontent.com\/xmnxSWiv8aKwvvQwfi7eFVi-ocJsATD0RcqPWkvIbbZ_8AkQmYCkWAFbLurGufGrgOI', 'https:\/\/play-lh.googleusercontent.com\/029S8bY17h40ZLdd8YuvF5xKcUOFam_KI75mxi7IRMm3W4G82FnmWL7tP_nKEZzKgw', 'https:\/\/play-lh.googleusercontent.com\/lipjVXqQtBZAd6v7FFOPFQgrJzB13SH3sL53n_u4MCcmllK-YD4MQNpPl0bu9CIoNy8', 'https:\/\/play-lh.googleusercontent.com\/o71Ky9NFqbI0VEusGyQ6tc56_I_E3AM4JH2WbraSPVXCRgyqMre99duhV0Zjq1g_Xt-N', 'https:\/\/play-lh.googleusercontent.com\/orLjQQKgaVEVw6G5UEU6MwL2g4ADbZP6bEZ95M1P7XSH1Wr9unaaZMvkFWcCyNFKiqfx', 'https:\/\/play-lh.googleusercontent.com\/dp4yMcFOUhtCYIPra1pv7htchWPiokCvIwS-0a_x7Exjtn8RElk1f60ezp8t8qrix-h_', 'https:\/\/play-lh.googleusercontent.com\/PiIARW-VuLZ3b69KskMCYqjcBbTnn0B775atrk8CNyQTFRlp7HZtoc24oJfN3tBc6wM', 'https:\/\/play-lh.googleusercontent.com\/zEP3coEU3zWua1SjJxN_TWpwEvwN_DSjSlZ8rbn6F1ILLHqExf3uPp7XRRzOnTbhFQ', 'https:\/\/play-lh.googleusercontent.com\/oIWdpONzJr1RSopUNpiG8w2TVttVukyVrk3S_d2nc-S7tjoCCAxlhHcOvT6mmsS5_q4', 'https:\/\/play-lh.googleusercontent.com\/ZuBqaU3Pw_-w9ufQMwCgKfKrejtHaHrgE05UeCycNKKFAp8JQAVA4KbJ1GZfugllWg', 'https:\/\/play-lh.googleusercontent.com\/k801J6vaO-9XbR3xj4ZzaK_dSk53SMLyWCuadVRC62-IzPyyyXNW2kTCINaNpHq2naQ', 'https:\/\/play-lh.googleusercontent.com\/VPWbVaP70CmF_fxmC5gS2I5mZ1aaz4CXh0PFmMQYtqu6wgvZ8GT65bhMBz_tvx55PA', 'https:\/\/play-lh.googleusercontent.com\/uRLE3row8Ycf2342tTbmq3ApHKtXJHXO9HlNC2JCtPScx3t0xlBUb_qe3rkXm1XuXzU', 'https:\/\/play-lh.googleusercontent.com\/L6Kg7LdxTJIfuqTszM6de5n0gn6e_NpMhU-5qjaj_e6PT-rxqZeQxSjIW3UMRqCt8-o', 'https:\/\/play-lh.googleusercontent.com\/AO4_HJh1oQHeHAGcD9LyYQ4Q5QLqG5HIXD1k4qeGhfNjs0URWsPoNSOkELRgWPTPK9X2', 'https:\/\/play-lh.googleusercontent.com\/kxrxyF6nAzKYgRNEI-1ryaspqk5DRuWzW1CruvmoUYN1MnUfeDsVaWBMVl3-tl_cUpY', 'https:\/\/play-lh.googleusercontent.com\/EPPrYXGHZAYHD--GInXf1SvcP0D11oxzLVRvltDtJCW2VQx_HdbXuBhG_6MdyitLYxdi', 'https:\/\/play-lh.googleusercontent.com\/jYP0Dv8P7NY2kW2tp_lNasWL9jce5SzZsRf8f7_ioNJpJilqJVHtxkhJkqpYakmRoQY-', 'https:\/\/play-lh.googleusercontent.com\/HRUUVurUiyRBLgjL9iKZ4pWtPdMbDaPMGXOkwl4E9P7C_YVsA6a2jjFBfdqWKlzlXNt5', 'https:\/\/play-lh.googleusercontent.com\/sSKly6dPWHowcKyjx4-9j5E5NLzx2fT-10EDcXCj0lXMTvPOp1hQCzaBzFi62YrOpA']","contentRating":"Teen","adSupported":false,"containsAds":false,"released":"Dec 20, 2018","lastUpdatedOn":"Apr 18, 2025","updated":1744996809,"comments":"[]","appId":"com.onepeloton.callisto","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.onepeloton.callisto&hl=en&gl=us"},{"title":"WeightWatchers Program","descriptionHTML":"WeightWatchers is the #1 doctor-recommended weight-loss program†. Our app just got some NEW upgrades, and it’s now even easier to follow, easier to stick with, and more effective.<br><br>Lose 3.5x more weight*- and keep it off with unique solutions for every body. <br><br>- Our proven Points program is the foundation of what we do. Get customized food plans and nutrition guidance to fit your needs. <br>- Maximize your results with coach-led Workshops where you will get expert live support. <br>- Access a personalized prescription medication plan, if eligible, and get 1:1 check-ins from a dedicated clinical Care team. <br>- NEW! Meet with a Registered Dietitian for easier, tailored meal planning.<br><br>Trusted by millions, personalized for you. <br>All members get access to our easy-to-use, award-winning app. Here’s a preview of some of our features, including NEW ones to help you track even faster and easier:<br><br>- Food, fitness\/activity, water, and weight trackers <br>- NEW! Use your camera to track meals and their Points® value<br>- NEW! 350+ ZeroPoint, no-track foods <br>- NEW! Automatic macro tracking of any food you eat  <br>- Barcode scanner to find the Points® value of any packaged food<br>- What to Eat guides help you make healthier choices when dining out or cooking at home<br>- 11,000+ recipes and a database of 450+ restaurants<br>- NEW! Generate Points® value totals for any recipe on the internet<br>- My Progress provides a weekly report to help you see what’s working and what to improve<br>- Access to an exclusive, members-only social network. <br>- 24\/7 live WW coach chat<br><br>Download the WW app now and get a free trial today! After your free trial, your plan auto-renews monthly unless you cancel before the trial ends.<br><br>MEMBERSHIP TERMS<br><br>Privacy Policy: https:\/\/www.weightwatchers.com\/us\/privacy\/policy<br>Terms of Service: https:\/\/www.weightwatchers.com\/us\/termsandconditions\/onlineplus-coaching<br><br>†Based on a 2023 survey by Cerner Enviza of 500 doctors who recommend weight-loss programs to patients.<br><br>*Based on a 6-month randomized controlled trial (n=376) that compared participants following WW to those given standard nutritional guidelines alone. Palacios et al. 2024. Manuscript under review. Funded by WW International, Inc.","summary":"Weight Loss and Better Health","installs":10000000,"minInstalls":10000000,"realInstalls":16754844,"score":4.510663,"ratings":593191,"reviews":115164,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$0.99 - $349.99 per item","developer":"WW INTERNATIONAL, INC.","developerEmail":"mobile@ww.com","developerWebsite":"http:\/\/www.weightwatchers.com","privacyPolicy":"https:\/\/www.weightwatchers.com\/us\/privacy\/policy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/kZ83YH4bsugJR_1F5zQgG9t6IOTWuYkO-Z92Q11KLM75wPNFzfjWJeH1VHX61FARnGM","headerImage":"https:\/\/play-lh.googleusercontent.com\/6Y-2rU0HQMVTEDSUUsPCgOR_OEnPCfBY-rV4xwkiDDMWFFHOixosCn8EmTXRcDSoCyE","screenshots":"['https:\/\/play-lh.googleusercontent.com\/xXgIY1P4sz3MtWntltMzpx3KVuOSEO8WDxNr7hHaTY2YrazOZJ_8JAMPrpwsrq82Pec', 'https:\/\/play-lh.googleusercontent.com\/Q0RZdQZCYiNN_yYN4pzFoLUkr_2YYU9GFr-_AqFGvmehgBhkf9P2c8P8It4UgKto2w', 'https:\/\/play-lh.googleusercontent.com\/d4gGA2xA4hzCtixQz9wvZgbAMAenRO1FT_T-DiAElEn5wqe_JlQ1tUerWCoOAKiTKzJX', 'https:\/\/play-lh.googleusercontent.com\/Z6mWDBiPxqme8r3lL1pWbU1bcJAUui8G8qz_E1qiJk3tAmgc6FzQ5AsUklQ8da_dHDo', 'https:\/\/play-lh.googleusercontent.com\/alu5geAEjmltnIYYBEwVyxEok61R3uROsBlqIwnI2Pcr4Q90qxtz8UGUI5lc4ev19hE9', 'https:\/\/play-lh.googleusercontent.com\/hfFj4k4naVQyRVfhzIGpxcAvaJsNxd1tRXa0vLdvxGmWWBArRDGJEXmUrpkWkWqbMKBY', 'https:\/\/play-lh.googleusercontent.com\/1uds753XXLg2ta-97LVR8hX6vtOTFoe28ktksSX8Y2tAk1tLGqoOe9FS2EbupvAutg', 'https:\/\/play-lh.googleusercontent.com\/N0S--Iccbahp39JSx6pr4lYlPfbVevYy8d2aJX1g8nEOYv9EQ0FpX0UXM1dogoaHXEkJ', 'https:\/\/play-lh.googleusercontent.com\/7gxjXyLTIMAwRbbWLCz05NVxyCvZUzXoQTMGvQpVfjeZx9pM0JYSAQIwfP3oPWIckQ', 'https:\/\/play-lh.googleusercontent.com\/Wz8aRB-wur-xkdgiboDh5zjmJ4SXa3p7vNAQnx6TxtBquoSzAtgjZbT5T-tTjCNbfA', 'https:\/\/play-lh.googleusercontent.com\/QAaMWdoU36UTtcw4Wc3GVWilv-vjLfp8ilXShDe2jKY89tsqQ31knkxW_NHeMydzumac', 'https:\/\/play-lh.googleusercontent.com\/CvCPZi8VcbpWzEa71m93QvcoHxVOAS583U_WE76SncEp35KmzGd6cg0uM0Im6BXjFx9v', 'https:\/\/play-lh.googleusercontent.com\/0hyYZpb85jR-oDTNbBcBBAdwRGIpEqlp6jinkLLMpQYuIqGavI-1dykiYSNJH9vNgA', 'https:\/\/play-lh.googleusercontent.com\/P0Twu5A0bpdg-LLEo0E6Jpkat8_qJVr2xfuTbD7xpL9uzBDGk4vyN4N_-uBH73ngzjg', 'https:\/\/play-lh.googleusercontent.com\/xMZlb5dMXvjJbgg_BMvlU2RLuB3UPuEdutKDc1aDCDybU5DZJgyTsWVTud42PrUucg', 'https:\/\/play-lh.googleusercontent.com\/nb4yJmpAEWjc_YqEkwkqcOI8JSJQGK84bsaoQiGrxiZSTyJjKJGlG51JpT4KIfZ6llne', 'https:\/\/play-lh.googleusercontent.com\/pJoQ8TS2lMdjn1BKizVIQljDBNWz7Er4z07C3vRejOZ_MkEEknKXZPJ-mpxoExZhbA', 'https:\/\/play-lh.googleusercontent.com\/nan_kTRVyxuJrLN93Ybwf0p9XIHDeayfo_ic48yHmHnu3EGhDbbdmxoGzzoVs8AOHFo', 'https:\/\/play-lh.googleusercontent.com\/Biab0cHMNr3vbA2u3_IjxaZfVeJmk8a7xeTQWuS2tV_QyGAGIA8OfTsQsl-dZaHOmA', 'https:\/\/play-lh.googleusercontent.com\/jFWmBRungdgpnZo5JVTV_zsaSH5ESUZnJKmMRubCb6EzwatHlrRAivcXbLqyklZ3ai4', 'https:\/\/play-lh.googleusercontent.com\/AIUrkYQcRsjhzDJzTvlQY8DsqjSLnKDQMc6tOtysj5b3M2DI4OZzq84Op1hapYp_OnI', 'https:\/\/play-lh.googleusercontent.com\/Yshe4613SS__TmsMr835LVTme-3G6MPt0jK_PUxj-yAb533ariaghtUYWOcKkGM7ZQ', 'https:\/\/play-lh.googleusercontent.com\/qhEswTxWV6P8Y73ZUnyZ7jqOCmfCm3NEZHkP5uR7cBNeKDfjiTdKyK7wNoUKfBKkDMs', 'https:\/\/play-lh.googleusercontent.com\/U2S9nIyJsKQu68l4dUPlJwbbq-BLmZeHFJcvAMpmZXg8FJCyugaNHU2rxSAh4m94XMRB']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"Apr 12, 2011","lastUpdatedOn":"Apr 26, 2025","updated":1745700449,"comments":"[]","appId":"com.weightwatchers.mobile","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.weightwatchers.mobile&hl=en&gl=us"},{"title":"BetterMe: Health Coaching","descriptionHTML":"Getting fit is now even more accessible with the brand new BetterMe app!😍<br><br>FIVE REASONS TO INSTALL BetterMe:<br><br>📊 Customized wholesome approach to weight loss and weight gain<br><br>We adjust to your busy schedule, preferences, and lifestyle to achieve fast results without harming your health.<br><br>🏃‍♀️ Workouts for any level<br><br>Whether you’re a beginner or a pro, we’ve got you covered with a variety of exercise sets for at-home or at-the-gym sessions, with zero equipment or a full gym setup. Even if you’ve never tried to work out in your life, our simple and clear instructions will help prevent injuries and get you accustomed with a fitness world in record time.<br><br><br>🥗 Easy-to-follow meal plans<br><br>Nutrition plans created by certified experts to boost your progress with options like intermittent fasting, keto, vegan, and many more.<br><br>⏱ Intermittent fasting<br><br>BetterMe encourages you to try out a 16:8 fasting approach - a proven method that is all about WHEN you eat instead of WHAT you eat. Tap on the timer, start your fast, reap the rewards!<br><br><br>⌚Accurate tracking with BetterMe Band<br><br>Keep an eye on your health and fitness data with BetterMe Band*. This tracker easily connects to BetterMe app, giving you insights on your steps, heart rate, and sleep.<br><br>With the BetterMe Band, you can easily stay connected and informed by receiving notifications for incoming calls, emails, and SMS. Grant the app the necessary permissions to get notified.<br><br>The BetterMe app provides you with: <br><br>🔵  Workout programs: personalized sets of exercises and nutrition to help you get in shape faster<br>🔵  All-new meal plans: dishes picked according to your preferences, and are easy to make<br>🔵 16:8 intermittent fasting plan to help you take your weight to the next level<br>🔵  Calorie tracker: know exactly how much you consume a day and monitor your macros all with an intuitive design<br>🔵  Water tracker and step counter to make sure that you&#39;re reaching your daily goals<br><br>BetterMe offers varied workouts, easy-to-follow meal plans, and useful tips for everyone!<br><br>❗️There is no need to go to the gym; over 1,500 of our workouts can be done at home - with our vast library of exercises, everyone will find something to float their boat. Get ready to meet your new favorite way to get in shape fast!<br><br>Getting in shape has a lot to do with nutrition, and we&#39;ve carefully hand-picked hundreds of recipes for every taste, cooking time, and budget. Quickly find your new favorite keto breakfast, vegan snack, low-calorie dinner and much more.<br>*BetterMe app exclusively supports BetterMe Band.&quot;","summary":"Pilates, Calisthenics, Somatic, Fasting","installs":10000000,"minInstalls":10000000,"realInstalls":39533656,"score":4.450124,"ratings":599181,"reviews":36248,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$0.99 - $179.99 per item","developer":"BetterMe Limited","developerEmail":"support@betterme.world","developerWebsite":"https:\/\/betterme.world","privacyPolicy":"https:\/\/betterme.world\/privacy-policy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/U9Vee-Zjg9GTAhTsob69b0be3TEQPBhx9xHnfZHyD9Qqf-OikHtMXxS00iCoTgy-jA","headerImage":"https:\/\/play-lh.googleusercontent.com\/Xe3r7DOkDJ10kh6QC1FiBXqkAwzWmxCk9a2gtrBth16VuGDCayaPvI38dBGJvJ-DeYU","screenshots":"['https:\/\/play-lh.googleusercontent.com\/eg-8KAPnXKme5Cjv5cfVo64ONarbzbaFvaSMInYcKORltRlAsFvEacNpcmOXCaDKsfwP', 'https:\/\/play-lh.googleusercontent.com\/86x9YRLd09kBFJBjmstpCW_6k9_2rA1GyKIr1LF_fMpu-0h9vZBAHqXYNKadY7994rg', 'https:\/\/play-lh.googleusercontent.com\/4iJihULyccbpiC-eKvz99jc4SNcfa8ssn54pD5ujKmKDLEce-CKD3BnhaywZgcjSSeTi', 'https:\/\/play-lh.googleusercontent.com\/TqlnNHir0jbXur7i7XtlGwYIjb5HngKc3OdV7RgT0eOkgxUtQXmAnU9hJ_EXrPIYCT0', 'https:\/\/play-lh.googleusercontent.com\/lb_R59h273UN9jUCUAryUWflOCIBwUzRmMZFfZR8a0pEt6jU3LUjyyqUpr33Rjm-ajk', 'https:\/\/play-lh.googleusercontent.com\/2ZE-DCPzXSIrrcCDxI8hVbETUhNVtv_feAPUnv3rGG4pg2Ab4pcqzSU4L1SlTG4SKg', 'https:\/\/play-lh.googleusercontent.com\/Iz3HrtKFWloh6-8wMemowpci3sqxRkBBPBrB4E1W-nUgaxq_6eHMG8DK6Y5DnQbhWts', 'https:\/\/play-lh.googleusercontent.com\/YbZFR0UG6CHJYiQSIKcNGm1hxiolmuK5E9zAq2WNsLGzrKh6Yc9JSmRI9cxc3t9Raw', 'https:\/\/play-lh.googleusercontent.com\/xvS1HS_35UN0FzWj_ShmbhjgZa54AtbV-pH-blxk2vM-b9ywtgyMxL_TyhGd1viJOxhX', 'https:\/\/play-lh.googleusercontent.com\/t6hcOWEOe3Drlf2nclofCMXzot5tN0ezc9xwSojfPdoWMsyhI5YPrlwug8PVYsjv6Ks', 'https:\/\/play-lh.googleusercontent.com\/vK0eXcnXeQwSwFSpNzH0Ce7tEYhN3zf87JAKRke3oWLDnEnEIrZAqciCtACwNA0OMS7R', 'https:\/\/play-lh.googleusercontent.com\/MFAJ-BOOfHnlSillbcSXVGkaWWy1QLP5zYrRysENNKKCVOMdG7dO7InX_cEBg9lbOxHB', 'https:\/\/play-lh.googleusercontent.com\/acFjM__hjhlXtomTdxn7dKyS4PxoiHZt0V-8rm8HjURtX0F1zaJoYJbZ7HqnYr81C0I', 'https:\/\/play-lh.googleusercontent.com\/p00FD-Ple-ZBrVk6_rwwoW1RHkMfyDvh4M1qAmu9Sly1g6r2Im80_BIIxVYWfyPYdw', 'https:\/\/play-lh.googleusercontent.com\/pigHbR7ZvFzZl__p9pI40xmEM9FhhymKg-rpx_ry5ixI8Ifu9_56R9v9MvNnb7L3fQ', 'https:\/\/play-lh.googleusercontent.com\/zz34kZQZWJV3I-xa-8GlKYiIVaDeHT8-r-tX2aWrCaM6bjjTSZ3hQQ0oJLClVqlZe0bE', 'https:\/\/play-lh.googleusercontent.com\/vOs8oTLv9afmioGdxMYRoDHxWId5jLgLWAXM7YQGr-zUi1Ml-EQ9GmlKOJD_oee8fA', 'https:\/\/play-lh.googleusercontent.com\/TVo8oWD-p-dFPf9gqYOnhp0T4yQcDVb8XImqRGj9zMESInDEo-pIWhERPT7Y4Llk6g', 'https:\/\/play-lh.googleusercontent.com\/WqAy4MbH4FJUMTmW2-pUTevGS1BYO_HebpCV85qH16GlDoTx9Dia-dVsZY5TiNUy6_c', 'https:\/\/play-lh.googleusercontent.com\/MPIAkW5iBpianbzFzf9UIvU22nzqfJ-p0-7Qdh4deCppVJp4FLnJ0QkNOjrjtf3CDK8', 'https:\/\/play-lh.googleusercontent.com\/0Wcg0p5j6Q9g-TuVHajlS2wa5CgMyAc7M4TC6qQdEL4EM120kR-tQVIQrttuS9R13Wk', 'https:\/\/play-lh.googleusercontent.com\/d9ysylZl0LmnzzDwAS1HWh_QGHpS6ONX86bn60lMAXWAi3nXX67URZQPV-THWv9bKF0', 'https:\/\/play-lh.googleusercontent.com\/SfEYQrpdzsNbLA-J8b6eL7yZscqKJIF4_taSm4sk1sodTm83vKdaGiGfE6MsLvDabs4', 'https:\/\/play-lh.googleusercontent.com\/IlymwikMvzRz1LTM3ylVJ8gtHBOu-Emq0ir3Y0myrnK17T9f3O_eKHkyj0hLpS1ntQ', 'https:\/\/play-lh.googleusercontent.com\/6U03C21qRTY7U-Xj62qK9hHlLlRb95CsA5wRDXGt_rUbCQFABFGGORbZttiZVr4tV38']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"Jul 27, 2017","lastUpdatedOn":"Apr 23, 2025","updated":1745418231,"comments":"[]","appId":"com.gen.workoutme","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.gen.workoutme&hl=en&gl=us"},{"title":"Seven - 7 Minute Workout","descriptionHTML":"Getting fit has never been so easy – or so much fun! Seven workouts are based on scientific studies to give you the maximum benefits of exercise with only 7-minutes a day.<br><br>With personalized workout plans, Seven makes sure you get the most from your training. Want to Get Fit, Lose Weight or Get Strong? Just choose a goal and fitness level, and let Seven take care of the rest.<br><br>WHY SEVEN?<br>- Work out anywhere, anytime. No equipment needed.<br>- Create a habit of training with our daily 7-minute workout challenge.<br>- Compete with friends for extra encouragement and support.<br>- Sync to your Wear OS device and easily access Seven through your watch&#39;s Tile at home or the gym <br>- Create workouts tailored to your needs and preferences.<br>- Sweat with our personal trainers the Drill Sergeant, Cheerleader and more!<br><br><br>JOIN THE 7 CLUB<br>- Get faster results with workout plans adapted to your fitness level.<br>- Access over 200 exercises and workouts to vary your training.<br>- Receive exclusive support and guidance from our certified personal trainer.<br><br>Download Seven and get results in just 7 minutes a day!","summary":"Quick bodyweight HIIT workouts, just 7 minutes a day!","installs":10000000,"minInstalls":10000000,"realInstalls":10876526,"score":4.654882,"ratings":114584,"reviews":3586,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$0.99 - $99.99 per item","developer":"Perigee AB","developerEmail":"support@perigee.se","developerWebsite":"http:\/\/www.seven.app","privacyPolicy":"https:\/\/seven.app\/privacy-policy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/YghIS4tR31fXXRMYTctx_AjR5FMrNIH_4KfQ3XDd2zjiTvNhZC8OCNKCSN-b71CgiQ","headerImage":"https:\/\/play-lh.googleusercontent.com\/tbo7M9scAA9jxCSidtUDmlQxGrQRBzTK5TiGVeFoKGNrNntnJMJ6D4Ez7ogpgF1jwXU","screenshots":"['https:\/\/play-lh.googleusercontent.com\/vq2pATtgEseIGrhb9saeoo2uKfQ0FepHwtjkQyDEhBvCL4VhtZyjzQOvwwgnuuuipAI', 'https:\/\/play-lh.googleusercontent.com\/g3nauGv7WeyltpDOWUQYSTq-uKAK9SnIa80tllqaJMJ2yKio8U0LULqzHgNji4H3lQ', 'https:\/\/play-lh.googleusercontent.com\/0WcfiztdfzPxbs7m9qn1aBRh_5tyYym1Zls6AnHjY-p8YJ7hRz-gkaGSLsJrmlmd8WBo', 'https:\/\/play-lh.googleusercontent.com\/d7Q2kaT1N6ieaT3r3qa-KWfPm1r4MDWC2Vwl1HqP1bFTmy-0dVf8gUEKKQLMAZTY2iA', 'https:\/\/play-lh.googleusercontent.com\/muwDFwOjZkG0nD5HG-fuzk4txIN0BRVBHFe0yQe2Bj3ZEwPXUAbS2Gth5ZN9Fgj6Tdo', 'https:\/\/play-lh.googleusercontent.com\/N-XDPijUSisQbEvL_0-pzNzwXSo4aRs7JlFHXAsolECFucEJizfsDwIxbPEWbllCYt8', 'https:\/\/play-lh.googleusercontent.com\/mF8zhBVqIlKSf9pwANcX1Ik0OkT624YdDPMGaQM7O4MqI-ko7zePZ0LWBqhbkXGTfGI', 'https:\/\/play-lh.googleusercontent.com\/yjwslKkpi4BLaF3BSBRgJQmd8tpbQ2WNjPeihCszNAlMoVVMaXVxiHzII7xifN5apQ', 'https:\/\/play-lh.googleusercontent.com\/4zEvW7myAeRtV_gNGn9UXNaVWOiGVZknLjrmLJGW-FNdPQDrcGokWgo7Q8HGdcxGq8o', 'https:\/\/play-lh.googleusercontent.com\/82HuQHxnteYgtNmKnCh2JEeQjxyRzFV8hsg8fZzJ3ZQmd3dy86c7PAdkEzhtwaraHA', 'https:\/\/play-lh.googleusercontent.com\/ttLJGNy4dQC-xrIh6YjILElFK5HxntK2DFJ56Ffj_sCdXrAVUVdYPiGywL451krh5Fo', 'https:\/\/play-lh.googleusercontent.com\/VG2uN-fSNLo2S8gIzNcGox5AfRiNmzNvxO_VQIyze44cmd8NNfoPlBCnc0izcqmemmRt']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"Apr 18, 2014","lastUpdatedOn":"Nov 8, 2024","updated":1731070516,"comments":"[]","appId":"se.perigee.android.seven","url":"https:\/\/play.google.com\/store\/apps\/details?id=se.perigee.android.seven&hl=en&gl=us"},{"title":"Fitness App: Gym Workout Plan","descriptionHTML":"Whether you are trying to lose weight, gain muscle mass or want to have well-defined 6-pack abs – our gym planner fitness app offers full body workout plans with many free 3D exercises, to help you achieve your body goals. You can choose from a variety of exercise plans targeted at specific muscle groups, such as chest workout, upper body workout, abs workout (stomach workout), arm workout and full body workout at home, or tailor them to a certain goal, such as fat burning workouts, conditioning workouts, or bodyweight workouts. You can also get ready workouts with diet. This fitness app stands out from other free gym workout apps, as it has a gym progress tracker and a workout planner that allows you to have your own workout diary, maintain your workout routines, and find the best personal coach in any city for online fitness workouts and bodybuilding sessions. This cardio workout app is one of the best workout apps for men and free workout apps for women, as it allows to select a gym routine for men or a gym routine for women. Meet other members, log your workout, such as beginner workout, gym stomach workout or abs home workout, ask questions, and receive competent answers! Keep fit at home or at the gym with the online community of your strength training app!<br>Why Fitness Online?<br>- Stands out from free workout apps: Ready workouts with a diet plan created by bodybuilding champions who work as coaches on our cardio workout apps.<br><br><br>- Workout diary: Track your progress with our fitness tracker and workout tracker.<br><br><br>- In-App Encyclopaedia with information on exercises, health and diet.<br><br><br>- Over 850 exercises with high-quality 3D animations.<br><br><br>- Diet plan - weight loss: Over 5000 food products with nutritional value tables and a calorie counter.<br><br><br>- Sports nutrition: Essential additions to your diet for fast muscle building (gain weight).<br><br><br>- Personal feed: Share your workouts, ask questions about exercises, meet and chat with other users of our community.<br><br><br>- Text our coaches using the built-in chat feature. Send recommendations to your friends and help them lose weight, get perfect abs, workout arms and chest, and maintain a healthy diet with our gain weight app.<br><br><br>- Trainers’ headquarters: Pick a personal trainer based on rating and feedback.<br>How does it work? <br>This men exercise app at home allows you to work out on your own. Develop your own weight loss program, use our calorie tracker, create a diet plan and start working out. You can update your schedule and track results in the workout diary. Alternatively, choose a ready training program with a diet for your specific goal, such as fat loss workout, and abdominal exercises for men.<br>Want to try harder? Hire our online personal coach. You can choose your personal trainer based on budget and feedback. Get an invoice, make the payment and start your transformation. Your coach will provide you with a workout plan and a tailored diet plan, create a monthly course with a full set of exercises and meal plan to reach your goal, whether that is to lose weight in 30 days, lose belly fat, build muscle, get six-pack abs, big arms or a wide chest or get back in shape after an illness or pregnancy – all of this at home.<br>When you’re on a monthly course, your coach will monitor your results for a monthly fee, provide recommendations or on your meal plan and adjust the exercise program, if needed. You can always chat with your coach and discuss a plan that fits your schedule. We invite the best fitness coaches with extensive knowledge on all kinds of working out goals, no matter if you’re trying to lose weight fast, get six-pack abs, get big arms, get a wide back, build muscles or just get more muscle definition. We also offer many cardio exercises at home for your overall health and well-being. Want to become a fitness coach on our app? Take our test and prove your skills. Email us on coach@fitnessonline.app, or on support@fitnessonline.app in the event of technical issues.","summary":"Home routines, bodybuilding tracker. Personal trainer, coach. Exercise for women","installs":5000000,"minInstalls":5000000,"realInstalls":7125453,"score":4.7843137,"ratings":56418,"reviews":224,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$6.99 - $59.99 per item","developer":"FITNESS ONLINE LLC","developerEmail":"info@fitnessonline.app","developerWebsite":"https:\/\/fitnessonline.app","privacyPolicy":"https:\/\/fitnessonline.app\/privacypolicy.html","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/Vkr8u7qdY--dP5UnKsmw63Lgl3vRpmTpw37OCH0SSu7IOZqviEvKyma2OTQuiuVTapkW","headerImage":"https:\/\/play-lh.googleusercontent.com\/_6boqStNvSgKFFay-GDj-gNuhWZnMZaG3AhGm9V2l7ubBknfCwKDX-IyAxduibxI_A","screenshots":"['https:\/\/play-lh.googleusercontent.com\/v9INgBF0a0rmkS02KaJuoOx-NNefLSEuskec8tIe4wTd2IzAPx7G6cOZMBvhtjCFD4M', 'https:\/\/play-lh.googleusercontent.com\/zBy748OcaVm2oMMVE_R3J84j-idiR4Oh912Ah2JxErvkYGQ2f-FsUQmyoU1_FasVZ94', 'https:\/\/play-lh.googleusercontent.com\/p1oybOdlDGG-673aYre0Jzunv1eCVxYU4KB4mlVOfjYsLQxFPcVHOvKcyF2u6ths_VU', 'https:\/\/play-lh.googleusercontent.com\/biSJiSz2DW23oqHdciTpmGfTeOxYjfaIzzoc1Ln1W58D3qbp3HUS0HgI0e1W479neE4', 'https:\/\/play-lh.googleusercontent.com\/gm3SWyi674qwee46x7CWM7p2q5_kQcOdiMe2DPz3cVrt-3X7sA5VaFvZIbrmE0YWII8Y', 'https:\/\/play-lh.googleusercontent.com\/P383hs-LoobdL0CXp6aU9Ub655ZfSlYEaROh-EIPUJK9pdHuHes9TtTDh5x_ub8hrK8', 'https:\/\/play-lh.googleusercontent.com\/t_erjXVSq4LhSAwrdtw-oMPqcsjXbTDGYHykqk0chlLa72jzliLqleQ_DWbVLNMw1HE', 'https:\/\/play-lh.googleusercontent.com\/cOddqp_AJ5-ySVuSdgBXxJOuwHGlf80hW-fGb5ApW6UdOb1OcRnOj2lX8wcVOw2yQck']","contentRating":"Mature 17+","adSupported":false,"containsAds":false,"released":"Jan 26, 2018","lastUpdatedOn":"Apr 26, 2025","updated":1745661416,"comments":"[]","appId":"fitness.online.app","url":"https:\/\/play.google.com\/store\/apps\/details?id=fitness.online.app&hl=en&gl=us"},{"title":"Nike Training Club: Fitness","descriptionHTML":"Work out with the Nike Well Collective and build a life well lived. Achieve your holistic fitness goals with the support of trusted trainers, coaches, instructors and experts. From exercise motivation, home workouts, fitness tools, and more – Nike Training Club is here to support your physical and mental well-being. Guided meditations, workouts, or healthy recipes — discover wellness your way with NTC.<br><br>Move with Us.<br><br>Nike Training Club is an exercise app built with your fitness progress in mind, with free guidance from your favorite fitness trainers, athletes and experts. Cardio workout, strength training, conditioning, yoga, mindfulness and more – enjoy expert tips from Nike’s best.<br><br>Build healthy fitness habits with goal-setting tools and move in all the ways that make you feel good with the Nike Well Collective. From gym workout programs and bodyweight fitness to holistic exercise and mindset tips. Download to become a Nike Member and discover movement at every stage of your fitness journey.<br><br>Fitness, in every form:<br>• HOME WORKOUT PROGRAMS: Big Workouts for Small Spaces<br>• TOTAL-BODY FITNESS: Exercises for Arms, Shoulders, Glutes &amp; Legs<br>• YOGA: Essential Yoga Flows<br>• MINDFULNESS: Ground Yourself with Movement<br>• WELLNESS &amp; NUTRITION: Maximize Results with Holistic Fitness<br>• HIGH-INTENSITY TRAINING: Quick Workouts in 20 Minutes or Less<br>• MEDITATIONS: Practice Appreciation<br>• ABS WORKOUT: Strength Training for Abs &amp; Core<br>• ENDURANCE: Cardio Workouts for All Levels<br><br>Cardio training, full-body gym workout, or guided meditation – Members get access to new content from top fitness experts, trainers, and athletes. However, you’re feeling, wherever you’re at, we’ll be there with you.<br><br>Work out with the best in Nike Training Club. Download today.<br><br>HOME FITNESS OR GYM WORKOUT FOR EVERY BODY<br>• Workouts for everyone – Beginner workout to advanced athletic training, guided by Nike instructors, coaches and experts<br>• Cardio, strength training, HIT, yoga, and more<br>• Achieve your fitness goals with workout programs built to fit into your busy life<br>• Work out every body part – Arms, legs, abs, and more<br>• Bodyweight fitness routines that require little to no equipment<br>• Home fitness, designed for all levels – Explore workout programs for all<br><br>NUTRITION &amp; REST: MEDITATIONS, RECIPES &amp; MORE<br>• Training and guidance, beyond the physical – Exercise motivation and healthy habit tips<br>• Wellness and nutrition – The well-lived life needs fuel. Discover real stories about real food<br>• Sweat, rest and recover – Find tips to recharge and revitalize<br>• Wellness coach – Find exercise app tips for body and mind<br>• NTC TV – Find an exercise for mindfulness, discover healthy recipes, and start up guided meditations in quick, easy videos**<br>• Strength training for the mind – Guided meditations, wellness Q&amp;As and healthy cook-alongs<br><br>WORKOUTS ON DEMAND<br>• Find a workout for any level – Work out the way you want with trainer-led Video On Demand workout classes*<br>• Workout videos for all disciplines – Cardio, HIT training, yoga and more<br>• Premiere Workouts with special athlete and musical guests*<br><br>WELLNESS MOTIVATION<br>• Home fitness app meets healthy lifestyle guidance for nutrition, connection, rest, and more<br>• Access to the Nike Well Collective – Training and holistic fitness tips for guidance<br><br>Work out anywhere, anytime with the NTC exercise app and discover movement where you’re at. Gym workout or home fitness — unlock a space for wellness with the Nike community.<br><br>Download today.<br><br>ALL YOUR ACTIVITIES COUNT<br>Add every workout in the Activity tab to keep an accurate account of your fitness journey. If you use the Nike Run Club app, your runs will be automatically recorded in your activity history.<br><br>NTC works with Google Fit to sync workouts and record heart-rate data.<br>https:\/\/play.google.com\/store\/apps\/details?id=com.nike.ntc&amp;hl=en_US&amp;gl=US<br><br>*VOD (Video-On Demand) available in the US, UK, BR, JP, CN, FR, DE, RU, IT, ES, MX and KR.<br>**NTC TV available only in the US.","summary":"Elevate your health and wellness journey with NTC. Workouts, mindfulness & more.","installs":10000000,"minInstalls":10000000,"realInstalls":25949988,"score":4.4151764,"ratings":372887,"reviews":10797,"price":0,"free":true,"currency":"USD","offersIAP":false,"inAppProductPrice":null,"developer":"Nike, Inc.","developerEmail":"Nike.googleplaysupport@nike.com","developerWebsite":"https:\/\/nike.com\/ntc-app","privacyPolicy":"https:\/\/www.nike.com\/help\/a\/privacy-global","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/zgD7iittjyW1lOnGK7AoDuVfhv5nGWVseK4xVxMCOCajUHeSXontX7vGJL7l6UOd9w","headerImage":"https:\/\/play-lh.googleusercontent.com\/HIuvTQspljU8Tsn1t1fgaFIiC7sx9KV_idUC4Q_BChdz29Q6Db8t-79KulP9B5UjUHg","screenshots":"['https:\/\/play-lh.googleusercontent.com\/M624t-ED0xruv7QFMoCl68A2vHJ-6PZYNDoNAIl2lqEZMNAM3Q3x_7KyHQT_G1p9XeE', 'https:\/\/play-lh.googleusercontent.com\/UyEtQVlLc9V4rrkIATfNmbxiKlivROnjEP4UHL6vzn6AXPYEuRHXTxQfCQU7ka9lqYM', 'https:\/\/play-lh.googleusercontent.com\/th_xlNGZz9iN8B28W86getNh1t0AodhtWoHuXJkxQiRUGkRUHKGWPZ2JHkYeyFH4erc', 'https:\/\/play-lh.googleusercontent.com\/xElfANuvQUZCmx7csep0MRPwhfKlu3fHRe9VDHfk-xtS-4SVwpvNtuXk2SkXStAYw0de', 'https:\/\/play-lh.googleusercontent.com\/OqtOvmyaouAK2oat_UhGA792oJGrFhL1QWrwGFbpHf5iZ35X8AyRtPyyi1duT0DH1Q', 'https:\/\/play-lh.googleusercontent.com\/na2mWeiS4ylk8UiEIzLyIbc0WjamAANdni5jwSd7_99vgqRKFhj0HCNJgv-iI5PqoUZm', 'https:\/\/play-lh.googleusercontent.com\/LA5voeX6V7LKr5SIzICiEtKsNptOZLG-U8VkKajOc-pTh11dkRu_Gd3OQ9OqjHH9Xq2P']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"Dec 5, 2012","lastUpdatedOn":"Apr 11, 2025","updated":1744398302,"comments":"[]","appId":"com.nike.ntc","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.nike.ntc&hl=en&gl=us"},{"title":"Step Tracker - Pedometer","descriptionHTML":"The most <b><font color=\"#0076BA\">accurate &amp; simple<\/font><\/b> step tracker auto tracks your daily steps, <b><font color=\"#0076BA\">burned calories<\/font><\/b>, walking distance, duration, pace, health data, etc., and display them in intuitive graphs for easy checking.<br><br><b><font color=\"#0076BA\">Power Saving Pedometer<\/font><\/b><br>Step counter counts your daily steps with the <b>built-in sensor<\/b>, which greatly <b>saves battery<\/b>. It records steps accurately even when the screen is locked, whether your phone is in your hand, your pocket, your bag, or your armband.<br><br><b><font color=\"#0076BA\">Real-time Map Tracker<\/font><\/b><br>In GPS tracking mode, step counter tracks your fitness activity in detail (distance, pace, time, calories), and records your routes on the map <b>with GPS in real-time<\/b>. But if you don’t choose GPS tracking, it will count steps with <b>built-in sensor<\/b> to save battery.<br><br><b><font color=\"#0076BA\">100% Free &amp; 100% Private<\/font><\/b><br>No locked features. No login required. You can freely use all features without login.<br><br><b><font color=\"#0076BA\">Easy to Use Step Counter<\/font><\/b><br>It <b>auto records<\/b> your steps. Pause, resume steps counting, reset steps to count from 0 if you want. Once you pause it, background data refreshing will stop. You will get your daily steps report on time, you can also check your <b>real-time steps<\/b> in the notification bar.<br><br><b><font color=\"#0076BA\">Report Graph<\/font><\/b><br>Your walking data will be displayed in clear graphs. You can easily check your daily, weekly and monthly walking statistics. Support for syncing data with <b>Google Fit<\/b>.<br><br><b><font color=\"#0076BA\">Targets and Achievements<\/font><\/b><br>Set daily steps goal. Continuously achieve your goal will keep you motivated. You can also set targets for your fitness activity (distance, calories, duration, etc.).<br><br><b><font color=\"#0076BA\">Fashion &amp; Simple Design<\/font><\/b> <br>Designed and developed by our Google Play Best of 2018 winning team, its clean, simple, and fashion design brings excellent user experience.<br><br><b><font color=\"#0076BA\">Colorful Themes<\/font><\/b><br>More themes coming soon. Select your favorite theme for the step tracker and enjoy the step counting.<br><br><b><font color=\"#0076BA\">Health Tracker App<\/font><\/b><br>Health tracker app records your health data (weight trends, sleep conditions, water intake details, diet, etc.) and helps you maintain a healthy lifestyle. Stay active, lose weight and keep fit with activity &amp; health tracker.<br><br>More features coming soon, such as sync data with Fitbit, Samsung Health, MyFitnessPal...<br><br><b><font color=\"#0076BA\">Important Notes<\/font><\/b><br><br>* To ensure accurate step counting, make sure the information you entered on the settings page is correct.<br>* You can adjust the sensitivity level of the step tracker for more accurate step counting.<br>* Some devices may stop counting when the screen is locked due to their power saving processing.<br>* Devices with older version can’t count steps with locked screen. <br><br>Steps tracker<br>Want a steps tracker to track your daily steps? This accurate steps tracker can help you.<br><br>Steps counter<br>Steps counter helps track your daily steps, burned calories, and weight loss progress. Lose weight with steps counter.<br><br>Steps counting app<br>This steps counting app is very easy to use. Open it and start to walk, steps counting app automatically records your steps.<br><br>Pedometer step counter<br>A simple pedometer step counter auto tracks your steps. Walk with pedometer step counter, keep fit and get in better shape.<br><br>Walking app<br>Need a pedometer for walking to track your steps? This walking app is your best choice.<br><br>Walking distance tracker<br>This walking distance tracker tracks your steps and calculates distance accurately. It&#39;s a full-featured walking distance tracker. It is also good for your health.","summary":"Daily step tracker, free pedometer & map tracker to count steps and calories.","installs":10000000,"minInstalls":10000000,"realInstalls":48916342,"score":4.797199,"ratings":742247,"reviews":21449,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$1.49 - $39.99 per item","developer":"Leap Fitness Group","developerEmail":"support@leap.app","developerWebsite":"https:\/\/z.leap.app","privacyPolicy":"https:\/\/leap.app\/privacypolicy.html?pkg=steptracker.healthandfitness.walkingtracker.pedometer","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/HiLHRHP_MOb9XZrGA-mTliTEqfKR1s-JHIjgZISEB0nZtBwGSUjTXQo7Dx5XeHxbSAY","headerImage":"https:\/\/play-lh.googleusercontent.com\/pwgscupuRWRZqw-scdh46sUeYfkTi63Mkp5l5otZNbynYjMDVZi1pxmaXKlTSdFIHrkc","screenshots":"['https:\/\/play-lh.googleusercontent.com\/N_JOSD327FPfBUYW9fPwKBkpygJeA7kNZOvWAVc6Yti6cuPUnP0vB8cvlpViCdVhjw', 'https:\/\/play-lh.googleusercontent.com\/9oHWz3FunnGuuInrz9C6fYe0ClZXSc-87-tKgxZQxFm4ub13Eb8HJpNpe14sr93zHCE', 'https:\/\/play-lh.googleusercontent.com\/BEwqCWfTkLPFuBBVEnogtPpF7cumAKGf1KFzszMHDWH5ScOFGQr6kFgCMQ9Oi8t9eg', 'https:\/\/play-lh.googleusercontent.com\/9zEbesMi1oucNWOTJg1PejcUTqsh4Go_PMkbt8_zZVdVWXBb9LDcmcEsRnL_cqaC8z4', 'https:\/\/play-lh.googleusercontent.com\/BRXz9S8c5kKDkcvqJgv5OLvz5TC9E0tdTx7zzgLNes4dAgTbqD4EO6LZqvlIPp04k1U', 'https:\/\/play-lh.googleusercontent.com\/12LgwmRIVK_4ylwEvMyDo3fFG_kzehzVahdpEcDm0xE577Hf8A_ZBGMpcYPVxDbeiA', 'https:\/\/play-lh.googleusercontent.com\/aicNWEbJZSlt7qesA-TEri_YmsIUUn9xsjb4VbMJgwqQ25cy6-SyYe1RKzgieLQl08Q3', 'https:\/\/play-lh.googleusercontent.com\/XtgQJQrIsnpENDhl9mvJ0q1o7O3essmQ9s7CeuPQBC12AA31g5yb4RMtWdvcsCQxfGM']","contentRating":"Everyone","adSupported":true,"containsAds":true,"released":"Aug 15, 2019","lastUpdatedOn":"Mar 4, 2025","updated":1741087103,"comments":"[]","appId":"steptracker.healthandfitness.walkingtracker.pedometer","url":"https:\/\/play.google.com\/store\/apps\/details?id=steptracker.healthandfitness.walkingtracker.pedometer&hl=en&gl=us"},{"title":"Finch: Self-Care Pet","descriptionHTML":"Meet your new self-care best friend! Finch is a self-care pet app that helps you feel prepared and positive, one day at a time. Take care of your pet by taking care of yourself! Choose from a wide variety of daily self-care exercises personalized for you.<br><br>BEST DAILY SELF-CARE TRACKER ✨<br>Is self-care a chore? Struggling with habits, self-love, or depression? Self-care finally feels rewarding, lightweight, and fun with Finch. Complete quick self-care exercises to grow your pet, earn rewards, and improve mental health! People who struggle with mood journaling, habits, and depression found it easier to be mindful with their self-care pet in Finch!<br><br>EASY DAILY CHECK INS ✏️<br>• Start mornings with quick mood checks and energize your pet to go exploring! Choose from various mindful habits from goal tracking and mood journaling to mindful breathing exercises and quizzes!<br>• End days in moments of gratitude with your self-care pet where they&#39;ll return from adventures to share stories with you! Recognize positive moments and grow your self-love.<br><br>MINDFUL HABITS 🧘🏻<br>Finch is the fun self-care tracker to hit goals and sustain healthy habits! Build mental resilience against stress, anxiety, and depression. Strengthen your mental health by increasing self-love and gratitude. <br><br>• Habit Tracker: set goals and celebrate wins for healthy habits.<br>• Mood Journal: guided mood journal to clear the mind, track important moments, and practice self-love.<br>• Breathing: guided breathing to calm nerves, increase focus, energize your mind, and sleep better.<br>• Quizzes: understand your mental health with quizzes for anxiety, depression, body image appreciation, and more.<br>• Mood Tracker: quick mood checks with mood trends to understand what has been lifting you up or bringing you down.<br>• Quotes: motivational quotes to lift your mood and gain new perspective.<br>• Insights: get insights on your mental health from combined analytics on your mood journaling, tags, goal tracker, and quizzes.<br><br>SAY HI 👋🏼<br>• TikTok: https:\/\/www.tiktok.com\/@finchcare<br>• Discord: https:\/\/discord.gg\/finchfam<br>• Instagram: https:\/\/www.instagram.com\/finchcare\/<br>• Facebook: https:\/\/facebook.com\/groups\/finchfam<br>• Email: support@befinch.com","summary":"Mood journal, habits, self-care tracker, self-love","installs":5000000,"minInstalls":5000000,"realInstalls":9711768,"score":4.9291453,"ratings":388537,"reviews":41159,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$1.99 - $399.99 per item","developer":"Finch Care Public Benefit Corporation","developerEmail":"support@befinch.com","developerWebsite":"https:\/\/finchcare.com\/","privacyPolicy":"https:\/\/finchcare.com\/privacy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/eBs3UdttH20tMfShlphboX5kbIUZ5rcKWOQcGSE-SxzaL1VH1bQsBSw6W3LD2uKQpT4","headerImage":"https:\/\/play-lh.googleusercontent.com\/-bvaVJUjYaXOF1vfiE2mJrKkaM396M8Ohj-KtMopC5sBJ8yh_XpcYmaU8KGN0qd96SA","screenshots":"['https:\/\/play-lh.googleusercontent.com\/W2SCXd94EmoxvcMAyT-MvhdcgtsEO7F4txrrj8K7hp37y1rREJJXbaxfTsymqdsF-jQ', 'https:\/\/play-lh.googleusercontent.com\/Y7_zY28EIXFoxDeBqKpyVSrkmxW681W8Gc0NjKk7Dn8FHgJ3m08pPmrcfGy_RWU1Gfg', 'https:\/\/play-lh.googleusercontent.com\/re3ohh-iw3d7X8Fc2HnUeCBbrdYlFzsrMfemezL2vD_hJk6NJouAlqJ7F6oj5cf0Fqo', 'https:\/\/play-lh.googleusercontent.com\/QnxsLCpoGBsw29_Mx5hLP64jNeovXO_oeBpNjJBYjUxL3eT81JOoRyxH2ptcHn9A_w', 'https:\/\/play-lh.googleusercontent.com\/AYTN6b7oY7NvfQrEISIyd2cb0KUTYd_epK6RgFRQwUbr_opOpxKeJs-oIzrW5ytGCxw', 'https:\/\/play-lh.googleusercontent.com\/28dJzyIJo0uPHhsGyC-aLotkzh_rEdfEYnOpjnw7cFs-Ksc0bdbYbUhwDMxgOga3IWU', 'https:\/\/play-lh.googleusercontent.com\/k0AK_LowfLVd-1XBa_M-GpagUnh9UqH2MyQ04ABaZrPMOdJqPCFqJ0BPObvrRiHWjPri', 'https:\/\/play-lh.googleusercontent.com\/C1-ZdGCk1co1OYQxFlghHwgmU1zRhFBbx9Lw63EqT_ZUGzaFJilG1zuY6ILgJdppst4A', 'https:\/\/play-lh.googleusercontent.com\/k6rRKExzzE5sC047-YCkRibzUY__gLSTK_yIg201MYKDX7yDENYXKagGL-CCnQ6j9Q', 'https:\/\/play-lh.googleusercontent.com\/foNHQmZGILolV7Bl4oFxGLjJefC_iyz9UE5Wg5I0BfR7U-YxA2lAyM_pPEMojSo2XW4', 'https:\/\/play-lh.googleusercontent.com\/HNBgy-1XC8V78L_QY4kaVf1ZtRY1lFRi4ZjolE3lDvumjUsY_RcBb_Fvq0RqcfxRp2zz', 'https:\/\/play-lh.googleusercontent.com\/w0ykAVrYmIbNQSILBlYqVfc33bZLVW1UdK_Gt9MFCkQBleRi3xceQ9mNJwwKF55gtKY', 'https:\/\/play-lh.googleusercontent.com\/KLN2dG8nXHrGwUXnSANQVwT23IlnlsQ_70OB3QkPcA26xzsZyjJQB_8s0cCbDNoIbAUR', 'https:\/\/play-lh.googleusercontent.com\/F1yDhPP8nBJu7kvHUsvhedA5Ypkt9o4_a2_YhOhSdseeMd1lJJay2tfdFf2o6qwr-ELW', 'https:\/\/play-lh.googleusercontent.com\/FMsAC9ob7E-RcfUpZkWI4aSItKaZjDqAcH3YlJB_AX97gnZ2dSP5u21_puLnVguUEqkk', 'https:\/\/play-lh.googleusercontent.com\/BsKuWaG1ih931cT4hsM8OzzngiDgApCIsLIj9TJXvgsFeKkubinEqtpUO0Zem6Tk2iw', 'https:\/\/play-lh.googleusercontent.com\/JOedpmZ3C1BgDAgNusr5HRmfytyqhLkEa7jX3MbnWioPzQoEmSaEJydYdAzPKKlIyCg', 'https:\/\/play-lh.googleusercontent.com\/Ij4tkKJpaXFNSWD6uL_ZrAM8ivfKWAVC2DO6-VCFUtQCs7U2i4URGfTkV4YgnYMTz-o', 'https:\/\/play-lh.googleusercontent.com\/nRyCns3fANFwpDjG5LejLnyOHjsPCRsC_Jk1_tBqazqOopMb5Og5tpUaZ06ABCZ2tEM', 'https:\/\/play-lh.googleusercontent.com\/Kkxcm4p70pQfZ0t_wy5CLnzIcWrtd0tuErvjOdyIC273O-ou2gJgwfc8xOAGcO0GZes', 'https:\/\/play-lh.googleusercontent.com\/1wNR_6imX_ggmWmUR_UdFTTR7V83GoBG80ozLGU6LOnRJ_3g0vZuUuoGbzrplxzb9u8', 'https:\/\/play-lh.googleusercontent.com\/-uBGLqnGuFTr26Qtd21rqCJ-oA9zyXF1AvrQ3r0TKmTT_JzGJDXM1drAViQJ98OxIKI', 'https:\/\/play-lh.googleusercontent.com\/qCfiDEFpugz5bJzvgCXDBuE9FRMxRjePFo-qFfiG6hQYJGXnb87yEXVIWgct1Pfv-Kc', 'https:\/\/play-lh.googleusercontent.com\/YN21_OEUaw9ifRrK_GdWUFcXnSmxeawjJp88_zFZPCPtPna1hiwiC6vJyhMTJ_8JuA']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"May 11, 2021","lastUpdatedOn":"Apr 28, 2025","updated":1745902142,"comments":"[]","appId":"com.finch.finch","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.finch.finch&hl=en&gl=us"},{"title":"Muscle Booster – Plan Workouts","descriptionHTML":"Muscle Booster is a workout app designed for both men and women who want to build muscle, stay healthy and feel great.  Our Workout Planner serves as a personal trainer substitute, assisting you in achieving improved physical fitness, whether you&#39;re at home or in the gym.  <br><br>From muscle building gym workout plans to calisthenics exercises and weight loss, Muscle Booster creates a personalized workout plan based on your goals and personal data.  So whether you work out at home or at the gym, Muscle Booster&#39;s smart training algorithm will guide you through your sets, rep ranges and rest intervals to help you achieve your training goals and reach your personal milestones more efficiently.<br><br>WHY WORKOUT WITH MUSCLE BOOSTER?<br><br>1)  Gain access to a library of 1000+ workouts, tailored to both men and women for muscle gain, weight loss, recovery and more, both at home or at the gym. <br>2)  Use Workout Player for audio exercise tips, instructions, information on muscles being used and a workout \/ rest timer (workout controls available via Apple Watch)<br>3)  Join Challenges based on your onboarding information – from Morning Routines, Calisthenics, Fat Burning, Chair Workouts and Dumbbells to 6-Pack and Injury Recovery.<br>4)  Create plans based on the equipment available to you - from free weights to machines, bands and bodyweight stations<br>5)  Each workout plan offers a completion time and number of calories you are likely to burn<br>6)  Every time you complete a workout, Muscle Booster will display which muscles you should use next and which need to recover <br>7)  Achieve Mini Milestones to stay motivated and feel the positive effects from training <br><br>HOW DOES WORKOUT PLANNER WORK? <br><br>-    Set your fitness goals - weight loss, muscle gain, strength gain, flexibility or injury recovery<br>-    Select your target zone - arms, core, abs, pecs, stomach, legs, chest, shoulders or full-body<br>-   Enter your personal data - age, gender, height, weight and fitness level<br>-   Set your desired workout location – gym or home<br>-   Choose which days and what times suit you to workout<br>-   Select the equipment available<br>-   Enter any health or training restrictions, from injuries to cardiovascular disease <br>-   Add personal reminders to ensure you never miss an opportunity to workout  <br>-   Take an AI test to measure your fitness level<br>-   Receive a personalized workout plan<br><br>Muscle Booster is the ultimate choice for home and gym workouts. Take on the challenge, lose weight, build muscle and strength, and change your life with your personalized gym workout planner. <br><br>Download the Muscle Booster app to boost your energy and health with effective workouts.<br><br>SUBSCRIPTION INFO<br>You can download the app for free and use limited functionality without payment. If you’d like to have a full experience with the app, you will need a subscription.<br><br>In addition to the purchased subscription, we may offer you add-on items (e.g. fitness guides, VIP customer support service) for an additional fee, either one-off or recurrent. This purchase is optional: your subscription is not conditional on such a purchase. All such offers will be displayed in the app.<br><br>Muscle Booster Terms of Use: https:\/\/legal.muscle-booster.io\/page\/terms-of-use<br>Muscle Booster Privacy Notice: https:\/\/legal.muscle-booster.io\/page\/privacy-policy","summary":"Create workout plans for the gym or home with our customizable workout planner","installs":10000000,"minInstalls":10000000,"realInstalls":49327371,"score":4.5501013,"ratings":238093,"reviews":7177,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$2.99 - $129.99 per item","developer":"WELLTECH APPS LIMITED","developerEmail":"adam.support@muscle-booster.io","developerWebsite":"https:\/\/musclebooster.welltech.com\/","privacyPolicy":"https:\/\/legal.muscle-booster.io\/page\/privacy-policy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/C1Pacj8P-zQZ-1i7bdtQi3mx4dzOHny92iFYAutGKm5lBIG4QSgWta3Y-Fg9xY2Vz-g","headerImage":"https:\/\/play-lh.googleusercontent.com\/g7By1gXUWdhFOs6jK4_GyR65RPfHtnHtBt6BO7TQGQXEoSaWG7x0i9XuCbWRppNcEg","screenshots":"['https:\/\/play-lh.googleusercontent.com\/spsLcqzjjTbwF1nm1k93vVUCl9LYZeBAL3XLqvuRPBvWzhfk3o1p-ferT1DX2XjI3w', 'https:\/\/play-lh.googleusercontent.com\/ECWOpZ5luNgKFL07FzqXCzdr8Rar7YO7HbTHL_zjqQcf60cvIYI3Ztw5x5jQfgetlJPr', 'https:\/\/play-lh.googleusercontent.com\/dKg80z_neMPy1AQm9KGZlofGnTmOLRuwR30JN4T4-9jOGvB7Tjg-xIXt-b8kegqGl3O5', 'https:\/\/play-lh.googleusercontent.com\/ijOxs8zVtdc1_HI_799PyIV7ZUwRc5zTIoZ1XPXk7DCsfroudtGT7COXK6p-Y6BFxe0', 'https:\/\/play-lh.googleusercontent.com\/dF_VeONFR1FNl3EUQPosfHnTYp1e9HUh_Tf_Yi-NAjFkMHt8A6JJqt028UOlG0Njlhke', 'https:\/\/play-lh.googleusercontent.com\/klG9wnSE8LGujgrbdq9VA-qbT4g6DIFnHRhBXb-uPNn19QU2tCM10tZ25UKpt6f4hfQ', 'https:\/\/play-lh.googleusercontent.com\/XSipPy606wvPwz7At-4R0-AElkP4mA7J-mJI6P1BYgThu03A80VMkcO6Jkq1bnARNw', 'https:\/\/play-lh.googleusercontent.com\/zUAvDY7ftl4IpNjdhwLqTklIJx-MBHEVX2YKLOXEqnpLV1QGZlwSfYYRVvMSthS5Xow', 'https:\/\/play-lh.googleusercontent.com\/DtSH75IVdw-scAmlUoEcolM6v9ueZfgTzDkyvJHvEuJ0zYJ3u8fGmPSmqAfas3O149Y', 'https:\/\/play-lh.googleusercontent.com\/fjC5LpjDAAPqLjEdSnczn-TlGgkqaq3-0n-SO69cPpwh-DncWSWR7L1OwfxV2w4w6Q', 'https:\/\/play-lh.googleusercontent.com\/67zElRpNY8SbWCDdtqfZHOg5OLsgQW2teTuxoAeBV9xJLiybBC08uNXxmCAO6SyNCJA', 'https:\/\/play-lh.googleusercontent.com\/mCsjJBSrt0x6kn60BLeFrAxQytum_OpkmGKqVz8qvlE4TK7Lm0YEyM-GzRfsWoHfyYU', 'https:\/\/play-lh.googleusercontent.com\/s7Fmn61AAk0v9eGxQGdDm2KlS60xevGMTYfsWIgi7THB0ccg-2a-32Cr1dIZenh7vuc', 'https:\/\/play-lh.googleusercontent.com\/YgIFzmbvCwh4yYQw09pOBKUCx8kzDq5-GhSp2xoFvznpC_qFrF8tR1_3Kp0xJv8DRZSb', 'https:\/\/play-lh.googleusercontent.com\/qUsHGMb60hGKRaZ4lg0XC9_xdDAQgaAcNWojkk4eM2OEBB_OSqZuospVZD4qRMTEqGQ', 'https:\/\/play-lh.googleusercontent.com\/EhDOUMobz31VyalkGNIBls9etcAMGdIQ8_17SYIRqlx6pgvYEPPv-TyVkxMPKPHjOCw', 'https:\/\/play-lh.googleusercontent.com\/2BuCPjxVogDDrKDgUGq7naOHRnmkS_CHz9XGttWsjj7nATGw-cy6OHKFCy6veZUDkpY', 'https:\/\/play-lh.googleusercontent.com\/dGUNtALMPiuPydltEaeWYF4rHjgjVuNSJhpavRhLOQzRvKlDd9oiCIldID0FYpsKag', 'https:\/\/play-lh.googleusercontent.com\/OzGVA2hokrZIF4AaTXXxI6czyxVXojzkBxKMHTGixZ0TQ6WFmL52v1lqRJaHNjr-Mw4', 'https:\/\/play-lh.googleusercontent.com\/tsQzXlKxIdi6Xpwzf1lWMsTVZ8GNnI67XDld9zWUmT-6bgqo2J7VvKPm90zR4CgflRFm', 'https:\/\/play-lh.googleusercontent.com\/i0RzrjKIz1qFi5Rk_sRqAkhw38vDcHB6Ni93vubSVXCpHOb-mhXdVRnqSdaFAl2AoYc']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"Nov 27, 2019","lastUpdatedOn":"Apr 28, 2025","updated":1745827644,"comments":"[]","appId":"musclebooster.workout.home.gym.abs.loseweight","url":"https:\/\/play.google.com\/store\/apps\/details?id=musclebooster.workout.home.gym.abs.loseweight&hl=en&gl=us"},{"title":"Virtuagym: Fitness & Workouts","descriptionHTML":"Looking to lose weight, build muscle, enhance flexibility, or reduce stress? Virtuagym Fitness supports your journey at home, outdoors or in the gym. Designed for beginners and enthusiasts, our AI Coach creates personalized plans from over 5,000 3D exercises. Stream video workouts like HIIT, cardio, and yoga to your TV, and begin with ease.<br> <br>PERSONALIZED WORKOUTS BY AI COACH<br>Embrace the power of customized fitness with AI Coach. Our library of over 5,000 3D exercises caters to diverse needs, from quick, equipment-free routines to targeted strength and weight loss workouts. Whether you&#39;re a beginner or an enthusiast, our app ensures your workout  is tailored just for you.<br><br>WORK OUT ANYTIME, ANYWHERE <br>Your living room, your fitness studio. Our video library offers HIIT, Cardio, Strength Training, Pilates, and Yoga. Stream directly to your TV or mobile device anywhere.<br><br>VISUALIZE PROGRESS, ACHIEVE MORE <br>Track your fitness journey with our Progress Tracker. Monitor calories burned, exercise duration, distance, and more. Integrated with Neo Health scales and wearables, track your health comprehensively.<br><br>EFFECTIVE WORKOUTS FOR EVERYONE<br>Enjoy safe, effective exercise routines with our 3D-animated personal trainer. Get detailed instructions for every fitness level.<br><br>EFFORTLESS FITNESS PLANNING<br>Easily plan and manage your fitness activities with our calendar. Schedule workouts, track your heart rate, and log progress, keeping your fitness routine organized and focused.<br><br>COMPLEMENTARY FOOD APP<br>Explore our food database and track nutrition tailored to your diet. Whether it’s high-protein or low-carb, get a holistic view of your eating habits for a healthier you.<br><br>HABIT TRACKER<br>Track daily routines with our simple habit tracker. Maintain consistency with streaks and stay on top of your goals. Ideal for cultivating healthy habits and achieving personal growth.<br><br>MINDFULNESS FOR A BALANCED LIFE<br>Integrate mindfulness and meditation into your life with our audio and video sessions. These practices are key for anyone looking to reduce stress and find mental balance, perfectly complementing your physical health efforts.<br><br>FULL APP EXPERIENCE <br>Subscribe to PRO membership to access all the PRO features and content. Your subscription will automatically renew, and your account will be charged for the same amount as your current subscription fee 24 hours prior to the end of the current period, unless auto-renew is disabled at least 24 hours before. Manage or turn off auto-renewal in your Account Settings after purchase.<br><br>Terms of Use: <br>https:\/\/support.virtuagym.com\/s\/terms-of-use","summary":"Home & gym workouts for you, Video library. Track progress effortlessly!","installs":5000000,"minInstalls":5000000,"realInstalls":7609529,"score":4.629139,"ratings":78677,"reviews":2228,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$6.99 - $59.99 per item","developer":"Virtuagym","developerEmail":"support@virtuagym.com","developerWebsite":"http:\/\/www.virtuagym.com","privacyPolicy":"http:\/\/virtuagym.com\/virtuagym-privacy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/Unydwqk0CAmkpKS8fOaLaLPopnJuXosz6kWHlvXfy6Lmj3tpRH6DopjPj95T4vCat_I","headerImage":"https:\/\/play-lh.googleusercontent.com\/wEtzouhOYY4SaV84vrCA5idy1ClLOQzgBijmJfSTpa3DGqj5WKLXCUz-PtbsKJIELg","screenshots":"['https:\/\/play-lh.googleusercontent.com\/Q1U2dk9RA7VMljVd9bmdJppWKpZwYl8O_m2AlKRN7eiTatBgraQtXjtyN9Vbw7smxvo', 'https:\/\/play-lh.googleusercontent.com\/wky62PqM-2K5e8627284FdMT6S-mySakIZ5MG8dRNUnLL0mqCyr6chdcCvGD8P_Y0J0', 'https:\/\/play-lh.googleusercontent.com\/t3-73KT092u2YpsTqHTlz-26TIn26Zhdf4Gw31pSyQvpmUsrPkyuGw-CU5XH_kFF_A', 'https:\/\/play-lh.googleusercontent.com\/cZjKU5nRf_os4sZAtdFCEXifPr4L2yDUB_TCcOVhJ8HXVzWeZ3OUdzyL9t6lbPprtQ', 'https:\/\/play-lh.googleusercontent.com\/kEwGQ7Hh51uN_Ty51yE76mg7ZQkexTCv8uPv5mMvUmi7njCBcaH9peeLEPhMwsq6Iv4', 'https:\/\/play-lh.googleusercontent.com\/6zI9Q9Le6VX1Aj3HT8c0usw4LKEdqhQ-To3ga6Ob77lTpILeCTA987NA_Veq_lNntf8', 'https:\/\/play-lh.googleusercontent.com\/muzOgn1h87m7oY06vNgs_DDl1-YEPpl5ousOjosgimPZYDQXLulbsoi_-6QE53sAoII']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"Mar 17, 2010","lastUpdatedOn":"Apr 29, 2025","updated":1745950590,"comments":"[]","appId":"digifit.virtuagym.client.android","url":"https:\/\/play.google.com\/store\/apps\/details?id=digifit.virtuagym.client.android&hl=en&gl=us"},{"title":"JEFIT Gym Workout Plan Tracker","descriptionHTML":"JEFIT: The Ultimate Workout App &amp; Gym Workout Planner  <br><br>Achieve your fitness goals with JEFIT, the all-in-one workout app designed to help you plan, track, and optimize every gym workout. Whether you&#39;re a beginner or a seasoned athlete, JEFIT provides personalized workout plans, an extensive exercise library, and powerful workout tracking to keep you on track.  <br><br>The Top Workout App to Track &amp; Plan Your Gym Workouts  <br>- Workout Tracker: Log sets, reps, and weights seamlessly for efficient gym sessions.  <br>- Custom Workout Planner: Create your own plan or choose from thousands of gym workout routines tailored to your fitness level.  <br>- One-Tap Workouts: Generate plans by muscle group or available time in seconds.  <br>- Progress Monitoring: Track strength gains and optimize your workout plan for the best results.  <br><br>Extensive Exercise Library &amp; Pre-Built Workout Plans  <br>- 1,500+ Exercises: Find the best exercises for weightlifting, strength training, and cardio workouts.  <br>- 850+ Routines: Choose a pre-made gym workout plan that fits your goals.  <br>- HD Video Guides: Learn proper form with instructional videos for each exercise.  <br>- Home &amp; Gym Workouts: Adapt routines for any setting—gym, home, or on the go.  <br><br>Seamless Wear OS Integration  <br>- Hands-Free Workout Logging: Track gym workouts directly from your smartwatch.  <br>- Instant Workout Start: Search exercises, log sets, and sync all data effortlessly.  <br>- Weight Unit Flexibility: Switch between pounds and kilograms to match your preference.  <br><br>Join the JEFIT Fitness Community  <br>- 12M+ Users: Stay motivated with a global community of fitness enthusiasts.  <br>- Social Progress Sharing: Log and share your gym workouts with friends.  <br>- Strength &amp; Fitness Challenges: Push yourself with community challenges.  <br>- Personal Trainer Support: Connect with trainers and access expert guidance.  <br><br>Why JEFIT Stands Out<br>- Versatile Training: Adapt plans for powerlifting, HIIT, bodyweight exercises, or cardio.  <br>- Data-Driven Results: Turn workout stats into actionable goals with analytics.  <br>- Community Support: Learn from trainers and share achievements with millions.  <br><br>New Features:  <br>- Sync with Apple Health and Strava for an all-in-one fitness tracking experience.  <br>- Advanced workout analytics to measure progress and optimize training.  <br><br>Download JEFIT now – The Number One Workout App and Gym Workout Planner. Start planning and tracking your gym workouts today for better results.  <br><br>Ideal For: Gym enthusiasts, beginners, bodybuilders, athletes, and anyone focused on strength, fat loss, or endurance.  <br>Your Gym. Your Plan. Your Progress.<br><br>Website: www.jefit.com  <br>Instagram: @jefitapp  <br>Reddit: www.reddit.com\/r\/jefit\/  <br>Support: support@jefit.com","summary":"Build muscle with JEFIT: Gym workout app with plan\/track\/sync tools. Free!","installs":5000000,"minInstalls":5000000,"realInstalls":9571693,"score":4.352848,"ratings":87058,"reviews":11357,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$0.99 - $359.99 per item","developer":"Jefit Inc.","developerEmail":"support@jefit.com","developerWebsite":"https:\/\/www.jefit.com","privacyPolicy":"https:\/\/www.jefit.com\/privacy-policy\/","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/B7RnrJqJUvoSprrXJgTB9uGv2t5jV4HEKhQLAGKwo0uBIfCWCZhVEld5uK5_TrHGG-4","headerImage":"https:\/\/play-lh.googleusercontent.com\/DQYsUUHOMD0c7VvDzVOR672Bi0Ly28OZnQmjketWYrdLsApVimvqR-QMaC0oSuvmwQo","screenshots":"['https:\/\/play-lh.googleusercontent.com\/ZXzjbzHu797o4VssTw2gv-2YQhc_uto2bPbZ__AZ0Fr6BXYOVd11-o0rr6D5K1h93iw', 'https:\/\/play-lh.googleusercontent.com\/Hl71bKq-8zFBWz5IjFiiFxIy8sN1gCZstGKrYzjsxzcWuE9_wXkcxN5GEsoziElhreqY', 'https:\/\/play-lh.googleusercontent.com\/-lb-2nusqQCokTYSLNmhhJEqQV958TonX1R8m_U-al-sLveU4_uQbRbvALP2wh7u5rpi', 'https:\/\/play-lh.googleusercontent.com\/PwOnOfdqcwdp7eY_v2g7E37l_UJ8GAVFJBUIoXD0IqbTij6fegoAgoEyYDiV7PO9Sj4', 'https:\/\/play-lh.googleusercontent.com\/T1QVMB84-17H7U98q4E1UUCrA9j0Oa7Jkkx5uMk5tMKaCAzrzqu3qfdwglFJcGx40Q', 'https:\/\/play-lh.googleusercontent.com\/CS6g2pdMyw3XpXK5sUm-UJwMRRBsCbIKLFCzdXmFcftfTl3qChhJXfKpr-XcFBZn-qA', 'https:\/\/play-lh.googleusercontent.com\/YFtt0cujw6H9aBG4sazM8ure4OCV7wsqM5GHNoXo_qBUvAuRht5p-1Ty34KQ6Sl4Wbc', 'https:\/\/play-lh.googleusercontent.com\/fAr-xhglqbbhgf2e8vhebHWQc7NFUu2di1K9rstA4I7kgAZejZv6oAp1-KtULvtf9vs', 'https:\/\/play-lh.googleusercontent.com\/e5kghvB0VVlGIiFsQuAwwSmGuvp8dKbNsETQYpItPbBf7L-_Lvey50BmibAECdXPNFE', 'https:\/\/play-lh.googleusercontent.com\/6wZ1OaSKECkmtrw50eFnI79oxoGduSrrRAyJmWM4fprDCwBNlYPCo_NCKJCOXX7_yZU', 'https:\/\/play-lh.googleusercontent.com\/TA_OBP9RVcF0M763U_TW-GWdPNN8tbHW-ESDy2alJYVmvjj2uIvle5jw3rtnb9_o_ss', 'https:\/\/play-lh.googleusercontent.com\/GR2kqB7eokg6kfHgkpyBoE9PeKegeDzIPHzJScAhv7y5TX-bdcI_nYUxuEZ6WD-2dg', 'https:\/\/play-lh.googleusercontent.com\/VZQ6jesrlHDztS4bE3-5wsRb7yhlYOItV4l7RS7HVVmVMqAlCSlRKVPGLdumrnzSAtR0']","contentRating":"Teen","adSupported":false,"containsAds":false,"released":"Sep 15, 2010","lastUpdatedOn":"Apr 25, 2025","updated":1745613272,"comments":"[]","appId":"je.fit","url":"https:\/\/play.google.com\/store\/apps\/details?id=je.fit&hl=en&gl=us"},{"title":"Noom: Weight Loss & Health","descriptionHTML":"HOW NOOM WORKS<br><br>Psychology: Our curriculum uses evidence-based approaches and scientifically-proven principles such as cognitive behavioral therapy (CBT) to help people with mindfulness, weight loss, and building healthy sustainable habits that last a lifetime.<br><br>Technology: We’re constantly innovating and fine-tuning our platform to ensure our users—we like to call them Noomers—have access to the most effective healthcare, nutrition, and coaching tools in the market that match their lifestyles.<br><br>Human Coaching: Noomers can opt to be matched with one of our thousands of trained fitness and nutrition coaches, who help guide them along their weight loss and mindfulness journeys while providing the support needed to achieve their goals.<br><br>NOOM WEIGHT<br>Discover weight loss techniques that work for you and keep the weight off for the long run. We’ll help you better understand your relationship with food, nutrition and calories, how to be more mindful of your lifestyle habits, and give you the knowledge and support for healthy, long-lasting lifestyle changes.<br><br>FEATURES<br>- Personalized tips, weekly insights from coaches, feedback on your food choices and more—all designed to help you reach your health, fitness and weight loss goals.<br>- 10-minute daily lessons that help you develop healthy habits.<br>- - Enhanced AI food logging featuring a diverse food database with over 1 million scannable barcodes.<br>- Health-tracking tools like weight logging, water and calorie tracking, and step counting.<br>- Noom Move, featuring over 1,000 on-demand fitness, meditation, and stretching classes.<br>- Hundreds of healthy, simple low-calorie recipes that don’t require you to restrict your diet.<br><br>NOOM MOOD<br>Manage daily stress, anxious thoughts, and practice mindfulness. We’ll guide you, step by step, to mental wellness—and help you gain the emotional awareness<br>to live your happiest life.<br><br>Ready to join millions of other Noomers and take control of your health? Sign up for Noom today, and find the motivation to change your lifestyle—and make it last.<br><br>For CCPA: &quot;Do Not Sell&quot; Policy for California Residents, please see https:\/\/www.noom.com\/ccpa-do-not-sell\/","summary":"Looking to take control of your health? Our psychology-based programs can help.","installs":10000000,"minInstalls":10000000,"realInstalls":22423404,"score":4.1721206,"ratings":313949,"reviews":88546,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$0.99 - $199.00 per item","developer":"Noom, Inc.","developerEmail":"support@noom.com","developerWebsite":"http:\/\/www.noom.com","privacyPolicy":"https:\/\/www.noom.com\/terms-and-conditions-of-use\/noom-privacy-policy\/","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/1N-ub7jErxCHtSIanMlAbQcALjjHePAoE5BW3UETji87V_5PZb1El9g-OuL-_NNmSw","headerImage":"https:\/\/play-lh.googleusercontent.com\/1R1yXfm8WCeRwxk-MFZnNwKvMwjgg60HltMHHd6oWQA0bHuB0PizBsCLeepcuIh-bQ","screenshots":"['https:\/\/play-lh.googleusercontent.com\/Hl0MKxwNUELsqqljM2Z3ad83Wel1uYqQysJ8OHk9AZQjKIaw4lexNd2gbZZwoDY9iWc', 'https:\/\/play-lh.googleusercontent.com\/pUeK7nYVteYrpaucmhk3q7tMfI8P0RMd9Bj3taI2XFDciHGPBXALDbznngfjyyUxiw', 'https:\/\/play-lh.googleusercontent.com\/968TjFeW8psfeX-8ErXs99mttcBcW6JJsNqZUWYkxTsp8O_X5xaPKZvqkoU41wDpbxY', 'https:\/\/play-lh.googleusercontent.com\/8uySy_59DZKuOpXGXI-9FWdpfYWrm6T8O7vS3HuvJj2WXKtbFt0OowayTqiYOzsl78oW', 'https:\/\/play-lh.googleusercontent.com\/3oNf1t8kFJaj5aVuArFjLxuhVOHT1dmQfaRkISCPU5VU_w4EtT6Sm7UGNQaFEXieeAM', 'https:\/\/play-lh.googleusercontent.com\/fXm5azzX__ne_c_aHsTpy-xDOr71-DF6r_wKR4bNmNlsWFTCsg6y0nL6g6KKBVd2-gE', 'https:\/\/play-lh.googleusercontent.com\/MpVAceGvMLkXR1wGJdsv1EptqQim652fig7D144tc6-qlS0JOj5qJJrZIjCdtOuCbw', 'https:\/\/play-lh.googleusercontent.com\/P4jX_9LjUL-FveD0I5ZpeDTKiwovJR0ZUUb5KfR2ufBo2UWEQYAl5uOdFQs5Am9hSA35', 'https:\/\/play-lh.googleusercontent.com\/GA6M8ck7wBLdASda5Rp-Cj46Jyp-FCVv19f0sW5iiHv9NplMXLSoFI-ztFSm2lVHkUA', 'https:\/\/play-lh.googleusercontent.com\/r6SLVz9Z9EOCWB9kQZRaK9h5zaoJKvnzHopZSKWkzwWvUy3xf0m2dW4m73xluf_kKrc', 'https:\/\/play-lh.googleusercontent.com\/4FU47ojFEo8ixuaZNF9_7k_0oEzbJSPxazhBPrw0_7nmbU_gT9VZYjjhM2haX8vr3yo', 'https:\/\/play-lh.googleusercontent.com\/wroC6hSr3KUvtDYpyk1n7oz6XkkM5-Gz0l__-SNA_C6EyRNVN1UftS7MTpjEQyj58ac', 'https:\/\/play-lh.googleusercontent.com\/0AGvzbzHgHKcX74SiKYmVI3Z3Qlk8uugEjiUZUOavlmaWtCHJGoBGGrsF7oMTKVkAoE', 'https:\/\/play-lh.googleusercontent.com\/QldsX0alj_kENwtz_j69T1pDwODr3YlQlnxqIduSPdqEKmUnb979Olm1wbbeYSV5_i0', 'https:\/\/play-lh.googleusercontent.com\/k264nKT0YrMqNhV-hccfCDRpr7PLwkZak06QymxqeYos0Z3eoSfW695btb2S9F8stsSW', 'https:\/\/play-lh.googleusercontent.com\/R4jZnW067AbgFCw8cTJBERmdGwa-Gc38kp569Mq5g_8Oq6fHx0WazFR64O9o24WIZA', 'https:\/\/play-lh.googleusercontent.com\/vHgRyGqx53Zjuj8q_9Z1YPER_VFKmqApmcJd_y0RKTS_J6RymwHI5bV7mNaeu59y4zv9', 'https:\/\/play-lh.googleusercontent.com\/kN-9XIT-8YgpHMr3QBFgv2kPsbtq8OuWBiOAYB8HI0P_TVW4Z24Ucp0tlBfuHpBB8NEl', 'https:\/\/play-lh.googleusercontent.com\/DwouEZVyu_xtQRvyLHckkEco7bLINRe2o8Ps9pktNVA--Jh3UaAtMS9zRmDTIrzLsFE', 'https:\/\/play-lh.googleusercontent.com\/aXhaJ2Ge2V-XzAVvMQIdebsSMxoQ0ChUGLHGvKx8EhQbgHUqQEl37u65uP7YQEq7DTA', 'https:\/\/play-lh.googleusercontent.com\/6s25yAfsoQJiSmnQeaFzYRzeeNRVYWXeMtY65eJ7SRyy5eqRlJIRRVxtncH6U4BEYA', 'https:\/\/play-lh.googleusercontent.com\/S4gRzYHVeA91b8YuUL3o11w_sN2O22OHUMD0x2WH5lIMjXd2GlSJ86_Qi4vu5lan-64', 'https:\/\/play-lh.googleusercontent.com\/-kxQoolyWndCvByf07GfoJzkrd1kkmfKBxR8d6eizReuj0HAQEwNDdRBo2RL0G0_FaI', 'https:\/\/play-lh.googleusercontent.com\/amzQZMRcixJswiZXHRTC1Hy6UrTwmGttyvRnU0vHgbYiMYkGSmMxEJZLiwjPptEh45E']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"Mar 17, 2011","lastUpdatedOn":"Apr 23, 2025","updated":1745448853,"comments":"[]","appId":"com.wsl.noom","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.wsl.noom&hl=en&gl=us"},{"title":"Calorie Counter by Lose It!","descriptionHTML":"Lose It! is a calorie counter and weight loss diet app that helps you stick to your diet and reach your weight loss goals! Simply set your weight loss goals then track your diet, food and exercise to lose weight. Lose It! is more than just a calorie tracker. You can track your nutrition, macros, carb and calorie intake, and plan your intermittent fasting schedule. Counting calories, tracking your food and losing weight has never been easier!<br><br>NEW AI Voice &amp; Photo Meal Logging!<br>Easily log meals using voice or photos with our new AI Logging features that allow you to quickly and accurately record your meals by simply speaking into your phone, or snap a picture to log your meal. Just tap the camera icon for food tracking and calorie counting in a snap.<br><br>Since our launch in 2008 we have been featured in The Wall Street Journal, The Today Show, Men’s Health, Women’s Health, CNET, Buzzfeed, CNN, Shape, Good Morning America, and more.<br><br>The Lose It! app has helped members lose over 149 million pounds, with over 57 million users starting their weight loss journeys! Lose It! offers an international food log with an extensive database of items and recipes, with more than 56 million searchable food and meal items, making it easier to track what you eat. You can choose from over 25 health goals, including macro, carbs, and calories. And with just three days of calorie counting and diet tracking, you can start seeing results in your weight loss journey.<br><br>Whether it be a keto diet, vegan diet, or intermittent fasting, Lose It! helps you find weight loss that fits by tracking nutrition, macro, carb and calories to reach your weight loss and health goals.<br><br>HOW THE LOSE IT! CALORIE COUNTER APP HELPS YOUR WEIGHT LOSS JOURNEY<br><br>Lose It! uses the proven principles of calorie counting, food tracking, calorie deficit and diet tracking to help you succeed. To get started on your weight loss journey, input your profile details and we’ll calculate the daily calorie budget. Then, easily track your food, weight, and activity to celebrate your weight loss victories. Change your calorie and diet habits while learning about your nutrition needs.<br><br>LOSE IT! CALORIE COUNTER FEATURES<br><br>•  Snap It Photo Meal Logging – easily log meals by taking a picture. Just tap the camera icon for food tracking and calorie counting in a snap.<br>• AI Voice – Log your meals effortlessly by simply saying, “I had 2 eggs, toast with butter and jam.”<br>• Barcode Scanner – quickly scan food barcodes or search our database of items and recipes to track your health and nutrition, including carbs, macro and calorie intake.<br>• Track Nutrition – track more than just calories including macro, protein, water, carb, sugar, body measurements, sleep cycles, intermittent fasting and more. Stay on top of your keto, vegan or vegetarian diet needs!<br>• Intermittent Fasting - set your intermittent fasting plan and track your fasts in the same app where you track your food.<br>• Fitness App Syncs – connect fitness trackers, workout apps, and devices like Fitbit trackers, Misfit trackers, Garmin trackers, Withings scales, Google Fit, Healthkit, and more to maximize your weight loss tracking.<br>• Meal Planning &amp; Targets – meal targets help you calculate suggested nutritional content including macro, carb, protein and overall calorie intake. Customize your diet and eating for personalized weight loss!<br>• Weight Tracker – Easily track your weight loss over time. Quickly log and graph your weight to identify your weight loss progress.<br>• Weight Loss Diet Plans – learn about your food and calorie intake habits with our exclusive personal insights to identify what is hindering or helping your weight loss progress.<br><br><br>Download Lose It! and join our weight loss community, full of members helping us reach our mission to mobilize the world to healthy weight loss. No matter your diet needs or weight loss goals, Lose It! can help you find weight loss that fits!<br><br>Full terms:<br>http:\/\/loseit.com\/terms","summary":"Lose weight & reach your health goals with Lose It! diet app and food tracker!","installs":10000000,"minInstalls":10000000,"realInstalls":19591529,"score":4.682207,"ratings":154475,"reviews":42199,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$4.99 - $189.99 per item","developer":"FitNow, Inc.","developerEmail":"android@loseit.com","developerWebsite":"http:\/\/www.loseit.com","privacyPolicy":"http:\/\/www.loseit.com\/privacy\/","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/eQXGwwKkSAqezH7nicdMhsM7BfUf29XQFtPbJLdOH81Grtk8ylKqZGISzcWcSddgcWs","headerImage":"https:\/\/play-lh.googleusercontent.com\/_LnfXm8Tp8L4GoV8ApTfKk9eLOa5Kj39sx-IZ0W-8Q6q4F6BptZaOpNpzFkPYSDzRlc","screenshots":"['https:\/\/play-lh.googleusercontent.com\/iFXexxXlXI46oYKAox_dgrcURpcvv6HbjUuVTz8GOsYB-pO8HvlvU3DS-r1r-tL6-n4', 'https:\/\/play-lh.googleusercontent.com\/Kc65rucUFqpDbI_1sS9l9iFl9AiZGjQ8EwTydVRahwyvx8TKLu8QivzXBGwmiU6Tuw', 'https:\/\/play-lh.googleusercontent.com\/BaVAmDBiJeH8UsYZHYt29Ln-WXW4CRPM1-UYcFgC6yULQlk8-HL2CLO8N7fsg6jW7Q', 'https:\/\/play-lh.googleusercontent.com\/IH9nGHE43CBJPfwuNOCTOLBpzxgOcWLFfcqONkduxniUbM-JyteaS81OEDY8sow-6w', 'https:\/\/play-lh.googleusercontent.com\/-HpUFBG-bG-nQi8vykUQCD5rITrKHfB3F4WqEM8ATzT43DktU1lXvz9mwokSsupUPA', 'https:\/\/play-lh.googleusercontent.com\/rYU4vh-e67D-zWVpPJ9JZWr4yfY17JmfaOTpPM2ZQG634LAhVLK9hsg2Vj3-MDoYIg8', 'https:\/\/play-lh.googleusercontent.com\/mWEX2aulcX7Zcv5rpnKcm8wo0C1P_wq7u3LCk7MKS2bRi6CT24qVQ7NHrwN6rFXZ6hlT', 'https:\/\/play-lh.googleusercontent.com\/uArpjDnJqdpAWicBIbY0sU8jqqfizGFkgqAW9-W-NvK03kFebctQsn8W9vQ7bI9X2as']","contentRating":"Everyone","adSupported":true,"containsAds":true,"released":"Jul 24, 2011","lastUpdatedOn":"Apr 28, 2025","updated":1745851803,"comments":"[]","appId":"com.fitnow.loseit","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.fitnow.loseit&hl=en&gl=us"},{"title":"Calm - Sleep, Meditate, Relax","descriptionHTML":"Calm is the #1 app for sleep, meditation and relaxation. Manage stress, balance moods, sleep better and refocus your attention. Guided meditation, Sleep Stories, soundscapes, breathwork and stretching exercises fill our extensive library. Practice self-healing and discover a happier you through Calm.<br> <br>Feel better by reducing anxiety, prioritizing your self-care and choosing a guided meditation session that fits within your busy schedule. Introduce mindfulness and breathing exercises into your daily routine and experience their life-changing benefits. Meditation novice or seasoned expert, Calm is for anyone who is looking to improve their sleep and address everyday stress.<br> <br>Sleep better with Sleep Stories, bedtime stories that lull you into a restful slumber. Relaxing sounds and calming music also help you meditate, focus and sleep soundly. Balance your mood and improve your sleep cycle by picking from 100+ exclusive Sleep Stories, narrated by well-known talent like Cillian Murphy, Rosé, and Jerome Flynn. Meditate daily to relieve anxiety and learn to put your personal health first.<br> <br>Take a deep breath and find your Calm.<br> <br>CALM FEATURES<br> <br>MEDITATION &amp; MINDFULNESS<br>* Meditate with seasoned experts, regardless of your experience level<br>* Be mindful in your daily routine and learn to calm your thoughts<br>* Mindfulness topics include Deep Sleep, Calming Anxiety, Focus and Concentration, Breaking Habits and so much more<br> <br>SLEEP STORIES, RELAXING MUSIC &amp; SOUNDSCAPES<br>* Sleep soundly listening to Sleep Stories, bedtime stories for adults and children alike<br>* Tackle insomnia with calming music, sleep sounds and full soundscapes<br>* Self-care: Sleep content to help you relax and get into a state of flow<br>* Relax and experience deep sleep with new music added every week, from top artists<br> <br>ANXIETY RELIEF &amp; RELAXATION<br>* Stress management and relaxation with daily meditation and breathing exercises<br>* Self-healing through Dailies - Reduce anxiety with daily 10-minute original programs like the Daily Calm with Tamara Levitt or the Daily Trip with Jeff Warren<br>* Mental health is Health - Tackle social anxiety and  personal growth through inspiring stories<br>* Self-care through mindful movement: Relax your body during the day with Daily Move<br> <br>ALSO FEATURING<br>* Emotion and mental health tracker through Daily Streaks &amp; Mindful Minutes<br>* Feel better with 7- and 21-day mindfulness programs for beginner &amp; advanced users<br>* Soundscapes: Nature sounds and scenes to calm your nerves<br>* Breathing exercises: Find peace and concentration with a mental health coach<br> <br>Calm is free to download and use. There are never any ads and some of the programs and features are free forever. Some content is only available through an optional paid subscription. If you choose to subscribe, payment will be charged to your Google Account at confirmation of purchase.<br> <br>Be sure to check out our Wear OS app with tiles to quick-start breathing exercises and complications that help you track meditations.<br><br>What is Calm?<br>Our mission is to make the world a happier and healthier place. Through our website, blog, and app—filled with meditations, sleep stories, music, movement, and more—we’re redefining what mental health care looks like in 2021 and beyond. With over 100 million users worldwide, 100,000 new users daily, and our growing partnerships with major companies, we’re having a positive effect on more and more people each day.<br> <br>Calm is recommended by top psychologists, therapists, mental health experts, and the press:<br><br>* “I’m generally wary of meditation apps because they sometimes weave in too much mystic talk for my taste. But Calm instead contains guidance like ‘Concentrate on your body’” - New York Times<br><br>* “In the frenetic, crazy, digital world we live in, sometimes it&#39;s necessary to take a step back and smell the roses” - Mashable<br> <br>* “Eliminating distraction...ended up helping me relax and realize that all the stuff I was stressing about wasn&#39;t that big a deal” - Tech Republic","summary":"Tackle everyday stress and anxiety. Self-care and sound sleep through meditation","installs":50000000,"minInstalls":50000000,"realInstalls":62242250,"score":4.4413466,"ratings":593468,"reviews":62372,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$0.99 - $399.99 per item","developer":"Calm.com, Inc.","developerEmail":"android@calm.com","developerWebsite":"http:\/\/www.calm.com","privacyPolicy":"https:\/\/www.calm.com\/privacy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/S76GphUu2pZa249td2Bb4XAhLcPRrFdL1zp_5qU1ouukvRq9r0-8jJ-CruaTtdT6g84","headerImage":"https:\/\/play-lh.googleusercontent.com\/16wOhncmCb6B3-yA4bybRFrRGGpR5YJ6KejF8GwlGv7Fq4S5FpZrWzsqf6ST4Ay3zw","screenshots":"['https:\/\/play-lh.googleusercontent.com\/bGRJKRuIWbZnPzdOnkiV5NOIrKuRsS7hHC_hk_w_gQoooylgvNkauMmGwarQ8b1P-no', 'https:\/\/play-lh.googleusercontent.com\/d9K32zTzoiUEC0aNNz6kCx50KojzWa7qvFkMw2JoOpl8UymJ7HqcvwETTZx0lVro6g', 'https:\/\/play-lh.googleusercontent.com\/QrdCMSEYoKN41r4y3aGAGrmL4Zfniw1XjnIQoV7-YPeFoIkZYvzmGnlyW0SmgNk-Xpuf', 'https:\/\/play-lh.googleusercontent.com\/SQMgjIObnMtcvnhEbm9Fp_mmoht-bGY61MGi7B0SarlKttWqsEFReJ4zrK2QKTON7g', 'https:\/\/play-lh.googleusercontent.com\/qeRtcV3f4QcR9Zrx3n7OQ2fu9Zc3EJLHRq4-ARocEEIv-nuKQ6Gk2GsfFNlxZmEkdpA', 'https:\/\/play-lh.googleusercontent.com\/k9VXrUgvsd4RrNm-OC1pZaa6Ff6iQFpjJD9OHGez5nOSUJLr9UbX-RNw1wLbxIBTJ29J', 'https:\/\/play-lh.googleusercontent.com\/TI6aAt_7M5pXslPBMF8Q3j1peUhPWgtgbg8vksSMSfoaVYl4qImx11vqAyG7Xv7cx49D', 'https:\/\/play-lh.googleusercontent.com\/CEzMII9_fTfW8ORzUOYbBZKbvlzfjzJ8HXZjboEsSkB-sQ_CTgYU0HLCrHc7FjSwkeHT', 'https:\/\/play-lh.googleusercontent.com\/81J5T0eqW2ataPVcCvm2Zbae66YrNyvrG_9XQr9ET9stw697z-AP3CbbX0XgFJUJgFJ3', 'https:\/\/play-lh.googleusercontent.com\/2CbNQ6n_xvkAPzyksWKW4-Gb3952dBQaKt6oGNePBMDZn7AHk3m7PNSnkFpxiZyBT-OQ', 'https:\/\/play-lh.googleusercontent.com\/xVJPhBrZH2N-WiNkeUngOgxiSN19XJqChYDORQhJAGUX_joyXzzYVaO9NFy7YE7a_yKv', 'https:\/\/play-lh.googleusercontent.com\/V8lNEcBYzagSx7LanXRIqZ857pQ8cgKSAcvPqHSSCozRGOKOhnmvvT7j5FM4i_T5QQ', 'https:\/\/play-lh.googleusercontent.com\/dsbVCJbKSOWgsj67ijBlQZ7dduFYI-7leReOTMrkIIR7_YrJuQKt1kvTkhvWH_h5Ayw', 'https:\/\/play-lh.googleusercontent.com\/3RewM9lg0ZF2_ioNEDSLoO6BZIygSA_FGDwWYX3CzwWuo8a7KhGhCh8RMjhh6Q25-lA', 'https:\/\/play-lh.googleusercontent.com\/U4tl3YafcV9MmQAH27bi0iIyzOD7O0ovNJOassnXtzKhJp3a4oydw7Yy2JWLKTpA6g', 'https:\/\/play-lh.googleusercontent.com\/pz0Q9o6pRZD0qLhAvySDlw41BV7iSKfeRVoH50ajlYhtj5Vw3QwuvHfNYCh7aclFEw', 'https:\/\/play-lh.googleusercontent.com\/ZjM53hAv1BBaftSQefiQtiDbvjQVwkXLXLBFTsgvstYNQaT5jAXaPG6hBsWY2L-o8w', 'https:\/\/play-lh.googleusercontent.com\/kIwGVLxaivIEfHmr1imfhQZkWre5X4TzXpuY9H5A4bRJNUdE0p98f_lkdPLE07EsOQ', 'https:\/\/play-lh.googleusercontent.com\/RBqzEUCcMjygdKQTjEy3z6k1EaheJvndeeSrdOHRgeQ6Bs37svvBIPF3TjW7dm3Dy59x', 'https:\/\/play-lh.googleusercontent.com\/W0t-BTN6rFaVMPYJQYRlh-LM_FMhBvYJ7AuOQMvxCmYmPZRYufEBTy7Gu7GaYJujZU64', 'https:\/\/play-lh.googleusercontent.com\/tk8pzFk-9dUUfTyWmjpcvQB6Upy50fDuR_VY8daLhPmXXUzRujDw4cceBR6yvGelul2m', 'https:\/\/play-lh.googleusercontent.com\/V5PqBipgooUaVS9Jk9x7-XFF5M4y6Jm606tlagqn7n3-8DVzrnMj21XcWw8aXBPtnQ']","contentRating":"Everyone","adSupported":false,"containsAds":false,"released":"Jul 30, 2014","lastUpdatedOn":"Apr 28, 2025","updated":1745850953,"comments":"[]","appId":"com.calm.android","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.calm.android&hl=en&gl=us"},{"title":"AllTrails: Hike, Bike & Run","descriptionHTML":"Whether you hike, bike, run, or walk, AllTrails is your companion and guide to the outdoors. Find detailed reviews and inspiration from a community of trail-goers like you. We’ll help you plan, live, and share your outdoor adventures.<br><br>AllTrails offers more than a running app or fitness activity tracker. It’s built on the idea that the outside isn’t a place to seek, but rather a part of us all. Custom route planning helps you search for dog-friendly, kid-friendly, stroller-friendly, or wheelchair-friendly trails, and more.<br><br>◆ Discover trails: Search over 450,000 trails around the world by location, interest, skill level, and more.<br>◆ Plan your next adventure: Get in-depth trail info, from reviews to conditions to GPS driving directions — and save your favorite trails for later.\t<br>◆ Stay on course: Stick to your planned route or chart your own course with confidence when you navigate on the trail with your phone or Wear OS device. Use Wear OS to leverage tiles and complications to start and monitor your activities.\t<br>◆ Grow your community: Celebrate outdoor adventures and find inspiration by connecting with trail-goers like you. <br>◆ Share your outdoor adventures: Easily post trails and activities on Facebook, Instagram, or WhatsApp. <br><br>Discover trails that fit your nature. Trails for workout planners, hikers, walkers, mountain bikers, trail runners, and casual cyclists. Whether you’re pushing your limits or pushing a stroller, there’s something out there for everyone. Let AllTrails help you find it.  <br><br>► Do more outdoors with AllTrails+ ►<br>Spend less time figuring out where you want to be, and more time enjoying where you are. With offline maps, wrong-turn alerts, and extra safety and planning features, your annual subscription gives you more tools for more adventures.<br><br>◆ Search by distance from you to find the closest trails.<br>◆ Stay informed with live route planner details like air quality, pollen, and light pollution.<br>◆ Unplug completely or pack a backup with printed maps.<br>◆ Download offline maps ahead of time and track your GPS location, even with no cell service.<br>◆ Keep loved ones in the loop with Live Share.<br>◆ Prepare for the hills ahead: Follow topo maps and trail maps in 3D.<br>◆ Focus on the view, not the map, with wrong-turn alerts.<br>◆ Get satellite weather with real-time map details.<br>◆ Record your activity with stats and photos of your favorite hiking trails.<br>◆ Give back: AllTrails donates a portion of every subscription to 1% for the Planet.<br>◆ Explore ad-free: Remove occasional ads by subscribing<br><br>Whether you’re geocaching in a national park, browsing bucket-list mountain bike routes, or planning a trail run to clear your head, AllTrails+ makes the great outdoors even greater.","summary":"Explore the outdoors: hiking trail maps, bike trails, camping & backpacking maps","installs":10000000,"minInstalls":10000000,"realInstalls":36920982,"score":4.763543,"ratings":364717,"reviews":22545,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$1.00 - $35.99 per item","developer":"AllTrails, LLC","developerEmail":"android-support@alltrails.com","developerWebsite":"https:\/\/www.alltrails.com","privacyPolicy":"https:\/\/www.alltrails.com\/privacy","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/u9GH1z_4T_YrQFA8OcgTUqUeaRU9Sh99i2ptfrpwTvEhvw3etf7L0MGzABgjJ_b4U9o","headerImage":"https:\/\/play-lh.googleusercontent.com\/zuwrVptiuNJioQVJaxF_bj9etMKg7UzGpYjAnSugwBQjdgmQG3aJUs0O40P9fxzoM_s","screenshots":"['https:\/\/play-lh.googleusercontent.com\/Q_L4drOrNLVUqdMrev-y4KQgIGjn_1_AO4-BK-10t-JZ-frv69UXygR31GaSGHs6sl4', 'https:\/\/play-lh.googleusercontent.com\/ouCwTLmR55ucyeJVtsycSeeh5NAGi5WfzHufnRRp_kY571oL4ZDKxVru0yJGuLW24AL7', 'https:\/\/play-lh.googleusercontent.com\/8YcYSyltqwYkKbmNL6Ef0rxOcL5vjzHFwp7Zah9u0mW2rS58USnvI27jxej2L4Up41c', 'https:\/\/play-lh.googleusercontent.com\/cb6Kj78bDnZUj17GyQdncJ66JICG5DpDk92_JdVA2GhN9arFlCEIoCxk2ogg6Ml0qw', 'https:\/\/play-lh.googleusercontent.com\/CmFxXnPMlnVEAIhjXoioR7VidPngD52edbTwhCKtKeHu_3ySDbtFu486grCi9JzS-g', 'https:\/\/play-lh.googleusercontent.com\/Aj8sSZEzg4vlv9dvx9ObkaYoaNo5aEbEJu8gNHtLeRF6AXp0w0BLWq9liJhEqYSrmCw', 'https:\/\/play-lh.googleusercontent.com\/57wdrjGnRPy13HE6Mxkv5ftk9NFEI5DIRh0kAPO8PNuAjQgVU5dZG52LnJBnmxy0nQ', 'https:\/\/play-lh.googleusercontent.com\/d_5FCIuQ1oqm3oZKH-LqgtHY-08dr-wvwfbCfYu4uwScogBdtZ_Mz5S07FTMRNDId9A', 'https:\/\/play-lh.googleusercontent.com\/CYMoO0xM-a9kjwLYT9tKY6d64R93fJ0uZ5aHpczAb332Q5LhgukGJbD_ExovPYGpUg', 'https:\/\/play-lh.googleusercontent.com\/_kL-t81wnx0gxJAbzTMQnBItaiMVwZdzj5mUzA_wxd4lQNAYNzd1HYZHmFV1vHn0oJc', 'https:\/\/play-lh.googleusercontent.com\/wbUr_3ka5KgghQYolkWBPjXqFE8Aj7Nx5Fm7FTlyL9GydrFtalCDfrnZoO8hH1fExepy', 'https:\/\/play-lh.googleusercontent.com\/3f4Gdwwy7-ivEEtZ1BNvG8pbTxFTuWeAxiu_GIyJi7BE9ellzKoDdWWdtHuLQ_d9Hcs', 'https:\/\/play-lh.googleusercontent.com\/UOgeehjaAVBkeu1b7mDCIS_cC6jBpPN_gv2Kgmgm3FJXTx7f0XGL3mcimwPUTsMddg']","contentRating":"Everyone","adSupported":true,"containsAds":true,"released":"Sep 13, 2011","lastUpdatedOn":"Apr 21, 2025","updated":1745275462,"comments":"[]","appId":"com.alltrails.alltrails","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.alltrails.alltrails&hl=en&gl=us"},{"title":"Freeletics: Fitness Workouts","descriptionHTML":"<b>Europe’s #1 fitness app<\/b> lets you work out anytime, anywhere with the <b>best digital personal trainer<\/b> - no gym required. Whatever your fitness level, achieve your goals quickly and build healthy habits with personalized HIIT workouts and audio coaching. Losing weight, gaining muscle or improving your fitness has never been so simple. <br><br><b>WHY FREELETICS?<\/b> <br>- Freeletics means freedom. Work on yourself and your fitness free of excuses like time, equipment, space, money or know-how. Join 42 million others doing their workout whenever and wherever they want. <br>- See fast results with the most advanced digital personal trainer and effective HIIT workouts. Your AI personal trainer tailors everything to you, learning from each exercise and piece of feedback to create your perfect workout, every time. No two people get the same workout plan - this is fully personalized fitness.<br>- We follow a holistic approach to fitness and self-development. We combine HIIT fitness, mindfulness, knowledge and motivation to help you perfect your training and build a strong foundation for life-long positive change.<br> <br>The <b>free version<\/b> of the app contains<b> 20 HIIT bodyweight workouts, 25 exercises, 20 audio sessions, workout spots and a community of millions<\/b>. If you want to set yourself up for long-term success with the guidance of a personal trainer every step of the way, you can sign up for the Freeletics Coach with a 14-day money back guarantee. <br><br><br><b>What you get by upgrading to the Freeletics Coach:<\/b><br><br><b>TRAINING<\/b> <br>- Enjoy your own AI-powered personal trainer, who puts every HIIT workout together based on your experience, goals, fitness level and preferences.<br>- Travelling or short on time? Need to be quiet? Stuck without equipment or can’t go for a run? No problem. Tell your personal trainer what’s going on and it will adapt your workout to suit your needs.<br>- Your workout plan will be compiled in a “Training Journey.” Choose from 20 Training Journeys in the app, each with a different fitness focus. Look out for our limited editions by professional athletes.<br>- Choose your workout style. Whether it’s running, bodyweight HIIT or weights in the gym - or a combination of these - there’s a Training Journey for you. Fitness will never be boring again.<br>- Progress in your training with thousands of HIIT workout variations and over 180 exercises.<br><br>The AI-Coach builds customized training plans, available in all subscriptions.<br><br><b>MINDSET<\/b><br>- Add audio coaching to your personal trainer, helping you build a strong, balanced mindset and find lasting motivation to improve your health and fitness. The perfect complement to your HIIT workouts.<br>- In 5 to 20-minute sessions, learn how to build habits, boost weight loss, de-stress and improve your focus, training, recovery and sleep. The perfect foundation for real success.<br>- Courses include focus, stress, sleep, fitness, nutrition and motivation.<br><br>The Mindset Coach is only included in the Body &amp; Mind bundle.<br><br><br><b>SUBSCRIPTIONS AND TERMS<\/b><br>We offer 8 auto-renewing subscription options:<br>- Training (3 \/ 6 \/ 12 months)<br>- Training &amp; Nutrition (3 \/ 6 \/ 12 months)<br>- Body &amp; Mind (3 \/ 12 months)<br> <br>The Nutrition Coach is part of the Freeletics Nutrition app.<br><br>By purchasing, you accept our Terms of Use (https:\/\/www.freeletics.com\/en\/pages\/terms\/) and Privacy Policy (https:\/\/www.freeletics.com\/en\/pages\/privacy\/).<br> <br>Contact us at https:\/\/help.freeletics.com\/hc\/en-us or follow @Freeletics on social media for daily workout inspiration. Your personal trainer is ready when you are. Happy training.","summary":"A personal trainer in your pocket. At-home HIIT workouts & custom training plans","installs":10000000,"minInstalls":10000000,"realInstalls":36415830,"score":4.187964,"ratings":254528,"reviews":4444,"price":0,"free":true,"currency":"USD","offersIAP":true,"inAppProductPrice":"$0.99 - $210.00 per item","developer":"Freeletics","developerEmail":"support@freeletics.com","developerWebsite":"https:\/\/www.freeletics.com","privacyPolicy":"https:\/\/www.freeletics.com\/pages\/privacy\/","genre":"Health & Fitness","genreId":"HEALTH_AND_FITNESS","categories":"[{'name': 'Health & Fitness', 'id': 'HEALTH_AND_FITNESS'}]","icon":"https:\/\/play-lh.googleusercontent.com\/vpP79lRogNPurOpnIVEhm1Y2ySWI7zIXE5Mk2fhW1eVI2TQFOfvD8WoaQBI7k7dlbls","headerImage":"https:\/\/play-lh.googleusercontent.com\/j0z8v2ThswRD0Peyi98EcJxLgKAqgQRyUibP9Y8ABUMljjtnjpXSB5HrAG00KA7EmYw","screenshots":"['https:\/\/play-lh.googleusercontent.com\/HoYGDhus23sBkdDwUCUXVm09nIpb5HoxNJ9cUB2KVLKlEj_piTUrQfeMW1cdfZvVFik', 'https:\/\/play-lh.googleusercontent.com\/DQ_F4Tpl6WtaMAuy9bFxdE5aQPolV28W0XK5czjBAxUlLGQkJATfIdMLreef4Lk3EJs', 'https:\/\/play-lh.googleusercontent.com\/pJ396lKIBhyztJ8lPCb1F2gC8qQjc8dDQSmoeqNR6w3Op8uM9xe7XQjKcGK2kGPAPoHj', 'https:\/\/play-lh.googleusercontent.com\/iro84f_mpQYRJIEodkPcmHSu-Fsn1rHOMzBaoek37bAQXqctGZINJJO5P5x9CHjlHSI', 'https:\/\/play-lh.googleusercontent.com\/3c_Xtv_oj0EnkGgAlt_8ZO3h6VTWUz4XPQfhCF6cqjtWmYtI0NZybbGX-ejGFUF_00Y', 'https:\/\/play-lh.googleusercontent.com\/AKbHXbF66vhtDMct7STPKFvANwr7R7cPeUQO_tv4Gn539UxOsAKgJFFr-JzSQWKQ4A', 'https:\/\/play-lh.googleusercontent.com\/REQn1gyOYxg8IdfAqify-jM3NhCgb04fqMO-dS1siH8ySAT2hSkz60XZ-EPtgRm2Cg', 'https:\/\/play-lh.googleusercontent.com\/f61YFmrNby8TRtXREv6vvyhVQvAw4YK69qVou1Uv79wA9VKvmW95kmAeMyc1-cBpxQw']","contentRating":"Everyone","adSupported":true,"containsAds":true,"released":"Jan 2, 2014","lastUpdatedOn":"Apr 28, 2025","updated":1745834619,"comments":"[]","appId":"com.freeletics.lite","url":"https:\/\/play.google.com\/store\/apps\/details?id=com.freeletics.lite&hl=en&gl=us"}]